
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Ссылка = Справочники.СпособыОтраженияЗарплатыВРеглУчете.НеОтражатьВБухучете Тогда
		Возврат; // Заполненность счетов проверять не надо
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(СчетДт) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан счет дебета!", Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СчетКт) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан счет кредита!", Отказ);
	КонецЕсли;
	
КонецПроцедуры
