Перем мСтруктурнаяЕдиница;

Процедура РегистрСведенийСписокПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)

	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;

	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","ОтветственноеЛицо"), Элемент.ТекущиеДанные.СтруктурнаяЕдиница);
	Если мСтруктурнаяЕдиница <> Элемент.ТекущиеДанные.СтруктурнаяЕдиница Тогда

		// Оповестим также форму той структурной единицы, данные которого начинали редактировать.
		Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","ОтветственноеЛицо"), мСтруктурнаяЕдиница);
		мСтруктурнаяЕдиница = Элемент.ТекущиеДанные.СтруктурнаяЕдиница;

	КонецЕсли;

КонецПроцедуры

Процедура РегистрСведенийСписокПриНачалеРедактирования(Элемент, НоваяСтрока)
	мСтруктурнаяЕдиница = Элемент.ТекущиеДанные.СтруктурнаяЕдиница;
КонецПроцедуры



