
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)

	ПроверятьПриЗапуске = ВосстановитьЗначение("ПроверкаНаличияОбновленияПроверятьПриЗапуске");
	ПроверятьПриЗапуске = ?(ТипЗнч(ПроверятьПриЗапуске)=Тип("Неопределено"),Истина,ПроверятьПриЗапуске);
	ПоказПриПоявленииНовойВерсии = ВосстановитьЗначение("ПроверкаНаличияОбновленияПоказПриПоявленииНовойВерсии");
	ПоказПриПоявленииНовойВерсии = ?(ТипЗнч(ПоказПриПоявленииНовойВерсии)=Тип("Неопределено"),Ложь,ПоказПриПоявленииНовойВерсии);

КонецПроцедуры

Процедура ПоказатьДомашнююСтраницу(Элемент)

	ПолучитьФорму("Форма").Открыть();

КонецПроцедуры

Процедура ПриЗакрытии()

	СохранитьЗначение("ПроверкаНаличияОбновленияПроверятьПриЗапуске", ЭлементыФормы.ПроверятьПриЗапуске.Значение);
	СохранитьЗначение("ПроверкаНаличияОбновленияПоказПриПоявленииНовойВерсии", ЭлементыФормы.ПоказПриПоявленииНовойВерсии.Значение);
	СохранитьЗначение("ПроверкаНаличияОбновленияПоследняяВерсия", ЭлементыФормы.ВерсияДистрибутива.Значение);

КонецПроцедуры

Процедура ОсновныеДействияФормыСправка(Кнопка)

	ОткрытьСправку(Метаданные.Обработки.Обозреватель.Формы.ПроверкаНаличияОбновления);

КонецПроцедуры





