
// Возвращает префикс кодов и номеров объектов информационной базы по умолчанию
//
// Параметры:
//  Нет.
// 
// Возвращаемое значение:
//  Строка, 2 - префикс кодов и номеров объектов информационной базы по умолчанию
//
Функция ПрефиксИнформационнойБазыПоУмолчанию() Экспорт
	
	Возврат "БП";
	
КонецФункции

Процедура ВыполнитьОбновлениеДанныхПриПереходеСВерсии20НаВерсию30(ПланыОбменаМассив = Неопределено) Экспорт
	
	Если ПланыОбменаМассив = Неопределено Тогда
		ПланыОбменаМассив = Новый Массив;
	КонецЕсли;
	
	// выполняем обновление РС СоответствиеОбъектовИнформационныхБаз
	Выборка = РегистрыСведений.СоответствиеОбъектовИнформационныхБаз.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = Выборка.ПолучитьМенеджерЗаписи();
		МенеджерЗаписи.Прочитать();
		
		СтруктураЗаписи = Новый Структура("УзелИнформационнойБазы, УникальныйИдентификаторИсточника, УникальныйИдентификаторПриемника, ТипПриемника, ТипИсточника");
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи, МенеджерЗаписи);
		
		НаборЗаписей = ОбменДаннымиСервер.СоздатьНаборЗаписейРегистраСведений(СтруктураЗаписи, "СоответствиеОбъектовИнформационныхБаз");
		
		// добавляем только одну запись в новый набор записей
		НоваяЗапись = НаборЗаписей.Добавить();
		
		// заполняем значения свойств записи из переданной структуры
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтруктураЗаписи);
		
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		
		// записываем набор записей
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	// удаляем регистрацию изменений
	Для Каждого ИмяПланаОбмена Из ПланыОбменаМассив Цикл
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	ПланОбмена.Ссылка
		|ИЗ
		|	ПланОбмена.[ИмяПланаОбмена] КАК ПланОбмена
		|ГДЕ
		|	ПланОбмена.Ссылка <> &ЭтотУзел
		|
		|";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[ИмяПланаОбмена]", ИмяПланаОбмена);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена[ИмяПланаОбмена].ЭтотУзел());
		Запрос.Текст = ТекстЗапроса;
		
		МассивУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Для Каждого Узел Из МассивУзлов Цикл
			
			ПланыОбмена.УдалитьРегистрациюИзменений(Узел);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик вызывается перед записью объекта при загрузке данных в универсальном обмене данными
//
Процедура ПередЗаписьюОбъекта(Объект, Отказ) Экспорт
	
	// Дополнительной обработки не предусмотрено
	Возврат;	
	
КонецПроцедуры
