
// Обработчик события формы "ПередОткрытием".
// 
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ПризнакОткрытияФормыИзЯзыка Тогда
		Предупреждение("Данная обработка используется в служебных целях, открытие формы запрещено.");
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

// Обработчик события "Нажатие" кнопки "ОК" командной панели формы "ОсновныеДействияФормы"
// 
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Перем HTTP;
	
	Если ЗапомнитьИмяИПароль Тогда
		СохранитьЗначение("ЗапомнитьИмяИПарольПрокси", Истина);
		СохранитьЗначение("ИмяПользователяПрокси"    , ИмяПользователя);
		СохранитьЗначение("ПарольПользователяПрокси" , ПарольПользователя);
	Иначе
		СохранитьЗначение("ЗапомнитьИмяИПарольПрокси", Ложь);
		СохранитьЗначение("ИмяПользователяПрокси"    , "");
		СохранитьЗначение("ПарольПользователяПрокси" , "");
	КонецЕсли; 
	
	Попытка
		ПроксиСервер = Новый ИнтернетПрокси();
		ПроксиСервер.Пользователь = ИмяПользователя;
		ПроксиСервер.Пароль       = ПарольПользователя;
		HTTP = Новый HTTPСоединение(СерверИсточник,,,, ПроксиСервер);
		HTTP.Получить(СтрокаПараметраПолучения, ИмяВходящегоФайла);
	Исключение
		Если ПустаяСтрока(ОписаниеОшибки()) Тогда
			Сообщить("Не удалось установить соединение с сервером!");
		ИначеЕсли Найти(ОписаниеОшибки(), "407") <> 0 И Найти(НРег(ОписаниеОшибки()), "authentication") <> 0 Тогда
			Предупреждение("Не правильные имя или пароль доступа!");
		Иначе
			Сообщить("" + ОписаниеОшибки());
		КонецЕсли; 
		Возврат;
	КонецПопытки;
	
	ЭтаФорма.Закрыть(HTTP);
	
КонецПроцедуры
