///////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "Перед записью".
//
// Параметры:
//  Отказ     - <Булево>
//            - Признак отказа от записи набора регистра сведений. Если в теле
//              процедуры-обработчика установить данному параметру значение
//              Истина, запись выполнена не будет.
//              Значение по умолчанию: Ложь.
//
//  Замещение - <Булево>
//            - Режим записи набора.
//              Истина - запись осуществляется с заменой существующих в базе
//              данных записей набора.
//              Ложь - запись осуществляется с "дописыванием" текущего набора
//              записей.
//
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Запись = Неопределено;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Запись.Идентификатор) И НЕ ЗначениеЗаполнено(Запись.Модель)
			 И НЕ ЗначениеЗаполнено(Запись.Параметры) И НЕ ЗначениеЗаполнено(Запись.Компьютер) Тогда
			Сообщить("Не указана обработка обслуживания!", СтатусСообщения.Важное);
			Отказ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры // ПередЗаписью()
