#Если Клиент Тогда
	
	Перем НП Экспорт;
	Перем СтруктураПараметров;
	Перем ИтогиБУ, ИтогиНУ;
	Перем ЭтоЕНВД;
	Перем МассивПрямых, МассивПрямыхНУ;         // 20 и 23 счета
	Перем МассивКосвенных, МассивКосвенныхНУ;   // 25, 26  счета
	Перем МассивВсехКосвенных, МассивВсехКосвенныхНУ;   // 25, 26, 44 счета
	Перем МассивИздержек, МассивИздержекНУ;     // 44 счет
	Перем МассивВсехЗатрат, МассивВсехЗатратНУ; // 20,23,25,26,44 счета
	Перем МассивЗапасовБУ, МассивЗапасовНУ;     // 01,02,03,04,05,07,08,10,21,41, 42, 43,45, 76.01.2 (БУ), 97, без 41.12,42.02
	Перем МассивЗапасов2БУ, МассивЗапасов2НУ;   // 07,08,10,21,41,42,43,45, 76.01.2 (БУ), 97.01,97.02,97.21,76.01.2
	Перем МассивОСБУ, МассивОСНУ;               // 01,02,03,04,05
	Перем МассивДоходовБУ, МассивДоходовНУ;     // 90.01,91.01
	Перем МассивРасходовБУ, МассивРасходовНУ;   // 90.02,91.02
	Перем МассивРасчетовБУ, МассивРасчетовНУ;   // 60,62,66, 71,73,76
	Перем МассивУбытков;                        // 97.11, 97.12
	Перем МассивРБПБУ, МассивРБПНУ;             // 97.01,97.02,97.21,76.01.2
	Перем Массив9091БУ, Массив9091НУ;           // 90 и 91
	Перем СчетПустойХозрасчетный;
	Перем НоменклатурныеГруппыЕНВД;             // Номеклатурные группы, по которым отражен оборот по кредиту 90.01.2
	Перем ВидыРасходовНеЕНВД;                   // не ЕНВД и распределеямые
	Перем НеЕНВД, ЕНВД, Распределяются;
	Перем ВидыПрочейРеализации, ВидыРеализацииТоваров; // список видов расходов 91
	Перем МассивРозницы;
	Перем НомерТекущейСхемы;
	Перем ПоказыватьКрасныйПрямоугольник;
	Перем ОбластьШапка;
	Перем СохраненнаяНастройка Экспорт;
	Перем НачалоПериодаТек, КонецПериодаТек;
	Перем ПоддержкаПБУ18,ПрименяетсяУСН;
	Перем Счет90_1,Счет90_2,Счет90_7,Счет90_8;
	Перем СчетРасходовнеЕНВД,СчетРасходовЕНВ;
	Перем Счет90_1ЕНВД,Счет90_2ЕНВД,Счет90_7ЕНВД,Счет90_8ЕНВД;
	Перем Счет99,Счет99ЕНВД;
	Перем СвойстваОрганизации Экспорт;

	
//////////////////////////////////////////////////////////
// ПОСТРОЕНИЕ ОТЧЕТА
//
	
	// Выполняет выбор режима формирования отчета, заполняет общие переменные
	//
	Процедура СформироватьОтчет(ДокументРезультатТекущий, НомерТекущейСхемы) Экспорт
		ДокументРезультатТекущий.Очистить();
		ДокументРезультатТекущий.Показать();
		
		НачалоПериодаТек = НачалоДня(НачалоПериода);
		КонецПериодаТек  = КонецДня(КонецПериода);
		
		Если НомерТекущейСхемы > 20 И ЗначениеЗаполнено(Организация.ГоловнаяОрганизация) Тогда
			Организация = Организация.ГоловнаяОрганизация;
		КонецЕсли;
		
		СписокОП = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделенийОрганизации(Организация);
		СписокОП.Добавить(Организация.Ссылка);
		
		Если ЗначениеЗаполнено(Организация.ГоловнаяОрганизация) Тогда
			СвойстваОрганизации = Новый Структура("Организация,ЕстьОП,ГоловнаяОрганизация,СписокОП", Организация, Истина, Организация.ГоловнаяОрганизация,СписокОП);
		Иначе
			СвойстваОрганизации = Новый Структура("Организация,ЕстьОП,ГоловнаяОрганизация,СписокОП", Организация, НЕ СписокОП.Количество() = 1, Организация, СписокОП);
		КонецЕсли;
		
		СтавкаНалогаНаПрибыль = НалоговыйУчет.ПолучитьСтавкуНалогаНаПрибыль(Новый Структура("Организация, Дата", Организация, КонецДня(КонецПериодаТек))) * 100;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("СтавкаНалогаНаПрибыль", СтавкаНалогаНаПрибыль);
		
			мУчетнаяПолитикаРегл = ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(КонецПериодаТек, Ложь, Организация, , Истина);
		    ЭтоЕНВД = ?(мУчетнаяПолитикаРегл.Количество() = 0, Ложь, мУчетнаяПолитикаРегл.ОрганизацияЯвляетсяПлательщикомЕНВД);
			
			Если НЕ ЗначениеЗаполнено(мУчетнаяПолитикаРегл) Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли; 
			
			ПоддержкаПБУ18 = мУчетнаяПолитикаРегл.ПоддержкаПБУ18;
			ПрименяетсяУСН = мУчетнаяПолитикаРегл.УСН;
			Счет90_1 = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД;
			Счет90_2 = ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД;
			Счет90_7 = ПланыСчетов.Хозрасчетный.Продажи_РасходыНаПродажуНеЕНВД;
			Счет90_8 = ПланыСчетов.Хозрасчетный.Продажи_УправленческиеРасходыНеЕНВД;
			СчетРасходовнеЕНВД = ПланыСчетов.Хозрасчетный.ПрочиеРасходы;
			СчетРасходовЕНВ = ПланыСчетов.Хозрасчетный.ПрочиеРасходы;
			Счет90_1ЕНВД = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД;
			Счет90_2ЕНВД = ПланыСчетов.Хозрасчетный.СебестоимостьПродажЕНВД;
			Счет90_7ЕНВД = ПланыСчетов.Хозрасчетный.Продажи_РасходыНаПродажуЕНВД;
			Счет90_8ЕНВД = ПланыСчетов.Хозрасчетный.Продажи_УправленческиеРасходыЕНВД;
			Счет99 = ПланыСчетов.Хозрасчетный.ПрибылиИУбыткиНеЕНВД;
			Счет99ЕНВД = ПланыСчетов.Хозрасчетный.ПрибылиИУбыткиЕНВД;
		
			СтруктураПараметров.Вставить("ПрименяетсяЕНВД", ЭтоЕНВД);
			СтруктураПараметров.Вставить("ПоддержкаПБУ18", ПоддержкаПБУ18);
			СтруктураПараметров.Вставить("ПрименяетсяУСН", ПрименяетсяУСН);
			СтруктураПараметров.Вставить("Счет90_1",       Счет90_1);
			СтруктураПараметров.Вставить("Счет90_2",       Счет90_2);
			СтруктураПараметров.Вставить("Счет90_7",       Счет90_7);
			СтруктураПараметров.Вставить("Счет90_8",       Счет90_8);
			СтруктураПараметров.Вставить("СчетРасходовнеЕНВД", СчетРасходовнеЕНВД);
			СтруктураПараметров.Вставить("Счет90_1ЕНВД",   Счет90_1ЕНВД);
			СтруктураПараметров.Вставить("Счет90_2ЕНВД",   Счет90_2ЕНВД);
			СтруктураПараметров.Вставить("Счет90_7ЕНВД",   Счет90_7ЕНВД);
			СтруктураПараметров.Вставить("Счет90_8ЕНВД",   Счет90_8ЕНВД);
			СтруктураПараметров.Вставить("Счет99",         Счет99);
			СтруктураПараметров.Вставить("Счет99ЕНВД",     Счет99ЕНВД);
		
		
		НеЕНВД = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ПредпринимательскаяДеятельностьНеОблагаемаяЕНВД;
		ЕНВД   = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ПредпринимательскаяДеятельностьОблагаемаяЕНВД;
		Распределяются = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ВидДеятельностиОпределяетсяПоДоходам;
		
		Массив9091БУ = Новый Массив;
		Массив9091БУ.Добавить(ПланыСчетов.Хозрасчетный.СебестоимостьПродаж);
		Массив9091БУ.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасходы);
		
		МассивЗапасовБУ = Новый Массив;
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ОСвОрганизации);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.НематериальныеАктивы);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОсновныхСредств);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ОборудованиеКУстановке);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.Материалы);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.Полуфабрикаты);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыНаСкладах);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговле);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ТараПодТоваромИПорожняя);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ПокупныеИзделия);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные);
        МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная);
        МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.РасходыБудущихПериодов);
		МассивЗапасовБУ.Добавить(ПланыСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников);
		
		МассивЗапасов2БУ = Новый Массив;
		МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.ОборудованиеКУстановке);
		МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы);
		МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.Материалы);
		МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.Полуфабрикаты);
		МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыНаСкладах);
		МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговле);
		МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.ТараПодТоваромИПорожняя);
		МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.ПокупныеИзделия);
		МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ);
		МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
		МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ);
		МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ);
		МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.ПокупныеТоварыОтгруженные);
        МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.ГотоваяПродукцияОтгруженная);
        МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеТоварыОтгруженные);
		МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
		МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.РасходыБудущихПериодов);
		МассивЗапасов2БУ.Добавить(ПланыСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников);
		
		МассивРасчетовБУ = Новый Массив;
		МассивРасчетовБУ.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
		МассивРасчетовБУ.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);
		МассивРасчетовБУ.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам);
		МассивРасчетовБУ.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам);
		МассивРасчетовБУ.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_);
		МассивРасчетовБУ.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоПрочимОперациям);
		МассивРасчетовБУ.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами);
		МассивРасчетовБУ.Добавить(ПланыСчетов.Хозрасчетный.Касса);
		МассивРасчетовБУ.Добавить(ПланыСчетов.Хозрасчетный.РасчетныеСчета);
		МассивРасчетовБУ.Добавить(ПланыСчетов.Хозрасчетный.ВалютныеСчета);
		
		МассивОСБУ = Новый Массив;
		МассивОСБУ.Добавить(ПланыСчетов.Хозрасчетный.ОсновныеСредства);
		МассивОСБУ.Добавить(ПланыСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ);
		МассивОСБУ.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОсновныхСредств);
		МассивОСБУ.Добавить(ПланыСчетов.Хозрасчетный.НематериальныеАктивы);
		МассивОСБУ.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов);
		МассивОСБУ.Добавить(ПланыСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости);
		
		МассивПрямых = Новый Массив;
		МассивПрямых.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство_);
		МассивПрямых.Добавить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства);
		
		МассивКосвенных = Новый Массив;
		МассивКосвенных.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
		МассивКосвенных.Добавить(ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы);
		МассивКосвенных.Добавить(ПланыСчетов.Хозрасчетный.БракВПроизводстве);
		МассивКосвенных.Добавить(ПланыСчетов.Хозрасчетный.ОбслуживающиеПроизводства);
		
		МассивВсехКосвенных = Новый Массив;
		МассивВсехКосвенных.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
		МассивВсехКосвенных.Добавить(ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы);
		МассивВсехКосвенных.Добавить(ПланыСчетов.Хозрасчетный.БракВПроизводстве);
		МассивВсехКосвенных.Добавить(ПланыСчетов.Хозрасчетный.ОбслуживающиеПроизводства);
		МассивВсехКосвенных.Добавить(ПланыСчетов.Хозрасчетный.РасходыНаПродажу);
		
		МассивВсехЗатрат = Новый Массив;
		МассивВсехЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
		МассивВсехЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства);
		МассивВсехЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
		МассивВсехЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы);
		МассивВсехЗатрат.Добавить(ПланыСчетов.Хозрасчетный.БракВПроизводстве);
		МассивВсехЗатрат.Добавить(ПланыСчетов.Хозрасчетный.ОбслуживающиеПроизводства);
		МассивВсехЗатрат.Добавить(ПланыСчетов.Хозрасчетный.РасходыНаПродажу);
		
		МассивУбытков = Новый Массив;
		МассивУбытков.Добавить(Перечисления.ВидыРБП.УбыткиПрошлыхЛет);
		МассивУбытков.Добавить(Перечисления.ВидыРБП.УбыткиПрошлыхЛетОбслуживающихПроизводствИХозяйств);
		МассивУбытков.Добавить(Перечисления.ВидыРБП.УбыткиОтРеализацииАмортизируемогоИмущества);
		
		ВидыРасходовНеЕНВД = Новый Массив;
        ВидыРасходовНеЕНВД.Добавить(Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ПредпринимательскаяДеятельностьНеОблагаемаяЕНВД);
        ВидыРасходовНеЕНВД.Добавить(Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ВидДеятельностиОпределяетсяПоДоходам);
		
		МассивРБПБУ = Новый Массив;
		МассивРБПБУ.Добавить(ПланыСчетов.Хозрасчетный.РасходыБудущихПериодов);
		МассивРБПБУ.Добавить(ПланыСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников);
		
		ВидыПрочейРеализации = Новый Массив;
		ВидыПрочейРеализации.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСРеализациейОсновныхСредств);
		ВидыПрочейРеализации.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСРеализациейНематериальныхАктивов);
		ВидыПрочейРеализации.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСРеализациейИмущественныхПравКромеПраваТребования);
		ВидыПрочейРеализации.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСРеализациейИмущественныхПравПоОбъектамОбслуживающихПроизводств);
		ВидыПрочейРеализации.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСРеализациейПраваТребованияДоНаступленияСрокаПлатежа);
		ВидыПрочейРеализации.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСРеализациейПраваТребованияПослеНаступленияСрокаПлатежа);
		ВидыПрочейРеализации.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСРеализациейПраваТребованияКакОказанияФинансовыхУслуг);
		ВидыПрочейРеализации.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСРеализациейПрочегоИмущества);
		ВидыПрочейРеализации.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСРеализациейЦенныхБумаг);
		
		ВидыРеализацииТоваров = Новый Массив;
		ВидыРеализацииТоваров.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСРеализациейИмущественныхПравКромеПраваТребования);
		ВидыРеализацииТоваров.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСРеализациейИмущественныхПравПоОбъектамОбслуживающихПроизводств);
		ВидыРеализацииТоваров.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСРеализациейПраваТребованияДоНаступленияСрокаПлатежа);
		ВидыРеализацииТоваров.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСРеализациейПраваТребованияПослеНаступленияСрокаПлатежа);
		ВидыРеализацииТоваров.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСРеализациейПраваТребованияКакОказанияФинансовыхУслуг);
		ВидыРеализацииТоваров.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСРеализациейПрочегоИмущества);
		ВидыРеализацииТоваров.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ДоходыРасходыСвязанныеСРеализациейЦенныхБумаг);
		
		МассивРозницы = Новый Массив;
		МассивРозницы.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговле);
		МассивРозницы.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ);
		МассивРозницы.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
		МассивРозницы.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ);
		МассивРозницы.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ);
		
		НоменклатурныеГруппыЕНВД = ПолучитьСписокНоменклатурныхГруппЕНВД();
		
		ПоказыватьКрасныйПрямоугольник = Ложь;
		
		МакетШапка   = ПолучитьМакет("Шапка");
		ОбластьШапка = МакетШапка.ПолучитьОбласть("ОбластьШапка");
		
		Если НомерТекущейСхемы = 0 Или НомерТекущейСхемы = 20 Тогда
			СформироватьРасчетНалогаНаПрибыль(ДокументРезультатТекущий, НомерТекущейСхемы);
		ИначеЕсли НомерТекущейСхемы = 1 Или НомерТекущейСхемы = 21 Тогда
			СформироватьДоходы(ДокументРезультатТекущий, НомерТекущейСхемы);
		ИначеЕсли НомерТекущейСхемы = 2 Или НомерТекущейСхемы = 22 Тогда
			СформироватьРасходы(ДокументРезультатТекущий, НомерТекущейСхемы);
		ИначеЕсли НомерТекущейСхемы = 3 Или НомерТекущейСхемы = 23 Тогда
			СформироватьРасходыПоТоварам(ДокументРезультатТекущий, НомерТекущейСхемы);
		ИначеЕсли НомерТекущейСхемы = 4 Или НомерТекущейСхемы = 24 Тогда	
			СформироватьРасходыПроизводства(ДокументРезультатТекущий, НомерТекущейСхемы);
		ИначеЕсли НомерТекущейСхемы = 5 Или НомерТекущейСхемы = 25 Тогда
			СформироватьТранспортныеРасходы(ДокументРезультатТекущий, НомерТекущейСхемы);
		ИначеЕсли НомерТекущейСхемы = 6 Или НомерТекущейСхемы = 26 Тогда
			СформироватьКосвенныеРасходы(ДокументРезультатТекущий, НомерТекущейСхемы);
		ИначеЕсли НомерТекущейСхемы = 7 Или НомерТекущейСхемы = 27 Тогда
			СформироватьПрочиеРасходы(ДокументРезультатТекущий, НомерТекущейСхемы);
		ИначеЕсли НомерТекущейСхемы = 8 Или НомерТекущейСхемы = 28 Тогда
			СформироватьРаспределяемыеРасходы(ДокументРезультатТекущий, НомерТекущейСхемы);
		ИначеЕсли НомерТекущейСхемы = 9 Или НомерТекущейСхемы = 29 Тогда
			СформироватьСтоимостьЗапасов(ДокументРезультатТекущий, НомерТекущейСхемы);
		ИначеЕсли НомерТекущейСхемы = 10 Или НомерТекущейСхемы = 30 Тогда
			СформироватьОбычныеРасходы(ДокументРезультатТекущий, НомерТекущейСхемы);
		КонецЕсли;
		
	КонецПроцедуры
	
	// Формирует отчет в режиме "Таблица"
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	Процедура СформироватьОтчетПоДокументам(ДокументРезультат, ТаблицаРасшифровки, ЗаголовокТекущий = "", ПоДокументам, ПоОшибкам, ДоступностьПоДокументам) Экспорт
		
		Если Не ЗначениеЗаполнено(Организация) Тогда
			Возврат;
		КонецЕсли;
		
		КонецПериодаТек  = КонецДня(КонецПериодаТек);
		
		ДокументРезультат.Очистить();
		ДокументРезультат.Показать();
		
		Макет      = ПолучитьМакет("Расшифровка");
		ОбластьЗаголовка     = Макет.ПолучитьОбласть("Заголовок");
		Область1     = Макет.ПолучитьОбласть("Область1");
		Область2     = Макет.ПолучитьОбласть("Область2");
		Область3     = Макет.ПолучитьОбласть("Область3");
		ОбластьПодвал= Макет.ПолучитьОбласть("Подвал");
		
			ИтогБУ =0;
			ИтогНУ =0;
			ИтогПР =0;
			ИтогВР =0;
			ИтогКонтроль =0;
		
		ОбластьЗаголовка.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное + ", " + ПредставлениеПериода(НачалоМесяца(НачалоПериода), КонецМесяца(КонецПериода), "ФП = Истина");
		ОбластьЗаголовка.Параметры.НазваниеОтчета = ЗаголовокТекущий;
		
		ДокументРезультат.Вывести(ОбластьЗаголовка);
		
		Для Каждого Строка Из ТаблицаРасшифровки Цикл	
			
			НеСчет = Ложь;
			НеКорСчет = Ложь;
			
			ВидСуммы    = Строка.ВидСуммы;
			
			Если Лев(Строка.Счет, 3) = "НЕ " Тогда
				НеСчет = Истина;
				Строка.Счет = СтрЗаменить(Строка.Счет, "НЕ ", "");
			КонецЕсли;
			
			Если ТипЗнч(Строка.Счет) = Тип("Массив") Тогда
				Счет =  Строка.Счет
			Иначе
				Если Строка.Счет = "" Тогда
					Счет = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
				ИначеЕсли Не ЗначениеЗаполнено(Строка.Счет) Тогда
					Счет = Неопределено;
				Иначе
					Счет = ПланыСчетов.Хозрасчетный[Строка.Счет]
				КонецЕсли;
				  
			КонецЕсли;
			
			ВидСубконто = ?(Строка.ВидСубконто = "", "", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные[Строка.ВидСубконто]);
			ЗначениеКорСубконто = Строка.ЗначениеКорСубконто;
			РеквизитКорСубконто = Строка.РеквизитКорСубконто;
			
			Если ЗначениеЗаполнено(Строка.РеквизитСубконто) Тогда
				Если Лев(Строка.РеквизитСубконто, 3) = "НЕ " Тогда
					НЕЗначениеСубконто = Истина;
					РеквизитСубконто = СтрЗаменить(Строка.РеквизитСубконто, "НЕ ", "");
				Иначе	
					НЕЗначениеСубконто = Ложь;
					РеквизитСубконто = Строка.РеквизитСубконто;
				КонецЕсли;
			КонецЕсли;		
			Если  Строка.ЗначениеСубконто = "ТранспортныеРасходы" Тогда
				ЗначениеСубконто = Перечисления.ВидыРасходовНУ.ТранспортныеРасходы;
			ИначеЕсли  Строка.ЗначениеСубконто = "РасходыРаспределяются" Тогда
				ЗначениеСубконто = Распределяются;
			ИначеЕсли  Строка.ЗначениеСубконто = "ЕНВД" Тогда
				ЗначениеСубконто = ЕНВД;
			ИначеЕсли  Строка.ЗначениеСубконто = "НЕЕНВД" Тогда
				ЗначениеСубконто = НеЕНВД;
			Иначе
				ЗначениеСубконто = Строка.ЗначениеСубконто;
			КонецЕсли;
			
			
			Знак        = ?(Строка.Знак = "-", -1, 1);
			
			КорСчет = Строка.КорСчет;

			Если Лев(КорСчет, 3) = "НЕ " Тогда
				НеКорСчет = Истина;
				КорСчет = СтрЗаменить(КорСчет, "НЕ ", "");
			КонецЕсли;
				
			Если Не ТипЗнч(КорСчет) = Тип("Массив") Тогда
				КорСчет   = ?(КорСчет = "", "", ПланыСчетов.Хозрасчетный[КорСчет]);
			КонецЕсли;
			
            Если Лев(Строка.Заголовок, 3) = "НЕ " Тогда
				НеКорСчет = Истина;
			КонецЕсли;

			Если ВидСуммы = "СН" Или ВидСуммы = "СальдоНормируемых" Тогда
				
				НачалоПериодаТек = НачалоДня(НачалоПериода);
				ДоступностьПоДокументам = Ложь;
			ИначеЕсли ВидСуммы = "СК" Тогда
				
				НачалоПериодаТек  = НачалоДня(КонецДня(КонецПериода) + 2);
				ДоступностьПоДокументам = Ложь;
				
			Иначе	
				НачалоПериодаТек = НачалоДня(НачалоПериода);
				ДоступностьПоДокументам = Истина;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			
			Запрос.УстановитьПараметр("НачалоПериодаТек",     НачалоПериодаТек);
			Запрос.УстановитьПараметр("КонецПериодаТек",     КонецПериодаТек);
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("СчетХозрасчетный", Счет);
			Запрос.УстановитьПараметр("КорСчетХозрасчетный", КорСчет);
			
			Если ЗначениеЗаполнено(ВидСубконто) Тогда
				Запрос.УстановитьПараметр("ВидСубконто", ВидСубконто);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЗначениеСубконто) Тогда
				Запрос.УстановитьПараметр("ЗначениеСубконто", ЗначениеСубконто);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЗначениеКорСубконто) Тогда
				Запрос.УстановитьПараметр("ЗначениеКорСубконто", ЗначениеКорСубконто);
			КонецЕсли;
			
			Запрос.Текст = 
			
			"ВЫБРАТЬ
			|	ВложенныйЗапрос.Организация КАК Организация,
			|	ВложенныйЗапрос.Счет КАК Счет,
			|	ВложенныйЗапрос.КорСчет КАК КорСчет,
			|	ВложенныйЗапрос.Субконто1 КАК Субконто1,
			|	СУММА(ВложенныйЗапрос.СуммаБУ) КАК СуммаБУ,
			|	СУММА(ВложенныйЗапрос.СуммаНУ) КАК СуммаНУ,
			|	СУММА(ВложенныйЗапрос.СуммаПР) КАК СуммаПР,
			|	СУММА(ВложенныйЗапрос.СуммаВР) КАК СуммаВР
			|ИЗ
			|	(ВЫБРАТЬ
			|		ХозрасчетныйОстатки.Организация КАК Организация,
			|		ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
			|		ХозрасчетныйОстатки.Счет.Код КАК Счет,
			|		""КорСчет"" КАК КорСЧет,
			|		ХозрасчетныйОстатки.СуммаОстаток КАК СуммаБУ,
			|		ХозрасчетныйОстатки.СуммаНУОстаток КАК СуммаНУ,
			|		ХозрасчетныйОстатки.СуммаПРОстаток КАК СуммаПР,
			|		ХозрасчетныйОстатки.СуммаВРОстаток КАК СуммаВР
			|	ИЗ
			|		РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоПериодаТек, Счет В ИЕРАРХИИ (&СчетХозрасчетный), &ВидСубконто, Организация = &Организация) КАК ХозрасчетныйОстатки) КАК ВложенныйЗапрос
			|ГДЕ
			|	((НЕ ВложенныйЗапрос.СуммаБУ = 0)
			|			ИЛИ (НЕ ВложенныйЗапрос.СуммаНУ = 0)
			|			ИЛИ (НЕ ВложенныйЗапрос.СуммаПР = 0)
			|			ИЛИ (НЕ ВложенныйЗапрос.СуммаВР = 0))
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.Организация,
			|	ВложенныйЗапрос.Субконто1,
			|	ВложенныйЗапрос.Счет,
			|	ВложенныйЗапрос.КорСЧет
			|
			|УПОРЯДОЧИТЬ ПО
			|	Счет,
			|	Субконто1,
			|	КорСЧет
			|ИТОГИ
			|	СУММА(СуммаБУ),
			|	СУММА(СуммаНУ),
			|	СУММА(СуммаПР),
			|	СУММА(СуммаВР)
			|ПО
			|	Организация,
			|	Счет,
			|	КорСЧет,
			|	Субконто1";
			
			Если Не ЗначениеЗаполнено(Строка.Счет) Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОстатки.СуммаОстаток", "0");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОстатки.СуммаНУОстаток", "0");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОстатки.СуммаПРОстаток", "0");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОстатки.СуммаВРОстаток", "0");
			КонецЕсли;
			
			Если Не ВидСуммы = "СН" И НЕ ВидСуммы = "СК" Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"&КонецПериодаТек,", "&КонецПериодаТек,Регистратор");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Остатки", "Обороты");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НачалоПериодаТек,", "&НачалоПериодаТек,&КонецПериодаТек,Регистратор,");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, """КорСчет""","ХозрасчетныйОбороты.КорСчет.Код");
				
				Если ЗначениеЗаполнено(КорСчет) Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "Счет В ИЕРАРХИИ (&СчетХозрасчетный), &ВидСубконто, Организация = &Организация", "Счет В ИЕРАРХИИ (&СчетХозрасчетный), &ВидСубконто, Организация = &Организация, КорСчет В ИЕРАРХИИ (&КорСчетХозрасчетный) И Не КорСчет В ИЕРАРХИИ (&СчетХозрасчетный),");
				КонецЕсли;
				
			КонецЕсли;
			
			Если ВидСуммы = "ДО" Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, ".СуммаОстаток", ".СуммаОборотДт");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, ".СуммаНУОстаток", ".СуммаНУОборотДт");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, ".СуммаПРОстаток", ".СуммаПРОборотДт");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, ".СуммаВРОстаток", ".СуммаВРОборотДт");
			КонецЕсли;
			
			Если ВидСуммы = "КО" Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, ".СуммаОстаток", ".СуммаОборотКт");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, ".СуммаНУОстаток", ".СуммаНУОборотКт");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, ".СуммаПРОстаток", ".СуммаПРОборотКт");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, ".СуммаВРОстаток", ".СуммаВРОборотКт");
				
			КонецЕсли;
			
			Если ВидСуммы = "КО-ДО" Или ВидСуммы = "КО-ДО91"  Тогда
				
				Если ВидСуммы = "КО-ДО" Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.СуммаОстаток", "ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт");
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.СуммаНУОстаток", "ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт");
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.СуммаПРОстаток", "ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт");
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.СуммаВРОстаток", "ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт");
				КонецЕсли;
				
				Если ВидСуммы = "КО-ДО91" Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.СуммаОстаток", 
						"ХозрасчетныйОбороты.СуммаОборотКт - 
						|		ВЫБОР 
						|			КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (&МассивНДССРасходов) 
						|				ТОГДА 0 
						|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетНДС) 
						|				ТОГДА ХозрасчетныйОбороты.СуммаОборотДт 
						|			ИНАЧЕ 0 
						|		КОНЕЦ");
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.СуммаНУОстаток", 
						"ХозрасчетныйОбороты.СуммаНУОборотКт - 
						|		ВЫБОР 
						|			КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (&МассивНДССРасходов) 
						|				ТОГДА 0 
						|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетНДС) 
						|				ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт 
						|			ИНАЧЕ 0 
						|		КОНЕЦ");
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.СуммаПРОстаток", 
						"ХозрасчетныйОбороты.СуммаПРОборотКт - 
						|		ВЫБОР 
						|			КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (&МассивНДССРасходов) 
						|				ТОГДА 0 
						|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетНДС) 
						|				ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт 
						|			ИНАЧЕ 0 
						|		КОНЕЦ");
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.СуммаВРОстаток", 
						"ХозрасчетныйОбороты.СуммаВРОборотКт - 
						|		ВЫБОР 
						|			КОГДА ВЫРАЗИТЬ(ХозрасчетныйОбороты.Субконто1 КАК Справочник.ПрочиеДоходыИРасходы).ВидПрочихДоходовИРасходов В (&МассивНДССРасходов) 
						|				ТОГДА 0 
						|			КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетНДС) 
						|				ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт 
						|			ИНАЧЕ 0 
						|		КОНЕЦ");
                        Массив = Новый Массив;
                        Массив.Добавить(ПланыСчетов.Хозрасчетный.НДС);
                        Массив.Добавить(ПланыСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке);
                        Запрос.УстановитьПараметр("СчетНДС", Массив);
                    КонецЕсли;
				
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.Организация,
			|	ВложенныйЗапрос.Субконто1,
			|	ВложенныйЗапрос.Счет,
			|	ВложенныйЗапрос.КорСЧет","СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.Организация,
			|	ВложенныйЗапрос.Субконто1");
            Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПО
			|	Организация,
			|	Счет,
			|	КорСЧет,
			|	Субконто1","ПО
			|	Организация,
			|	Субконто1");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "УПОРЯДОЧИТЬ ПО
			|	Счет,
			|	Субконто1,
			|	КорСЧет","УПОРЯДОЧИТЬ ПО
			|	Субконто1");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВложенныйЗапрос.Счет КАК Счет,","");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВложенныйЗапрос.КорСчет КАК КорСчет,","");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.Счет.Код КАК Счет,","");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.КорСчет.Код КАК КорСЧет,","");
			КонецЕсли;
			
			Если ВидСуммы = "КосвенныеВР" Или ВидСуммы = "Косвенные20" Или ВидСуммы = "-Косвенные20" Или ВидСуммы = "СальдоНормируемых" Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.СуммаОстаток", "0");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.СуммаНУОстаток", "0");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.СуммаПРОстаток", "0");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.СуммаВРОстаток", "0");
				
				Если ВидСуммы = "КосвенныеВР" Тогда
					
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК СуммаВР", "ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт КАК СуммаВР"); 
					
				КонецЕсли;
				
				Если ВидСуммы = "Косвенные20" Тогда
					
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК СуммаНУ", "  - ХозрасчетныйОбороты.СуммаНУОборотКт КАК СуммаНУ"); 
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК СуммаВР", " ХозрасчетныйОбороты.СуммаНУОборотКт + ХозрасчетныйОбороты.СуммаВРОборотКт КАК СуммаВР"); 
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК СуммаПР", " ХозрасчетныйОбороты.СуммаПРОборотКт КАК СуммаПР"); 
					
				КонецЕсли;
				
				
				Если ВидСуммы = "-Косвенные20" Тогда
					                                          
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК СуммаНУ", "ХозрасчетныйОбороты.СуммаНУОборотКт  КАК СуммаНУ"); 
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК СуммаВР", "-ХозрасчетныйОбороты.СуммаНУОборотКт КАК СуммаВР"); 
					
				КонецЕсли;
				
				Если ВидСуммы = "СальдоНормируемых" Тогда
					Запрос.УстановитьПараметр("НачалоПериодаТек",  '20000101');
					Запрос.УстановитьПараметр("КонецПериодаТек",     КонецДня(НачалоДня(НачалоПериодаТек) - 1));
					
					МассивНормируемых = Новый Массив;
					МассивНормируемых.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеЛичноеСтрахование);
					МассивНормируемых.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности);
					МассивНормируемых.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников);
					МассивНормируемых.Добавить(Перечисления.ВидыРасходовНУ.ПредставительскиеРасходы);
					МассивНормируемых.Добавить(Перечисления.ВидыРасходовНУ.РасходыНаВозмещениеЗатратРаботниковПоУплатеПроцентов);
					МассивНормируемых.Добавить(Перечисления.ВидыРасходовНУ.РасходыНаРекламуНормируемые);
					Запрос.УстановитьПараметр("Нормируемые", МассивНормируемых);
					
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК СуммаБУ", " ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаБУ"); 
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК СуммаНУ", " ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт КАК СуммаНУ"); 
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК СуммаВР", " ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт КАК СуммаВР"); 
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "0 КАК СуммаПР", " ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт КАК СуммаПР"); 
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация И Субконто1.ВидРасходовНУ В (&Нормируемые)"); 
					
				КонецЕсли;
				
		
	КонецЕсли;

			Если Строка.Счет = "ПрочиеРасходы" Тогда

                Массив = Новый Массив;
                Массив.Добавить(ПланыСчетов.Хозрасчетный.НДС);
                Массив.Добавить(ПланыСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке);
                Запрос.УстановитьПараметр("СчетНДС", Массив);
				Если ЗначениеЗаполнено(Строка.КорСчет) Тогда
					Если Строка.КорСчет = "НДС" Тогда
						Запрос.Текст = СтрЗаменить(Запрос.Текст, "КорСчет В ИЕРАРХИИ (&КорСчетХозрасчетный)", "КорСчет В ИЕРАРХИИ (&СчетНДС)");
					Иначе
						Запрос.Текст = СтрЗаменить(Запрос.Текст, "КорСчет В ИЕРАРХИИ (&КорСчетХозрасчетный)", "КорСчет В ИЕРАРХИИ (&КорСчетХозрасчетный) И НЕ КорСчет В ИЕРАРХИИ (&СчетНДС)");
					КонецЕсли;
				Иначе
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация, НЕ КорСчет В ИЕРАРХИИ (&СчетНДС)");
				КонецЕсли;
			КонецЕсли;
	
			Если Не ЗначениеЗаполнено(ВидСубконто) Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВидСубконто", "");
			Иначе
				Если ЗначениеЗаполнено(ЗначениеСубконто) Тогда
					Если НеЗначениеСубконто Тогда
						Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация И НЕ Субконто1." + РеквизитСубконто + " = &ЗначениеСубконто");
					Иначе
						Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация И Субконто1." + РеквизитСубконто + " = &ЗначениеСубконто"); 
					КонецЕсли;
					Если  ТипЗнч(ЗначениеСубконто) = Тип("Массив") Тогда
						Запрос.Текст = СтрЗаменить(Запрос.Текст," = &ЗначениеСубконто"," В (&ЗначениеСубконто)");
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЗначениеКорСубконто) Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация И " +?(Найти(Строка.Заголовок, "ДопСубк") >0, "", "Кор") + "Субконто1." + РеквизитКорСубконто + " = &ЗначениеКорСубконто"); 
				Если  ТипЗнч(ЗначениеКорСубконто) = Тип("Массив") Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст," = &ЗначениеКорСубконто"," В (&ЗначениеКорСубконто)");
				КонецЕсли;
				
			КонецЕсли;
			
			Если ПоДокументам И НЕ ВидСуммы = "СН" И НЕ ВидСуммы = "СК" Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВложенныйЗапрос.Организация КАК Организация,", "ВложенныйЗапрос.Организация КАК Организация, ВложенныйЗапрос.Регистратор КАК Регистратор,");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ХозрасчетныйОбороты.Организация КАК Организация,", "ХозрасчетныйОбороты.Организация КАК Организация, ХозрасчетныйОбороты.Регистратор КАК Регистратор,");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВложенныйЗапрос.Организация, ВложенныйЗапрос.Субконто1", "ВложенныйЗапрос.Организация, ВложенныйЗапрос.Субконто1, ВложенныйЗапрос.Регистратор");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "СГРУППИРОВАТЬ ПО","СГРУППИРОВАТЬ ПО ВложенныйЗапрос.Регистратор,");
				Запрос.Текст = Запрос.Текст + ",Регистратор";
			КонецЕсли;
			
			Если НеСчет Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"Счет В ИЕРАРХИИ (&СчетХозрасчетный)","Не Счет В ИЕРАРХИИ (&СчетХозрасчетный)");
			КонецЕсли;
			Если НеКорСчет Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"КорСчет В ИЕРАРХИИ (&КорСчетХозрасчетный)","Не КорСчет В ИЕРАРХИИ (&КорСчетХозрасчетный)");
			КонецЕсли;
			
			// Специфические условия
			Запрос.УстановитьПараметр("ВидыСубконтоНоменлатурныеГруппы", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
            
            МассивНДССРасходов = Новый Массив;
            МассивНДССРасходов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницыПоРасчетамВУЕ);
            МассивНДССРасходов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате);
            МассивНДССРасходов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.РасходыПоПередачеТоваровБезвозмездноИДляСобственныхНужд);
			Запрос.УстановитьПараметр("МассивНДССРасходов", МассивНДССРасходов);
            
			Если  Строка.ЗначениеСубконто = "РасходыРаспределяются" Тогда
				Запрос.УстановитьПараметр("Транспортные", Перечисления.ВидыРасходовНУ.ТранспортныеРасходы);
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация И НЕ Субконто1.ВидРасходовНУ = &Транспортные");
				
				Если  Строка.Знак = "НЕЕНВД" Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, ") КАК ХозрасчетныйОбороты","&ВидыСубконтоНоменлатурныеГруппы) КАК ХозрасчетныйОбороты");
					Запрос.УстановитьПараметр("НоменклатурныеГруппыЕНВД", НоменклатурныеГруппыЕНВД);
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация И НЕ КорСубконто1 В (&НоменклатурныеГруппыЕНВД)");
				КонецЕсли;
				Если  Строка.Знак = "ЕНВД" Тогда
					Запрос.Текст = СтрЗаменить(Запрос.Текст, ") КАК ХозрасчетныйОбороты","&ВидыСубконтоНоменлатурныеГруппы) КАК ХозрасчетныйОбороты");
					Запрос.УстановитьПараметр("НоменклатурныеГруппыЕНВД", НоменклатурныеГруппыЕНВД);
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация И КорСубконто1 В (&НоменклатурныеГруппыЕНВД)");
				КонецЕсли;
				
			КонецЕсли;
			
			Если  Строка.Знак = "ДоходыНЕЕНВД" Тогда
				Запрос.УстановитьПараметр("ДоходыНЕЕНВД", неЕНВД);
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &ДоходыНЕЕНВД");
			КонецЕсли;
			
			
			Если  Строка.ВидСубконто = "СтатьиЗатрат" Или  Строка.ЗначениеСубконто = "ТранспортныеРасходы" Тогда
				Запрос.УстановитьПараметр("НеЕНВДСписок", ВидыРасходовНеЕНВД);
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)");
			КонецЕсли;
			
			Если  Строка.ЗначениеСубконто = ВидыПрочейРеализации Тогда
				Запрос.УстановитьПараметр("НеЕНВД", НеЕНВД);
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НеЕНВД");
			КонецЕсли;
			
			Если  Найти(Строка.Заголовок,"Кор91НЕЕНВД") > 0 Тогда
				Запрос.УстановитьПараметр("НеЕНВДСписок", ВидыРасходовНеЕНВД);
				Запрос.УстановитьПараметр("ВидыПрочейРеализации", ВидыПрочейРеализации);
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация И КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок) И КорСубконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации)");
				
			ИначеЕсли  Найти(Строка.Заголовок,"91НЕЕНВД") > 0 Тогда
				Запрос.УстановитьПараметр("НеЕНВДСписок", ВидыРасходовНеЕНВД);
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)");
			КонецЕсли;
			
			Если  Найти(Строка.Заголовок,"КорНЕЕНВД") > 0 Тогда
				
				Запрос.УстановитьПараметр("НеЕНВДСписок", ВидыРасходовНеЕНВД);
				Запрос.УстановитьПараметр("ВидКорСубконто", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация И КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, ",) КАК ХозрасчетныйОбороты",",&ВидКорСубконто) КАК ХозрасчетныйОбороты"); 
				
			КонецЕсли;
			
			Если  Найти(Строка.Заголовок,"КорЕНВД") > 0 Тогда
				
				Запрос.УстановитьПараметр("НеЕНВДСписок", ВидыРасходовНеЕНВД);
				Запрос.УстановитьПараметр("ВидКорСубконто", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация И НЕ КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, ",) КАК ХозрасчетныйОбороты",",&ВидКорСубконто) КАК ХозрасчетныйОбороты"); 
				
			КонецЕсли;
			
			
			Если  Строка.КорСчет = "НДС" И Строка.Счет <> "ПрочиеРасходы" Тогда
				Запрос.УстановитьПараметр("НалоговНачислено", Перечисления.ВидыПлатежейВГосБюджет.Налог);
				Запрос.УстановитьПараметр("ВидыНалогов", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыПлатежейВГосБюджет);
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация = &Организация И " + ?(Строка.Знак = "-","", "НЕ ") + " КорСубконто1 = &НалоговНачислено");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, ",) КАК ХозрасчетныйОбороты",",&ВидыНалогов) КАК ХозрасчетныйОбороты"); 
			КонецЕсли;
			
			
			Результат = Запрос.Выполнить();
			
			ВыборкаОрганизация = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Организация");
			
			Пока ВыборкаОрганизация.Следующий() Цикл
				
				Контроль = Округлить(ВыборкаОрганизация.СуммаБУ * Знак - ВыборкаОрганизация.СуммаНУ * Знак - ВыборкаОрганизация.СуммаПР * Знак - ВыборкаОрганизация.СуммаВР * Знак);
				Если ПоОШибкам И Контроль = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ИтогБУ = ИтогБУ + ВыборкаОрганизация.СуммаБУ * Знак;
				ИтогНУ = ИтогНУ + ВыборкаОрганизация.СуммаНУ * Знак;
				ИтогПР = ИтогПР + ВыборкаОрганизация.СуммаПР * Знак;
				ИтогВР = ИтогВР + ВыборкаОрганизация.СуммаВР * Знак;
				ИтогКонтроль = ИтогКонтроль + Контроль;
				
				Если Найти(ВидСуммы,"О") > 0 И НЕ Найти(ВидСуммы, "КО-ДО") > 0 Или Найти(ВидСуммы,"Косвенные") > 0  Тогда
					ВыборкаСчет = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Счет");
					Пока ВыборкаСчет.Следующий() Цикл
						
							Контроль = Округлить(ВыборкаСчет.СуммаБУ * Знак - ВыборкаСчет.СуммаНУ * Знак - ВыборкаСчет.СуммаПР * Знак - ВыборкаСчет.СуммаВР * Знак);
							Если ПоОШибкам И Контроль = 0 Тогда
								Продолжить;
							КонецЕсли;
						ВыборкаКорСчет = ВыборкаСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "КорСчет");
						Если ВыборкаКорСчет.Количество() = 0 Тогда
							
							Область1.Параметры.Текст = СоздатьПояснение(Строка,ВыборкаСчет,ВидСуммы,ЗначениеСубконто,РеквизитСубконто,НеЗначениеСубконто);
							Область1.Параметры.СуммаБУ = ВыборкаСчет.СуммаБУ * Знак;
							Область1.Параметры.СуммаНУ = ВыборкаСчет.СуммаНУ * Знак;
							Область1.Параметры.СуммаПР = ВыборкаСчет.СуммаПР * Знак;
							Область1.Параметры.СуммаВР = ВыборкаСчет.СуммаВР * Знак;
							Область1.Параметры.Контроль = Контроль;
							ДокументРезультат.Вывести(Область1);
						КонецЕсли;
						
						Пока ВыборкаКорСчет.Следующий() Цикл
							
							Если ВыборкаКорСчет.СуммаБУ = 0 И ВыборкаКорСчет.СуммаНУ = 0 И ВыборкаКорСчет.СуммаПР = 0 И ВыборкаКорСчет.СуммаВР = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Контроль = Округлить(ВыборкаКорСчет.СуммаБУ * Знак - ВыборкаКорСчет.СуммаНУ * Знак - ВыборкаКорСчет.СуммаПР * Знак - ВыборкаКорСчет.СуммаВР * Знак);
							Если ПоОШибкам И Контроль = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Область1.Параметры.Текст = СоздатьПояснение(Строка,ВыборкаКорСчет,ВидСуммы,ЗначениеСубконто,РеквизитСубконто,НеЗначениеСубконто);
							Область1.Параметры.СуммаБУ = ВыборкаКорСчет.СуммаБУ * Знак;
							Область1.Параметры.СуммаНУ = ВыборкаКорСчет.СуммаНУ * Знак;
							Область1.Параметры.СуммаПР = ВыборкаКорСчет.СуммаПР * Знак;
							Область1.Параметры.СуммаВР = ВыборкаКорСчет.СуммаВР * Знак;
							Область1.Параметры.Контроль = Контроль;
							ДокументРезультат.Вывести(Область1);
							
							Если ЗначениеЗаполнено(ВидСубконто) Тогда
								Выборка = ВыборкаКорСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Субконто1");
								
								Пока Выборка.Следующий() Цикл
									
									Контроль = Округлить(Выборка.СуммаБУ * Знак - Выборка.СуммаНУ * Знак - Выборка.СуммаПР * Знак - Выборка.СуммаВР * Знак);
									Если ПоОШибкам И Контроль = 0 Тогда
										Продолжить;
									КонецЕсли;
									
									Если Выборка.СуммаБУ = 0 И Выборка.СуммаНУ = 0 И Выборка.СуммаПР = 0 И Выборка.СуммаВР = 0 Тогда
										Продолжить;
									КонецЕсли;
									
									Область2.Параметры.Текст = Выборка.Субконто1;
									Область2.Параметры.СуммаБУ = Выборка.СуммаБУ * Знак;
									Область2.Параметры.СуммаНУ = Выборка.СуммаНУ * Знак;
									Область2.Параметры.СуммаПР = Выборка.СуммаПР * Знак;
									Область2.Параметры.СуммаВР = Выборка.СуммаВР * Знак;
									Область2.Параметры.Контроль = Контроль;
									ДокументРезультат.Вывести(Область2);
									
									
									Если ПоДокументам Тогда
										ВыборкаРегистратор = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Регистратор");
										
										Пока ВыборкаРегистратор.Следующий() Цикл
											
											Контроль = Округлить(ВыборкаРегистратор.СуммаБУ * Знак - ВыборкаРегистратор.СуммаНУ * Знак - ВыборкаРегистратор.СуммаПР * Знак - ВыборкаРегистратор.СуммаВР * Знак);
											Если ПоОШибкам И Контроль = 0 Тогда
												Продолжить;
											КонецЕсли;
											
											Если ВыборкаРегистратор.СуммаБУ = 0 И ВыборкаРегистратор.СуммаНУ = 0 И ВыборкаРегистратор.СуммаПР = 0 И ВыборкаРегистратор.СуммаВР = 0 Тогда
												Продолжить;
											КонецЕсли;
											
											Область3.Параметры.Текст = ВыборкаРегистратор.Регистратор;
											Область3.Параметры.СуммаБУ = ВыборкаРегистратор.СуммаБУ * Знак;
											Область3.Параметры.СуммаНУ = ВыборкаРегистратор.СуммаНУ * Знак;
											Область3.Параметры.СуммаПР = ВыборкаРегистратор.СуммаПР * Знак;
											Область3.Параметры.СуммаВР = ВыборкаРегистратор.СуммаВР * Знак;
											Область3.Параметры.Контроль = Контроль;
											Область3.Параметры.РасшифровкаРегистратор = ВыборкаРегистратор.Регистратор;
											ДокументРезультат.Вывести(Область3);
											
											
										КонецЦикла;  // регистратор
										
									КонецЕсли;  // по документам
									
								КонецЦикла;  // субконто1
							Иначе
								
								Если ПоДокументам Тогда
									ВыборкаРегистратор = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Регистратор");
									
									Пока ВыборкаРегистратор.Следующий() Цикл
										
										Если ПоОШибкам И Контроль = 0 Тогда
											Продолжить;
										КонецЕсли;
										
										Если ВыборкаРегистратор.СуммаБУ = 0 И ВыборкаРегистратор.СуммаНУ = 0 И ВыборкаРегистратор.СуммаПР = 0 И ВыборкаРегистратор.СуммаВР = 0 Тогда
											Продолжить;
										КонецЕсли;
										
										Область3.Параметры.Текст = ВыборкаРегистратор.Регистратор;
										Область3.Параметры.СуммаБУ = ВыборкаРегистратор.СуммаБУ * Знак;
										Область3.Параметры.СуммаНУ = ВыборкаРегистратор.СуммаНУ * Знак;
										Область3.Параметры.СуммаПР = ВыборкаРегистратор.СуммаПР * Знак;
										Область3.Параметры.СуммаВР = ВыборкаРегистратор.СуммаВР * Знак;
										Область3.Параметры.РасшифровкаРегистратор = ВыборкаРегистратор.Регистратор;
										Область3.Параметры.Контроль = ВыборкаРегистратор.СуммаБУ * Знак - ВыборкаРегистратор.СуммаНУ * Знак - ВыборкаРегистратор.СуммаПР * Знак - ВыборкаРегистратор.СуммаВР * Знак;
										ДокументРезультат.Вывести(Область3);
										
										
									КонецЦикла;  // регистратор
									
								КонецЕсли;  // по документам
								
							КонецЕсли;   // по субконто1
							
						КонецЦикла;    // КорСчет
						
					КонецЦикла;    // Счет
				ИначеЕсли Найти(ВидСуммы, "КО-ДО") > 0 Тогда
					Выборка = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Субконто1");
					Пока Выборка.Следующий() Цикл
					Если ПоОШибкам И Контроль = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					Если Выборка.СуммаБУ = 0 И Выборка.СуммаНУ = 0 И Выборка.СуммаПР = 0 И Выборка.СуммаВР = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					Область1.Параметры.Текст = Выборка.Субконто1;
					Область1.Параметры.СуммаБУ = Выборка.СуммаБУ * Знак;
					Область1.Параметры.СуммаНУ = Выборка.СуммаНУ * Знак;
					Область1.Параметры.СуммаПР = Выборка.СуммаПР * Знак;
					Область1.Параметры.СуммаВР = Выборка.СуммаВР * Знак;
					Область1.Параметры.Контроль = Выборка.СуммаБУ * Знак - Выборка.СуммаНУ * Знак - Выборка.СуммаПР * Знак - Выборка.СуммаВР * Знак;
					ДокументРезультат.Вывести(Область1);
					
					Если ПоДокументам Тогда
						ВыборкаРегистратор = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Регистратор");
						
						Пока ВыборкаРегистратор.Следующий() Цикл
							
							Контроль = Округлить(ВыборкаРегистратор.СуммаБУ * Знак - ВыборкаРегистратор.СуммаНУ * Знак - ВыборкаРегистратор.СуммаПР * Знак - ВыборкаРегистратор.СуммаВР * Знак);
							
							Если ПоОШибкам И Контроль = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Если ВыборкаРегистратор.СуммаБУ = 0 И ВыборкаРегистратор.СуммаНУ = 0 И ВыборкаРегистратор.СуммаПР = 0 И ВыборкаРегистратор.СуммаВР = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Область3.Параметры.Текст = ВыборкаРегистратор.Регистратор;
							Область3.Параметры.СуммаБУ = ВыборкаРегистратор.СуммаБУ * Знак;
							Область3.Параметры.СуммаНУ = ВыборкаРегистратор.СуммаНУ * Знак;
							Область3.Параметры.СуммаПР = ВыборкаРегистратор.СуммаПР * Знак;
							Область3.Параметры.СуммаВР = ВыборкаРегистратор.СуммаВР * Знак;
							Область3.Параметры.Контроль = Контроль;
							Область3.Параметры.РасшифровкаРегистратор = ВыборкаРегистратор.Регистратор;
							ДокументРезультат.Вывести(Область3);
							
							
						КонецЦикла;  // регистратор
					
					КонецЕсли;  // по документам
					КонецЦикла; // по субконто	
				Иначе
					
					Если ЗначениеЗаполнено(ВидСубконто) Тогда
						ВыборкаСчет = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Счет");
						
						Пока ВыборкаСчет.Следующий() Цикл
							Область1.Параметры.Текст = СоздатьПояснение(Строка,ВыборкаСчет,ВидСуммы,ЗначениеСубконто,РеквизитСубконто,НеЗначениеСубконто);
							Область1.Параметры.СуммаБУ = ВыборкаСчет.СуммаБУ * Знак;
							Область1.Параметры.СуммаНУ = ВыборкаСчет.СуммаНУ * Знак;
							Область1.Параметры.СуммаПР = ВыборкаСчет.СуммаПР * Знак;
							Область1.Параметры.СуммаВР = ВыборкаСчет.СуммаВР * Знак;
							Контроль = ВыборкаСчет.СуммаБУ * Знак - ВыборкаСчет.СуммаНУ * Знак - ВыборкаСчет.СуммаПР * Знак - ВыборкаСчет.СуммаВР * Знак;
							Область1.Параметры.Контроль = Контроль;
							ДокументРезультат.Вывести(Область1);
							
							Выборка = ВыборкаСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Субконто1");
							Пока Выборка.Следующий() Цикл
								
								Контроль = Округлить(Выборка.СуммаБУ * Знак - Выборка.СуммаНУ * Знак - Выборка.СуммаПР * Знак - Выборка.СуммаВР * Знак);
								Если ПоОШибкам И Контроль = 0 Тогда
									Продолжить;
								КонецЕсли;
								
								Если Выборка.СуммаБУ = 0 И Выборка.СуммаНУ = 0 И Выборка.СуммаПР = 0 И Выборка.СуммаВР = 0 Тогда
									Продолжить;
								КонецЕсли;
								
								Область2.Параметры.Текст = Выборка.Субконто1;
								Область2.Параметры.СуммаБУ = Выборка.СуммаБУ * Знак;
								Область2.Параметры.СуммаНУ = Выборка.СуммаНУ * Знак;
								Область2.Параметры.СуммаПР = Выборка.СуммаПР * Знак;
								Область2.Параметры.СуммаВР = Выборка.СуммаВР * Знак;
								Область2.Параметры.Контроль = Контроль;
								ДокументРезультат.Вывести(Область2);
								
								
								Если ПоДокументам И НЕ ВидСуммы = "СН" И НЕ ВидСуммы = "СК" И НЕ ВидСуммы = "СальдоНормируемых" Тогда
									ВыборкаРегистратор = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Регистратор");
									
									Пока ВыборкаРегистратор.Следующий() Цикл
										
										Контроль = Округлить(ВыборкаРегистратор.СуммаБУ * Знак - ВыборкаРегистратор.СуммаНУ * Знак - ВыборкаРегистратор.СуммаПР * Знак - ВыборкаРегистратор.СуммаВР * Знак);
										
										Если ПоОШибкам И Контроль = 0 Тогда
											Продолжить;
										КонецЕсли;
										
										Если ВыборкаРегистратор.СуммаБУ = 0 И ВыборкаРегистратор.СуммаНУ = 0 И ВыборкаРегистратор.СуммаПР = 0 И ВыборкаРегистратор.СуммаВР = 0 Тогда
											Продолжить;
										КонецЕсли;
										
										Область3.Параметры.Текст = ВыборкаРегистратор.Регистратор;
										Область3.Параметры.СуммаБУ = ВыборкаРегистратор.СуммаБУ * Знак;
										Область3.Параметры.СуммаНУ = ВыборкаРегистратор.СуммаНУ * Знак;
										Область3.Параметры.СуммаПР = ВыборкаРегистратор.СуммаПР * Знак;
										Область3.Параметры.СуммаВР = ВыборкаРегистратор.СуммаВР * Знак;
										Область3.Параметры.Контроль = Контроль;
										Область3.Параметры.РасшифровкаРегистратор = ВыборкаРегистратор.Регистратор;
										ДокументРезультат.Вывести(Область3);
										
										
									КонецЦикла;  // регистратор
									
								КонецЕсли;  // по документам
								
							КонецЦикла;  // субконто1
						КонецЦикла;  // счет
					Иначе
						
						
						ВыборкаСчет = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Счет");
						
						Пока ВыборкаСчет.Следующий() Цикл
							
							Если ПоОШибкам И Контроль = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Если ВыборкаСчет.СуммаБУ = 0 И ВыборкаСчет.СуммаНУ = 0 И ВыборкаСчет.СуммаПР = 0 И ВыборкаСчет.СуммаВР = 0 Тогда
								Продолжить;
							КонецЕсли;
							
							Область1.Параметры.Текст = СоздатьПояснение(Строка,ВыборкаСчет,ВидСуммы,ЗначениеСубконто,РеквизитСубконто,НеЗначениеСубконто);
							Область1.Параметры.СуммаБУ = ВыборкаСчет.СуммаБУ * Знак;
							Область1.Параметры.СуммаНУ = ВыборкаСчет.СуммаНУ * Знак;
							Область1.Параметры.СуммаПР = ВыборкаСчет.СуммаПР * Знак;
							Область1.Параметры.СуммаВР = ВыборкаСчет.СуммаВР * Знак;
							Область1.Параметры.Контроль = ВыборкаСчет.СуммаБУ * Знак - ВыборкаСчет.СуммаНУ * Знак - ВыборкаСчет.СуммаПР * Знак - ВыборкаСчет.СуммаВР * Знак;
							ДокументРезультат.Вывести(Область1);
							
							
						КонецЦикла;  // счет для остатков
						
						
					КонецЕсли;   // по субконто1
					
				КонецЕсли;
			КонецЦикла;    // организация
			
			
		КонецЦикла;  // строка таблицы расшифровки
		
		
							ОбластьПодвал.Параметры.СуммаБУ = ИтогБУ;
							ОбластьПодвал.Параметры.СуммаНУ = ИтогНУ;
							ОбластьПодвал.Параметры.СуммаПР = ИтогПР;
							ОбластьПодвал.Параметры.СуммаВР = ИтогВР;
							ОбластьПодвал.Параметры.Контроль = ИтогКонтроль;
							
		ДокументРезультат.Вывести(ОбластьПодвал);
		
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = "Анализ состояния налогового учета - " + ЗаголовокТекущий;
		
	КонецПроцедуры
	
	// Формирует отчет в режиме "Налог"
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	Процедура  СформироватьРасчетНалогаНаПрибыль(ДокументРезультат, НомерТекущейСхемы)
		НазваниеОтчета = "Расчет налога на прибыль";
	   
		Макет      = ПолучитьМакет("РасчетНалогаНаПрибыль");
		ОбластьОтчета     = Макет.ПолучитьОбласть("Область");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоПериодаТек",     НачалоДня(НачалоПериодаТек));
		Запрос.УстановитьПараметр("КонецПериодаТек",     КонецДня(КонецПериодаТек));
		Запрос.УстановитьПараметр("Организация",         СвойстваОрганизации.СписокОП);
		Запрос.УстановитьПараметр("ОрганизацияГоловная",  ?(ВключатьОбособленныеПодразделения,СвойстваОрганизации.ГоловнаяОрганизация,Организация));
		Запрос.УстановитьПараметр("Счет90_1Хозрасчетный", Счет90_1);
		Запрос.УстановитьПараметр("Счет90_3Хозрасчетный", ПланыСчетов.Хозрасчетный.Продажи_НДС);
		Запрос.УстановитьПараметр("Счет90_5Хозрасчетный", ПланыСчетов.Хозрасчетный.Продажи_Акцизы);
		
		МассивРасходовБУ = Новый Массив;
		МассивРасходовБУ.Добавить(Счет90_2);
		МассивРасходовБУ.Добавить(Счет90_7);
		МассивРасходовБУ.Добавить(Счет90_8);
		Запрос.УстановитьПараметр("СчетаРасходовХозрасчетный", МассивРасходовБУ);
		
		Запрос.УстановитьПараметр("Счет91_01Хозрасчетный", ПланыСчетов.Хозрасчетный.ПрочиеДоходы);
		Запрос.УстановитьПараметр("Счет91_02Хозрасчетный", ПланыСчетов.Хозрасчетный.ПрочиеРасходы);
		Запрос.УстановитьПараметр("Счет99неЕНВДХозрасчетный",СтруктураПараметров.Счет99);
		Запрос.УстановитьПараметр("Счет99Хозрасчетный",ПланыСчетов.Хозрасчетный.ПрибылиИУбытки);
		Запрос.УстановитьПараметр("Счет99ЕНВДХозрасчетный",СтруктураПараметров.Счет99ЕНВД);
		Запрос.УстановитьПараметр("Счет99_1Хозрасчетный",Счет99);
		Запрос.УстановитьПараметр("Счет99_2Хозрасчетный",?(ПоддержкаПБУ18,ПланыСчетов.Хозрасчетный.ПрибылиИУбытки_НалогНаПрибыль, ПланыСчетов.Хозрасчетный.ПрибылиИУбыткиНеЕНВД));
		Запрос.УстановитьПараметр("Счет99_23Хозрасчетный",ПланыСчетов.Хозрасчетный.ПостоянноеНалоговоеОбязательство);
		Запрос.УстановитьПараметр("Счет09Хозрасчетный",ПланыСчетов.Хозрасчетный.СальдоПрочихДоходовИРасходов);
		Запрос.УстановитьПараметр("Счет90_09Хозрасчетный", ПланыСчетов.Хозрасчетный.ПрибыльУбытокОтПродаж);
		Запрос.УстановитьПараметр("Счет91_09Хозрасчетный", ПланыСчетов.Хозрасчетный.СальдоПрочихДоходовИРасходов);
		Запрос.УстановитьПараметр("Счет09", ПланыСчетов.Хозрасчетный.ОтложенныеНалоговыеАктивы);
		Запрос.УстановитьПараметр("Счет77", ПланыСчетов.Хозрасчетный.ОтложенныеНалоговыеОбязательства);
		
		
		Запрос.УстановитьПараметр("Счет90Хозрасчетный", ПланыСчетов.Хозрасчетный.Продажи);
		Запрос.УстановитьПараметр("Счет91Хозрасчетный", ПланыСчетов.Хозрасчетный.ПрочиеДоходыИРасходы);
		Запрос.УстановитьПараметр("СчетаУбытковХозрасчетный", ПланыСчетов.Хозрасчетный.РасходыБудущихПериодов);
		Запрос.УстановитьПараметр("ВидыУбытков", МассивУбытков);
		Запрос.УстановитьПараметр("ВидыРБП", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов);
		
		Запрос.УстановитьПараметр("Счет68_02Хозрасчетный", ПланыСчетов.Хозрасчетный.НДС);
		Запрос.УстановитьПараметр("Счет76_ОТХозрасчетный", ПланыСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке);
		
		Запрос.УстановитьПараметр("НеЕНВДСписок",  ВидыРасходовНеЕНВД);
		Запрос.УстановитьПараметр("НеЕНВД",        НеЕНВД);
		Запрос.УстановитьПараметр("ЕНВД",          ЕНВД);
		Запрос.УстановитьПараметр("Распределяются",Распределяются);
		
		Запрос.УстановитьПараметр("ПрочиеДоходыРасходы",ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы);
		Запрос.УстановитьПараметр("ВидАктивовИОбязательств",ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыАктивовИОбязательств);
		НалогНаПрибыль = ?(ПоддержкаПБУ18,ПланыСчетов.Хозрасчетный.РасчетНалогаНаПрибыль,ПланыСчетов.Хозрасчетный.РасчетыСБюджетом);
		Запрос.УстановитьПараметр("НалогНаПрибыль",НалогНаПрибыль);
		Запрос.УстановитьПараметр("СтавкаНалогаНаПрибыль",СтруктураПараметров.СтавкаНалогаНаПрибыль);
		
		Запрос.УстановитьПараметр("НалоговНачислено", Перечисления.ВидыПлатежейВГосБюджет.Налог);
		Запрос.УстановитьПараметр("ВидыНалогов", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыПлатежейВГосБюджет);
        
        МассивНДССРасходов = Новый Массив;
        МассивНДССРасходов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницыПоРасчетамВУЕ);
        МассивНДССРасходов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате);
        МассивНДССРасходов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.РасходыПоПередачеТоваровБезвозмездноИДляСобственныхНужд);
        Запрос.УстановитьПараметр("МассивНДССРасходов", МассивНДССРасходов);
		
		// Доходы
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
        |   ВложенныйЗапрос.Организация КАК Организация,
        |   СУММА(ЕСТЬNULL(ВложенныйЗапрос.ДоходыБУ, 0)) КАК ДоходыБУ,
        |   СУММА(ЕСТЬNULL(ВложенныйЗапрос.ДОходыНУ, 0)) КАК ДОходыНУ,
        |   СУММА(ЕСТЬNULL(ВложенныйЗапрос.ДоходыПР, 0)) КАК ДоходыПР,
        |   СУММА(ЕСТЬNULL(ВложенныйЗапрос.ДоходыВР, 0)) КАК ДоходыВР
        |ИЗ
        |   (ВЫБРАТЬ
        |       ХозрасчетныйОбороты.Организация КАК Организация,
        |       СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК ДоходыБУ,
        |       СУММА(ХозрасчетныйОбороты.СуммаНУОборотКт) КАК ДОходыНУ,
        |       СУММА(ХозрасчетныйОбороты.СуммаПРОборотКт) КАК ДоходыПР,
        |       СУММА(ХозрасчетныйОбороты.СуммаВРОборотКт) КАК ДоходыВР
        |   ИЗ
        |       РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериодаТек, &КонецПериодаТек, , Счет В ИЕРАРХИИ (&Счет90_1Хозрасчетный), , Организация В (&Организация), (НЕ КорСчет В ИЕРАРХИИ (&Счет90Хозрасчетный)), ) КАК ХозрасчетныйОбороты
        |   
        |   СГРУППИРОВАТЬ ПО
        |       ХозрасчетныйОбороты.Организация
        |   
        |   ОБЪЕДИНИТЬ ВСЕ
        |   
        |   ВЫБРАТЬ
        |       ХозрасчетныйОбороты.Организация,
        |       ХозрасчетныйОбороты.СуммаОборотКт,
        |       ХозрасчетныйОбороты.СуммаНУОборотКт,
        |       ХозрасчетныйОбороты.СуммаПРОборотКт,
        |       ХозрасчетныйОбороты.СуммаВРОборотКт
        |   ИЗ
        |       РегистрБухгалтерии.Хозрасчетный.Обороты(
        |               &НачалоПериодаТек,
        |               &КонецПериодаТек,
        |               ,
        |               Счет В ИЕРАРХИИ (&Счет91_01Хозрасчетный),
        |               &ПрочиеДоходыРасходы,
        |               Организация В (&Организация)
        |                   И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок),
        |               (НЕ КорСчет В ИЕРАРХИИ (&Счет91Хозрасчетный)),
        |               ) КАК ХозрасчетныйОбороты
        |   
        |   ОБЪЕДИНИТЬ ВСЕ
        |   
        |   ВЫБРАТЬ
        |       ХозрасчетныйОбороты.Организация,
        |       -ХозрасчетныйОбороты.СуммаОборотДт,
        |       0,
        |       0,
        |       0
        |   ИЗ
        |       РегистрБухгалтерии.Хозрасчетный.Обороты(
        |               &НачалоПериодаТек,
        |               &КонецПериодаТек,
        |               ,
        |               Счет В ИЕРАРХИИ (&Счет90_3Хозрасчетный)
        |                   ИЛИ Счет В ИЕРАРХИИ (&Счет90_5Хозрасчетный),
        |               ,
        |               Организация В (&Организация),
        |               (НЕ КорСчет В ИЕРАРХИИ (&Счет90Хозрасчетный)),
        |               ) КАК ХозрасчетныйОбороты
        |   
        |   ОБЪЕДИНИТЬ ВСЕ
        |   
        |   ВЫБРАТЬ
        |       ХозрасчетныйОбороты.Организация,
        |       -ХозрасчетныйОбороты.СуммаОборотДт,
        |       -ХозрасчетныйОбороты.СуммаНУОборотДт,
        |       -ХозрасчетныйОбороты.СуммаПРОборотДт,
        |       -ХозрасчетныйОбороты.СуммаВРОборотДт
        |   ИЗ
        |       РегистрБухгалтерии.Хозрасчетный.Обороты(
        |               &НачалоПериодаТек,
        |               &КонецПериодаТек,
        |               ,
        |               Счет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
        |               &ПрочиеДоходыРасходы,
        |               Организация В (&Организация)
        |                   И (НЕ Субконто1.ВидПрочихДоходовИРасходов В (&МассивНДССРасходов))
        |                   И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)
        |                   И КорСубконто1 = &НалоговНачислено,
        |               КорСчет В ИЕРАРХИИ (&Счет68_02Хозрасчетный),
        |               &ВидыНалогов) КАК ХозрасчетныйОбороты
        |   
        |   ОБЪЕДИНИТЬ ВСЕ
        |   
        |   ВЫБРАТЬ
        |       ХозрасчетныйОбороты.Организация,
        |       -ХозрасчетныйОбороты.СуммаОборотДт,
        |       -ХозрасчетныйОбороты.СуммаНУОборотДт,
        |       -ХозрасчетныйОбороты.СуммаПРОборотДт,
        |       -ХозрасчетныйОбороты.СуммаВРОборотДт
        |   ИЗ
        |       РегистрБухгалтерии.Хозрасчетный.Обороты(
        |               &НачалоПериодаТек,
        |               &КонецПериодаТек,
        |               ,
        |               Счет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
        |               &ПрочиеДоходыРасходы,
        |               Организация В (&Организация)
        |                   И (НЕ Субконто1.ВидПрочихДоходовИРасходов В (&МассивНДССРасходов))
        |                   И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок),
        |               КорСчет В ИЕРАРХИИ (&Счет76_ОТХозрасчетный),
        |               ) КАК ХозрасчетныйОбороты) КАК ВложенныйЗапрос
        |
        |СГРУППИРОВАТЬ ПО
        |   ВложенныйЗапрос.Организация
        |ИТОГИ ПО
        |   ОБЩИЕ";
		
		Результат = Запрос.Выполнить();
		ВыборкаДоходы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОБЩИЕ");
		ЕстьДоходы = ВыборкаДоходы.Следующий();
		ОбластьОтчета.Параметры.Заполнить(ВыборкаДоходы);
		ОбластьОтчета.Параметры.РасшифровкаДоходы = ПереходКСхеме(?(ВключатьОбособленныеПодразделения, 20,0) + 1);
		
		// Расходы
		 Запрос.МенеджерВременныхТаблиц = НалоговыйУчет.ПолучитьДолиЕНВД(Новый Структура("ДатаНачалаПериода,ДатаКонцаПериода,СписокОрганизаций",НачалоПериодаТек,КонецПериодаТек,СвойстваОрганизации.СписокОП));
         
		Запрос.Текст = 
		
		"ВЫБРАТЬ
        |   ВложенныйЗапрос.Организация КАК Организация,
        |   СУММА(ВложенныйЗапрос.РасходыБУ) КАК РасходыБУ,
        |   СУММА(ВложенныйЗапрос.РасходыНУ) КАК РасходыНУ,
        |   СУММА(ВложенныйЗапрос.РасходыПР) КАК РасходыПР,
        |   СУММА(ВложенныйЗапрос.РасходыВР) КАК РасходыВР
        |ИЗ
        |   (ВЫБРАТЬ
        |       ХозрасчетныйОбороты.Организация КАК Организация,
        |       ХозрасчетныйОбороты.СуммаОборотДт КАК РасходыБУ,
        |       ХозрасчетныйОбороты.СуммаНУОборотДт КАК РасходыНУ,
        |       ХозрасчетныйОбороты.СуммаПРОборотДт КАК РасходыПР,
        |       ХозрасчетныйОбороты.СуммаВРОборотДт КАК РасходыВР
        |   ИЗ
        |       РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериодаТек, &КонецПериодаТек, , Счет В ИЕРАРХИИ (&СчетаРасходовХозрасчетный), , Организация В (&Организация), (НЕ КорСчет В ИЕРАРХИИ (&Счет90Хозрасчетный)), ) КАК ХозрасчетныйОбороты
        |   
        |   ОБЪЕДИНИТЬ ВСЕ
        |   
        |   ВЫБРАТЬ
        |       ХозрасчетныйОбороты.Организация,
        |       ВЫБОР
        |           КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НЕЕНВД
        |               ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
        |           ИНАЧЕ 0
        |       КОНЕЦ + ВЫБОР
        |           КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &Распределяются
        |               ТОГДА ХозрасчетныйОбороты.СуммаОборотДт * (1 - ДолиЕНВД.ДоляЕНВД)
        |           ИНАЧЕ 0
        |       КОНЕЦ,
        |       ВЫБОР
        |           КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НЕЕНВД
        |               ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
        |           ИНАЧЕ 0
        |       КОНЕЦ + ВЫБОР
        |           КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &Распределяются
        |               ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт * (1 - ДолиЕНВД.ДоляЕНВД)
        |           ИНАЧЕ 0
        |       КОНЕЦ,
        |       ВЫБОР
        |           КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НЕЕНВД
        |               ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
        |           ИНАЧЕ 0
        |       КОНЕЦ + ВЫБОР
        |           КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &Распределяются
        |               ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт * (1 - ДолиЕНВД.ДоляЕНВД)
        |           ИНАЧЕ 0
        |       КОНЕЦ,
        |       ВЫБОР
        |           КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НЕЕНВД
        |               ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
        |           ИНАЧЕ 0
        |       КОНЕЦ + ВЫБОР
        |           КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &Распределяются
        |               ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт * (1 - ДолиЕНВД.ДоляЕНВД)
        |           ИНАЧЕ 0
        |       КОНЕЦ
        |   ИЗ
        |       РегистрБухгалтерии.Хозрасчетный.Обороты(
        |               &НачалоПериодаТек,
        |               &КонецПериодаТек,
        |               Месяц,
        |               Счет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
        |               &ПрочиеДоходыРасходы,
        |               Организация В (&Организация)
        |                   И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок),
        |               (НЕ КорСчет В ИЕРАРХИИ (&Счет68_02Хозрасчетный))
        |                   И (НЕ КорСчет В ИЕРАРХИИ (&Счет76_ОТХозрасчетный))
        |                   И (НЕ КорСчет В ИЕРАРХИИ (&Счет90Хозрасчетный)),
        |               ) КАК ХозрасчетныйОбороты
        |           ЛЕВОЕ СОЕДИНЕНИЕ ДолиЕНВД КАК ДолиЕНВД
        |           ПО (МЕСЯЦ(ХозрасчетныйОбороты.Период) = ДолиЕНВД.МесяцЕНВД)
        |   
        |   ОБЪЕДИНИТЬ ВСЕ
        |   
        |   ВЫБРАТЬ
        |       ХозрасчетныйОбороты.Организация,
        |       0,
        |       ХозрасчетныйОбороты.СуммаНУОборотКт,
        |       ХозрасчетныйОбороты.СуммаПРОборотКт,
        |       ХозрасчетныйОбороты.СуммаВРОборотКт
        |   ИЗ
        |       РегистрБухгалтерии.Хозрасчетный.Обороты(
        |               &НачалоПериодаТек,
        |               &КонецПериодаТек,
        |               ,
        |               Счет В ИЕРАРХИИ (&СчетаУбытковХозрасчетный),
        |               &ВидыРБП,
        |               Организация В (&Организация)
        |                   И Субконто1.ВидРБП В (&ВидыУбытков),
        |               КорСчет В ИЕРАРХИИ (&Счет99НЕЕНВДХозрасчетный),
        |               ) КАК ХозрасчетныйОбороты
        |   
        |   ОБЪЕДИНИТЬ ВСЕ
        |   
        |   ВЫБРАТЬ
        |       ХозрасчетныйОбороты.Организация,
        |       ХозрасчетныйОбороты.СуммаОборотДт,
        |       0,
        |       0,
        |       0
        |   ИЗ
        |       РегистрБухгалтерии.Хозрасчетный.Обороты(
        |               &НачалоПериодаТек,
        |               &КонецПериодаТек,
        |               ,
        |               Счет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
        |               &ПрочиеДоходыРасходы,
        |               Организация В (&Организация)
        |                   И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)
        |                   И (НЕ КорСубконто1 = &НалоговНАчислено),
        |               КорСчет В ИЕРАРХИИ (&Счет68_02Хозрасчетный),
        |               &ВидыНалогов) КАК ХозрасчетныйОбороты
        |   
        |   ОБЪЕДИНИТЬ ВСЕ
        |   
        |   ВЫБРАТЬ
        |       ХозрасчетныйОбороты.Организация,
        |       ХозрасчетныйОбороты.СуммаОборотДт,
        |       ХозрасчетныйОбороты.СуммаНУОборотДт,
        |       ХозрасчетныйОбороты.СуммаПРОборотДт,
        |       ХозрасчетныйОбороты.СуммаВРОборотДт
        |   ИЗ
        |       РегистрБухгалтерии.Хозрасчетный.Обороты(
        |               &НачалоПериодаТек,
        |               &КонецПериодаТек,
        |               ,
        |               Счет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
        |               &ПрочиеДоходыРасходы,
        |               Организация В (&Организация)
        |                   И Субконто1.ВидПрочихДоходовИРасходов В (&МассивНДССРасходов)
        |                   И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок),
        |               КорСчет В ИЕРАРХИИ (&Счет68_02Хозрасчетный),
        |               ) КАК ХозрасчетныйОбороты) КАК ВложенныйЗапрос
        |
        |СГРУППИРОВАТЬ ПО
        |   ВложенныйЗапрос.Организация
        |ИТОГИ ПО
        |   ОБЩИЕ";
		Результат = Запрос.Выполнить();
		ВыборкаРасходы = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОБЩИЕ");
		
		ЕстьРасходы = ВыборкаРасходы.Следующий();
		ОбластьОтчета.Параметры.РасходыБУ = ВыборкаРасходы.РасходыБУ;
		ОбластьОтчета.Параметры.РасходыНУ = ВыборкаРасходы.РасходыНУ;
		ОбластьОтчета.Параметры.РасходыПР = ВыборкаРасходы.РасходыПР;
		ОбластьОтчета.Параметры.РасходыВР = ВыборкаРасходы.РасходыВР;
		
		ОбластьОтчета.Параметры.РасшифровкаРасходы = ПереходКСхеме(?(ВключатьОбособленныеПодразделения, 20,0) + 2);
		// Прибыль
		
		ОбластьОтчета.Параметры.БазаБУ = ?(ЕстьДоходы,ВыборкаДоходы.ДоходыБУ,0) - ?(ЕстьРасходы,ВыборкаРасходы.РасходыБУ,0);
		ОбластьОтчета.Параметры.БазаНУ = ?(ЕстьДоходы,ВыборкаДоходы.ДоходыНУ,0) - ?(ЕстьРасходы,ВыборкаРасходы.РасходыНУ,0);
		ОбластьОтчета.Параметры.БазаПР = ?(ЕстьДоходы,ВыборкаДоходы.ДоходыПР,0) - ?(ЕстьРасходы,ВыборкаРасходы.РасходыПР,0);
		ОбластьОтчета.Параметры.БазаВР = ?(ЕстьДоходы,ВыборкаДоходы.ДоходыВР,0) - ?(ЕстьРасходы,ВыборкаРасходы.РасходыВР,0);
		
		СоздатьРамку(ОбластьОтчета.Параметры, "База", ОбластьОтчета, 55, 38, 60, 189, "");
		
		// Налог
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ВложенныйЗапрос2.Организация КАК Организация,
		|	СУММА(ВложенныйЗапрос2.НАЛОГБУ) КАК НАЛОГБУ,
		|	СУММА(-ВложенныйЗапрос2.НАЛОГПР) КАК НАЛОГПР,
		|	СУММА(-ВложенныйЗапрос2.НалогВР) КАК НалогВР,
		|	СУММА(ВложенныйЗапрос2.НалогНУ * &СтавкаНалогаНаПрибыль / 100) КАК НалогНУ,
		|	СУММА(ВложенныйЗапрос2.НАЛОГБУ + ВложенныйЗапрос2.НАЛОГПР + ВложенныйЗапрос2.НалогВР) КАК НалогБУКор
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Организация КАК Организация,
		|		СУММА(ВложенныйЗапрос.НАЛОГБУ) КАК НАЛОГБУ,
		|		СУММА(ВложенныйЗапрос.НАлогПР) КАК НАЛОГПР,
		|		СУММА(ВложенныйЗапрос.НалогВР) КАК НалогВР,
		|		СУММА(ВложенныйЗапрос.НалогНУ) КАК НалогНУ
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация КАК Организация,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&Счет99_23Хозрасчетный))
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК НАЛОГБУ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&Счет99_23Хозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК НАлогПР,
		|			0 КАК НалогВР,
		|			0 КАК НалогНУ
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериодаТек, &КонецПериодаТек, , Счет В ИЕРАРХИИ (&НалогНаПРибыль), , Организация = &ОрганизацияГоловная, КорСчет В ИЕРАРХИИ (&Счет99_2Хозрасчетный), ) КАК ХозрасчетныйОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация,
		|			0,
		|			0,
		|			ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт,
		|			0
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&НалогНаПРибыль),
		|					,
		|					Организация = &ОрганизацияГоловная,
		|					КорСчет В ИЕРАРХИИ (&Счет09)
		|						ИЛИ КорСчет В ИЕРАРХИИ (&Счет77),
		|					&ВидАктивовИОбязательств) КАК ХозрасчетныйОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация,
		|			0,
		|			0,
		|			0,
		|			ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&Счет99НЕЕНВДХозрасчетный),
		|					,
		|					Организация = &ОрганизацияГоловная,
		|					КорСчет В ИЕРАРХИИ (&Счет90_09Хозрасчетный)
		|						ИЛИ КорСчет В ИЕРАРХИИ (&Счет91_09Хозрасчетный)
		|						ИЛИ КорСчет В ИЕРАРХИИ (&СчетаУбытковХозрасчетный),
		|					) КАК ХозрасчетныйОбороты) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Организация) КАК ВложенныйЗапрос2
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос2.Организация";
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			ОбластьОтчета.Параметры.НалогБУ = ?(ПоддержкаПБУ18,Выборка.НалогБУ,ОбластьОтчета.Параметры.БазаБУ*СтруктураПараметров.СтавкаНалогаНаПрибыль/100);
			ОбластьОтчета.Параметры.НалогБУКор = ?(ПоддержкаПБУ18,Выборка.НалогБУКор,ОбластьОтчета.Параметры.БазаБУ*СтруктураПараметров.СтавкаНалогаНаПрибыль/100);
			ОбластьОтчета.Параметры.НалогНУ = Выборка.НалогНУ;
			ОбластьОтчета.Параметры.НалогПР = -Выборка.НалогПР;
			ОбластьОтчета.Параметры.НалогВР = -Выборка.НалогВР;
		КонецЕсли;
		
		ОбластьШапка.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное + ", " + ПредставлениеПериода(НачалоМесяца(НачалоПериодаТек), КонецМесяца(КонецПериодаТек), "ФП = Истина");
		ОбластьШапка.Параметры.НазваниеОтчета = НазваниеОтчета;
		ОбластьОтчета.Параметры.СтавкаНалогаНаПрибыль = Строка(Окр(СтруктураПараметров.СтавкаНалогаНаПрибыль,2)) + "%";  
		
		СоздатьРамку(Выборка, "Налог", ОбластьОтчета, 100, -78, 62, 2, "РасшифровкаНалог", Истина);		
		СоздатьРамку(ВыборкаДоходы, "Доходы", ОбластьОтчета, 11, 38, 60, 189, "РасшифровкаДоходы");		
		СоздатьРамку(ВыборкаРасходы, "Расходы", ОбластьОтчета, 96, 38, 60, 189, "РасшифровкаРасходы");
		
		Если НЕ ПоказыватьКрасныйПрямоугольник Тогда
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки1);
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки2);
		КонецЕсли;
		
		ДокументРезультат.Вывести(ОбластьШапка);
		ДокументРезультат.Вывести(ОбластьОтчета);
		
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = "Анализ состояния налогового учета" + НазваниеОтчета;
		
	КонецПроцедуры
	
	
	// Формирует отчет в режиме "Доходы"
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	Процедура СформироватьДоходы(ДокументРезультат, НомерТекущейСхемы)
		НазваниеОтчета = "Доходы";
		Макет      = ПолучитьМакет("Доходы");
		ОбластьОтчета     = Макет.ПолучитьОбласть("Область");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоПериодаТек",     НачалоДня(НачалоПериодаТек));
		Запрос.УстановитьПараметр("КонецПериодаТек",     КонецДня(КонецПериодаТек));
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Счет90_1Хозрасчетный", Счет90_1);
		Запрос.УстановитьПараметр("Счет90_3Хозрасчетный", ПланыСчетов.Хозрасчетный.Продажи_НДС);
		Запрос.УстановитьПараметр("Счет90_5Хозрасчетный", ПланыСчетов.Хозрасчетный.Продажи_Акцизы);
		Запрос.УстановитьПараметр("Счет90_1Хозрасчетный", ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД);
		Запрос.УстановитьПараметр("Счет91_01Хозрасчетный", ПланыСчетов.Хозрасчетный.ПрочиеДоходы);
		Запрос.УстановитьПараметр("Счет68_02Хозрасчетный", ПланыСчетов.Хозрасчетный.НДС);
		Запрос.УстановитьПараметр("Счет76_ОТХозрасчетный", ПланыСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке);
		
		Запрос.УстановитьПараметр("НалоговНачислено", Перечисления.ВидыПлатежейВГосБюджет.Налог);
		Запрос.УстановитьПараметр("ВидыНалогов", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыПлатежейВГосБюджет);
		
		Запрос.УстановитьПараметр("НеЕНВД", НеЕНВД);
		Запрос.УстановитьПараметр("ЕНВД",   ЕНВД);
		
		Запрос.УстановитьПараметр("ПрочиеДоходыРасходы",ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы);
		Запрос.УстановитьПараметр("Счет91_02Хозрасчетный", ПланыСчетов.Хозрасчетный.ПрочиеРасходы);
        
        МассивНДССРасходов = Новый Массив;
        МассивНДССРасходов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницыПоРасчетамВУЕ);
        МассивНДССРасходов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате);
        МассивНДССРасходов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.РасходыПоПередачеТоваровБезвозмездноИДляСобственныхНужд);
        Запрос.УстановитьПараметр("МассивНДССРасходов", МассивНДССРасходов);
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
        |   ВложенныйЗапрос2.Организация КАК Организация,
        |   СУММА(ВложенныйЗапрос2.Доходы90БУ) КАК Доходы90БУ,
        |   СУММА(ВложенныйЗапрос2.Доходы90НУ) КАК Доходы90НУ,
        |   СУММА(ВложенныйЗапрос2.Доходы90ПР) КАК Доходы90ПР,
        |   СУММА(ВложенныйЗапрос2.Доходы90ВР) КАК Доходы90ВР,
        |   СУММА(ВложенныйЗапрос2.Доходы91УчБУ) КАК Доходы91УчБУ,
        |   СУММА(ВложенныйЗапрос2.Доходы91УчНУ) КАК Доходы91УчНУ,
        |   СУММА(ВложенныйЗапрос2.Доходы91УчПР) КАК Доходы91УчПР,
        |   СУММА(ВложенныйЗапрос2.Доходы91УчВР) КАК Доходы91УчВР,
        |   СУММА(ВложенныйЗапрос2.Доходы91НЕБУ) КАК Доходы91НЕБУ,
        |   СУММА(ВложенныйЗапрос2.Доходы91НЕНУ) КАК Доходы91НЕНУ,
        |   СУММА(ВложенныйЗапрос2.Доходы91НЕПР) КАК Доходы91НЕПР,
        |   СУММА(ВложенныйЗапрос2.Доходы91НЕВР) КАК Доходы91НЕВР,
        |   СУММА(ВложенныйЗапрос2.Доходы91УчБУ + ВложенныйЗапрос2.Доходы91НЕБУ) КАК Доходы91БУ,
        |   СУММА(ВложенныйЗапрос2.Доходы91УчНУ + ВложенныйЗапрос2.Доходы91НЕНУ) КАК Доходы91НУ,
        |   СУММА(ВложенныйЗапрос2.Доходы91УчПР + ВложенныйЗапрос2.Доходы91НЕПР) КАК Доходы91ПР,
        |   СУММА(ВложенныйЗапрос2.Доходы91УчВР + ВложенныйЗапрос2.Доходы91НЕВР) КАК Доходы91ВР,
        |   СУММА(ВложенныйЗапрос2.Доходы90БУ + ВложенныйЗапрос2.Доходы91УчБУ) КАК Доходы9091БУ,
        |   СУММА(ВложенныйЗапрос2.Доходы90НУ + ВложенныйЗапрос2.Доходы91УчНУ) КАК Доходы9091НУ,
        |   СУММА(ВложенныйЗапрос2.Доходы90ПР + ВложенныйЗапрос2.Доходы91УчПР) КАК Доходы9091ПР,
        |   СУММА(ВложенныйЗапрос2.Доходы90ВР + ВложенныйЗапрос2.Доходы91УчВР) КАК Доходы9091ВР,
        |   СУММА(ВложенныйЗапрос2.Доходы90БУ + ВложенныйЗапрос2.Доходы91УчБУ + ВложенныйЗапрос2.Доходы91НЕБУ) КАК ДоходыБУ,
        |   СУММА(ВложенныйЗапрос2.Доходы90НУ + ВложенныйЗапрос2.Доходы91УчНУ + ВложенныйЗапрос2.Доходы91НЕНУ) КАК ДоходыНУ,
        |   СУММА(ВложенныйЗапрос2.Доходы90ПР + ВложенныйЗапрос2.Доходы91УчПР + ВложенныйЗапрос2.Доходы91НЕПР) КАК ДоходыПР,
        |   СУММА(ВложенныйЗапрос2.Доходы90ВР + ВложенныйЗапрос2.Доходы91УчВР + ВложенныйЗапрос2.Доходы91НЕВР) КАК ДоходыВР
        |ИЗ
        |   (ВЫБРАТЬ
        |       ВложенныйЗапрос.Организация КАК Организация,
        |       СУММА(ВложенныйЗапрос.Доходы90БУ) КАК Доходы90БУ,
        |       СУММА(ВложенныйЗапрос.Доходы90НУ) КАК Доходы90НУ,
        |       СУММА(ВложенныйЗапрос.Доходы90ПР) КАК Доходы90ПР,
        |       СУММА(ВложенныйЗапрос.Доходы90ВР) КАК Доходы90ВР,
        |       СУММА(ВложенныйЗапрос.Доходы91УчБУ) КАК Доходы91УчБУ,
        |       СУММА(ВложенныйЗапрос.Доходы91УчНУ) КАК Доходы91УчНУ,
        |       СУММА(ВложенныйЗапрос.Доходы91УчПР) КАК Доходы91УчПР,
        |       СУММА(ВложенныйЗапрос.Доходы91УчВР) КАК Доходы91УчВР,
        |       СУММА(ВложенныйЗапрос.Доходы91НЕБУ) КАК Доходы91НЕБУ,
        |       СУММА(ВложенныйЗапрос.Доходы91НЕНУ) КАК Доходы91НЕНУ,
        |       СУММА(ВложенныйЗапрос.Доходы91НЕПР) КАК Доходы91НЕПР,
        |       СУММА(ВложенныйЗапрос.Доходы91НЕВР) КАК Доходы91НЕВР
        |   ИЗ
        |       (ВЫБРАТЬ
        |           ХозрасчетныйОбороты.Организация КАК Организация,
        |           ХозрасчетныйОбороты.СуммаОборотКт КАК Доходы90БУ,
        |           ХозрасчетныйОбороты.СуммаНУОборотКт КАК Доходы90НУ,
        |           ХозрасчетныйОбороты.СуммаПРОборотКт КАК Доходы90ПР,
        |           ХозрасчетныйОбороты.СуммаВРОборотКт КАК Доходы90ВР,
        |           0 КАК Доходы91УчБУ,
        |           0 КАК Доходы91УчНУ,
        |           0 КАК Доходы91УчПР,
        |           0 КАК Доходы91УчВР,
        |           0 КАК Доходы91НЕБУ,
        |           0 КАК Доходы91НЕНУ,
        |           0 КАК Доходы91НЕПР,
        |           0 КАК Доходы91НЕВР
        |       ИЗ
        |           РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериодаТек, &КонецПериодаТек, , Счет В ИЕРАРХИИ (&Счет90_1Хозрасчетный), , Организация = &Организация, , ) КАК ХозрасчетныйОбороты
        |       
        |       ОБЪЕДИНИТЬ ВСЕ
        |       
        |       ВЫБРАТЬ
        |           ХозрасчетныйОбороты.Организация,
        |           0,
        |           0,
        |           0,
        |           0,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                   ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                   ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                   ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                   ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
        |               ИНАЧЕ 0
        |           КОНЕЦ
        |       ИЗ
        |           РегистрБухгалтерии.Хозрасчетный.Обороты(
        |                   &НачалоПериодаТек,
        |                   &КонецПериодаТек,
        |                   ,
        |                   Счет В ИЕРАРХИИ (&Счет91_01Хозрасчетный),
        |                   &ПрочиеДоходыРасходы,
        |                   Организация = &Организация
        |                       И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД),
        |                   ,
        |                   ) КАК ХозрасчетныйОбороты
        |       
        |       ОБЪЕДИНИТЬ ВСЕ
        |       
        |       ВЫБРАТЬ
        |           ХозрасчетныйОбороты.Организация,
        |           -ХозрасчетныйОбороты.СуммаОборотДт,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0
        |       ИЗ
        |           РегистрБухгалтерии.Хозрасчетный.Обороты(
        |                   &НачалоПериодаТек,
        |                   &КонецПериодаТек,
        |                   ,
        |                   Счет В ИЕРАРХИИ (&Счет90_3Хозрасчетный)
        |                       ИЛИ Счет В ИЕРАРХИИ (&Счет90_5Хозрасчетный),
        |                   ,
        |                   Организация = &Организация,
        |                   ,
        |                   ) КАК ХозрасчетныйОбороты
        |       
        |       ОБЪЕДИНИТЬ ВСЕ
        |       
        |       ВЫБРАТЬ
        |           ХозрасчетныйОбороты.Организация,
        |           0,
        |           0,
        |           0,
        |           0,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                   ТОГДА -ХозрасчетныйОбороты.СуммаОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                   ТОГДА -ХозрасчетныйОбороты.СуммаНУОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                   ТОГДА -ХозрасчетныйОбороты.СуммаПРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                   ТОГДА -ХозрасчетныйОбороты.СуммаВРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                   ТОГДА -ХозрасчетныйОбороты.СуммаОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                   ТОГДА -ХозрасчетныйОбороты.СуммаНУОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                   ТОГДА -ХозрасчетныйОбороты.СуммаПРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                   ТОГДА -ХозрасчетныйОбороты.СуммаВРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ
        |       ИЗ
        |           РегистрБухгалтерии.Хозрасчетный.Обороты(
        |                   &НачалоПериодаТек,
        |                   &КонецПериодаТек,
        |                   ,
        |                   Счет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
        |                   &ПрочиеДоходыРасходы,
        |                   Организация = &Организация
        |                       И (НЕ Субконто1.ВидПрочихДоходовИРасходов В (&МассивНДССРасходов))
        |                       И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
        |                       И КорСубконто1 = &НалоговНачислено,
        |                   КорСчет В ИЕРАРХИИ (&Счет68_02Хозрасчетный),
        |                   &ВидыНалогов) КАК ХозрасчетныйОбороты
        |       
        |       ОБЪЕДИНИТЬ ВСЕ
        |       
        |       ВЫБРАТЬ
        |           ХозрасчетныйОбороты.Организация,
        |           0,
        |           0,
        |           0,
        |           0,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                   ТОГДА -ХозрасчетныйОбороты.СуммаОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                   ТОГДА -ХозрасчетныйОбороты.СуммаНУОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                   ТОГДА -ХозрасчетныйОбороты.СуммаПРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                   ТОГДА -ХозрасчетныйОбороты.СуммаВРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                   ТОГДА -ХозрасчетныйОбороты.СуммаОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                   ТОГДА -ХозрасчетныйОбороты.СуммаНУОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                   ТОГДА -ХозрасчетныйОбороты.СуммаПРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                   ТОГДА -ХозрасчетныйОбороты.СуммаВРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ
        |       ИЗ
        |           РегистрБухгалтерии.Хозрасчетный.Обороты(
        |                   &НачалоПериодаТек,
        |                   &КонецПериодаТек,
        |                   ,
        |                   Счет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
        |                   &ПрочиеДоходыРасходы,
        |                   Организация = &Организация
        |                       И (НЕ Субконто1.ВидПрочихДоходовИРасходов В (&МассивНДССРасходов))
        |                       И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД),
        |                   КорСчет В ИЕРАРХИИ (&Счет76_ОТХозрасчетный),
        |                   ) КАК ХозрасчетныйОбороты) КАК ВложенныйЗапрос
        |   
        |   СГРУППИРОВАТЬ ПО
        |       ВложенныйЗапрос.Организация) КАК ВложенныйЗапрос2
        |
        |СГРУППИРОВАТЬ ПО
        |   ВложенныйЗапрос2.Организация";
		
		Если НомерТекущейСхемы > 20 Тогда
			Запрос.УстановитьПараметр("Организация", СвойстваОрганизации.СписокОП);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		КонецЕсли;
		
		Результат = Запрос.Выполнить();
		
		Если НомерТекущейСхемы > 20 Тогда
			СформироватьТаблицуОрганизаций(ДокументРезультат,Результат.Выгрузить(),"Доходы",1, НазваниеОтчета);
			Возврат;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОбластьОтчета.Параметры.Заполнить(Выборка);    
		СоздатьРамку(Выборка, "Доходы", ОбластьОтчета, 29, 38, 61, 9, "РасшифровкаНалог");	
		СоздатьРамку(Выборка, "Доходы9091", ОбластьОтчета, 13, 38, 60, 76, "Расшифровка9091");	
		СоздатьРамку(Выборка, "Доходы91НЕ", ОбластьОтчета, 52, 38, 60, 76, "Расшифровка91Не");
		СоздатьРамку(Выборка, "Доходы91Уч", ОбластьОтчета, 29, 38, 60, 142, "Расшифровка91Уч");
		СоздатьРамку(Выборка, "Доходы90", ОбластьОтчета, 13, 38, 62, 208, "Расшифровка90");
		СоздатьРамку(Выборка, "Доходы91", ОбластьОтчета, 52, 38, 62, 208, "Расшифровка91");
		
		ОбластьОтчета.Параметры.РасшифровкаНалог = ?(СвойстваОрганизации.ЕстьОП, Неопределено, ПереходКСхеме(0));
		
		Массив = Новый Массив;
		Массив.Добавить(ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД);
		Массив.Добавить(ПланыСчетов.Хозрасчетный.Продажи_НДС);
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО-ДО", Массив, "Выручка", "НоменклатурныеГруппы",,,,,,"Кт 90.01.1 (Продажи)");
		ОбластьОтчета.Параметры.Расшифровка90 = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Выручка по обычным видам деятельности");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО-ДО", Массив, "Выручка", "НоменклатурныеГруппы",,,,,,"Кт 90.01.1 (Продажи)");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ПрочиеДоходы", "ПрочиеДоходы","ПрочиеДоходыИРасходы", "ПринятиеКналоговомуУчету", Истина,"ДоходыНЕЕНВД",,,"Кт 91.01 (Прочие доходы) принятие к НУ установлено");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "","ПрочиеДоходыИРасходы", "ПринятиеКналоговомуУчету", Истина,"-","НДС",,"Дт 91.02 (Прочие расходы) Кт 68.02(76.ОТ)");
		ОбластьОтчета.Параметры.Расшифровка9091 = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Доходы, учитываемые при определении налоговой базы");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО-ДО91", "ПрочиеДоходыИРасходы", "ПрочиеДоходы","ПрочиеДоходыИРасходы", "ПринятиеКналоговомуУчету", Ложь,"ДоходыНЕЕНВД",,,"Кт 91.01 (Прочие доходы) Принятие к НУ не установлено");
		ОбластьОтчета.Параметры.Расшифровка91Не = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Прочие доходы, не относящиеся к обычным видам деятельности, не учитываемые при определении налоговой базы");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО-ДО91", "ПрочиеДоходыИРасходы", "ПрочиеДоходы","ПрочиеДоходыИРасходы", "ПринятиеКналоговомуУчету", Истина,"ДоходыНЕЕНВД",,,"Кт 91.01 (Прочие доходы) Принятие к НУ установлено");
		ОбластьОтчета.Параметры.Расшифровка91Уч = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Прочие доходы, не относящиеся к обычным видам деятельности, учитываемые при определении налоговой базы");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО-ДО91", "ПрочиеДоходыИРасходы", "ПрочиеДоходы","ПрочиеДоходыИРасходы",,,"ДоходыНЕЕНВД",,,"Дт 91.01 (Прочие доходы)");
		ОбластьОтчета.Параметры.Расшифровка91 = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Прочие доходы, не относящиеся к обычным видам деятельности");
		
		Если НЕ ПоказыватьКрасныйПрямоугольник Тогда
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки1);
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки2);
		КонецЕсли;
		                                                                                                          
		
		ОбластьШапка.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное + ", " + ПредставлениеПериода(НачалоМесяца(НачалоПериодаТек), КонецМесяца(КонецПериодаТек), "ФП = Истина");
		ОбластьШапка.Параметры.НазваниеОтчета = НазваниеОтчета;
		ДокументРезультат.Вывести(ОбластьШапка);
		ДокументРезультат.Вывести(ОбластьОтчета);
		ДокументРезультат.ТекущаяОбласть = ОбластьШапка.Области.ОбластьШапка;
		
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = "Анализ состояния налогового учета - " + НазваниеОтчета;
	КонецПроцедуры
	
	// Формирует отчет в режиме "Расходы"
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	Процедура СформироватьРасходы(ДокументРезультат, НомерТекущейСхемы)
		
	    НазваниеОтчета = "Расходы";
		Макет      = ПолучитьМакет("Расходы" + ?(ЭтоЕНВД, "ЕНВД", ""));
		ОбластьОтчета     = Макет.ПолучитьОбласть("Область");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоПериодаТек",     НачалоДня(НачалоПериодаТек));
		Запрос.УстановитьПараметр("КонецПериодаТек",     КонецДня(КонецПериодаТек));
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Запрос.УстановитьПараметр("СчетаПрямыхРасходовХозрасчетный", Счет90_2);
		
		МассивРасходовБУ = Новый Массив;
		МассивРасходовБУ.Добавить(Счет90_7);
		МассивРасходовБУ.Добавить(Счет90_8);
		Запрос.УстановитьПараметр("СчетаКосвенныхРасходовХозрасчетный", МассивРасходовБУ);
		Запрос.УстановитьПараметр("СчетаПрямыхЗатратХозрасчетный", МассивПрямых);
		
		Запрос.УстановитьПараметр("Счет91_02Хозрасчетный", ПланыСчетов.Хозрасчетный.ПрочиеРасходы);
		Запрос.УстановитьПараметр("Счет91_02Хозрасчетный", ПланыСчетов.Хозрасчетный.ПрочиеРасходы);
		Запрос.УстановитьПараметр("ВидСубконто", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
		Запрос.УстановитьПараметр("ВидСубконтоСтатьиЗатрат", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
		Запрос.УстановитьПараметр("ПрочиеДоходыРасходы",ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы);
		
		Запрос.УстановитьПараметр("Счет91_09Хозрасчетный", ПланыСчетов.Хозрасчетный.СальдоПрочихДоходовИРасходов);
		Запрос.УстановитьПараметр("Счет99неЕНВДХозрасчетный",СтруктураПараметров.Счет99);
		Запрос.УстановитьПараметр("Счет91_02Хозрасчетный", ПланыСчетов.Хозрасчетный.ПрочиеРасходы);
		Запрос.УстановитьПараметр("Счет99ЕНВДХозрасчетный",СтруктураПараметров.Счет99ЕНВД);
		Запрос.УстановитьПараметр("Счет68_02Хозрасчетный", ПланыСчетов.Хозрасчетный.НДС);
		Запрос.УстановитьПараметр("Счет76_ОТХозрасчетный", ПланыСчетов.Хозрасчетный.НДСНачисленныйПоОтгрузке);
		
		Запрос.УстановитьПараметр("СчетаМПЗХозрасчетный", МассивЗапасов2БУ);
		Запрос.УстановитьПараметр("СчетаМПЗВесьХозрасчетный", МассивЗапасовБУ);
		Запрос.УстановитьПараметр("СчетаУбытковХозрасчетный", ПланыСчетов.Хозрасчетный.РасходыБудущихПериодов);
		Запрос.УстановитьПараметр("ВидыУбытков", МассивУбытков);
		Запрос.УстановитьПараметр("ВидыРБП", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыБудущихПериодов);
		
		Запрос.УстановитьПараметр("НеЕНВДСписок", ВидыРасходовНеЕНВД);
		Запрос.УстановитьПараметр("НеЕНВД",   НеЕНВД);
		Запрос.УстановитьПараметр("ЕНВД",   ЕНВД);
		Запрос.УстановитьПараметр("Распределяются",   Распределяются);
		
		Запрос.МенеджерВременныхТаблиц = НалоговыйУчет.ПолучитьДолиЕНВД(Новый Структура("ДатаНачалаПериода,ДатаКонцаПериода,СписокОрганизаций",НачалоПериодаТек,КонецПериодаТек,СвойстваОрганизации.СписокОП));
		
		Запрос.УстановитьПараметр("ТранспортныеРасходы",   Перечисления.ВидыРасходовНУ.ТранспортныеРасходы);
		Запрос.УстановитьПараметр("НеУчитываемыеРасходы", Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения);
		
		Запрос.УстановитьПараметр("НалоговНачислено", Перечисления.ВидыПлатежейВГосБюджет.Налог);
		Запрос.УстановитьПараметр("ВидыНалогов", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыПлатежейВГосБюджет);
		
		Запрос.УстановитьПараметр("ВидыПрочейРеализации", ВидыПрочейРеализации);
		Запрос.УстановитьПараметр("ВидыРеализацииТоваров", ВидыРеализацииТоваров);
        
        МассивНДССРасходов = Новый Массив;
        МассивНДССРасходов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницыПоРасчетамВУЕ);
        МассивНДССРасходов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате);
        МассивНДССРасходов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.РасходыПоПередачеТоваровБезвозмездноИДляСобственныхНужд);
        Запрос.УстановитьПараметр("МассивНДССРасходов", МассивНДССРасходов);
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
        |   ВложенныйЗапрос2.Организация КАК Организация,
        |   СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыУчБУ) КАК ПрямыеРасходыТоварыУчБУ,
        |   СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыУчНУ) КАК ПрямыеРасходыТоварыУчНУ,
        |   СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыУчПР) КАК ПрямыеРасходыТоварыУчПР,
        |   СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыУчВР) КАК ПрямыеРасходыТоварыУчВР,
        |   СУММА(ВложенныйЗапрос2.ПрямыеРасходыУслугиБУ) КАК ПрямыеРасходыУслугиБУ,
        |   СУММА(ВложенныйЗапрос2.ПрямыеРасходыУслугиНУ) КАК ПрямыеРасходыУслугиНУ,
        |   СУММА(ВложенныйЗапрос2.ПрямыеРасходыУслугиПР) КАК ПрямыеРасходыУслугиПР,
        |   СУММА(ВложенныйЗапрос2.ПрямыеРасходыУслугиВР) КАК ПрямыеРасходыУслугиВР,
        |   СУММА(ВложенныйЗапрос2.ПрочиеРасходыУчБУ) КАК ПрочиеРасходыУчБУ,
        |   СУММА(ВложенныйЗапрос2.ПрочиеРасходыУчНУ) КАК ПрочиеРасходыУчНУ,
        |   СУММА(ВложенныйЗапрос2.ПрочиеРасходыУчПР) КАК ПрочиеРасходыУчПР,
        |   СУММА(ВложенныйЗапрос2.ПрочиеРасходыУчВР) КАК ПрочиеРасходыУчВР,
        |   СУММА(ВложенныйЗапрос2.ТранспортныеРасходыБУ) КАК ТранспортныеРасходыБУ,
        |   СУММА(ВложенныйЗапрос2.ТранспортныеРасходыНУ) КАК ТранспортныеРасходыНУ,
        |   СУММА(ВложенныйЗапрос2.ТранспортныеРасходыПР) КАК ТранспортныеРасходыПР,
        |   СУММА(ВложенныйЗапрос2.ТранспортныеРасходыВР) КАК ТранспортныеРасходыВР,
        |   СУММА(ВложенныйЗапрос2.КосвенныеРасходыНЕБУ) КАК КосвенныеРасходыНЕБУ,
        |   СУММА(ВложенныйЗапрос2.КосвенныеРасходыНеНУ) КАК КосвенныеРасходыНеНУ,
        |   СУММА(ВложенныйЗапрос2.КосвенныеРасходыНеПР) КАК КосвенныеРасходыНеПР,
        |   СУММА(ВложенныйЗапрос2.КосвенныеРасходыНеВР) КАК КосвенныеРасходыНеВР,
        |   СУММА(ВложенныйЗапрос2.КосвенныеРасходыУчБУ) КАК КосвенныеРасходыУчБУ,
        |   СУММА(ВложенныйЗапрос2.КосвенныеРасходыУчНУ) КАК КосвенныеРасходыУчНУ,
        |   СУММА(ВложенныйЗапрос2.КосвенныеРасходыУчПР) КАК КосвенныеРасходыУчПР,
        |   СУММА(ВложенныйЗапрос2.КосвенныеРасходыУчВР) КАК КосвенныеРасходыУчВР,
        |   СУММА(ВложенныйЗапрос2.ПрочиеРасходыНеБУ) КАК ПрочиеРасходыНеБУ,
        |   СУММА(ВложенныйЗапрос2.ПрочиеРасходыНеНУ) КАК ПрочиеРасходыНеНУ,
        |   СУММА(ВложенныйЗапрос2.ПрочиеРасходыНеПР) КАК ПрочиеРасходыНеПР,
        |   СУММА(ВложенныйЗапрос2.ПрочиеРасходыНеВР) КАК ПрочиеРасходыНеВР,
        |   СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыНеБУ) КАК ПрямыеРасходыТоварыНеБУ,
        |   СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыНеНУ) КАК ПрямыеРасходыТоварыНеНУ,
        |   СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыНеПР) КАК ПрямыеРасходыТоварыНеПР,
        |   СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыНеВр) КАК ПрямыеРасходыТоварыНеВр,
        |   СУММА(ВложенныйЗапрос2.КосвенныеРасходыРаспрБУ) КАК КосвенныеРасходыРаспрБУ,
        |   СУММА(ВложенныйЗапрос2.КосвенныеРасходыРаспрНУ) КАК КосвенныеРасходыРаспрНУ,
        |   СУММА(ВложенныйЗапрос2.КосвенныеРасходыРаспрПР) КАК КосвенныеРасходыРаспрПР,
        |   СУММА(ВложенныйЗапрос2.КосвенныеРасходыРаспрВР) КАК КосвенныеРасходыРаспрВР,
        |   СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыУчБУ + ВложенныйЗапрос2.ПрямыеРасходыУслугиБУ + ВложенныйЗапрос2.ПрочиеРасходыУчБУ + ВложенныйЗапрос2.ТранспортныеРасходыБУ + ВложенныйЗапрос2.КосвенныеРасходыНЕБУ + ВложенныйЗапрос2.КосвенныеРасходыУчБУ + ВложенныйЗапрос2.ПрочиеРасходыНеБУ + ВложенныйЗапрос2.ПрямыеРасходыТоварыНеБУ + ВложенныйЗапрос2.КосвенныеРасходыРаспрБУ) КАК РасходыБУ,
        |   СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыУчНУ + ВложенныйЗапрос2.ПрямыеРасходыУслугиНУ + ВложенныйЗапрос2.ПрочиеРасходыУчНУ + ВложенныйЗапрос2.ТранспортныеРасходыНУ + ВложенныйЗапрос2.КосвенныеРасходыНеНУ + ВложенныйЗапрос2.КосвенныеРасходыУчНУ + ВложенныйЗапрос2.ПрочиеРасходыНеНУ + ВложенныйЗапрос2.ПрямыеРасходыТоварыНеНУ + ВложенныйЗапрос2.КосвенныеРасходыРаспрНУ) КАК РасходыНУ,
        |   СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыУчПР + ВложенныйЗапрос2.ПрямыеРасходыУслугиПР + ВложенныйЗапрос2.ПрочиеРасходыУчПР + ВложенныйЗапрос2.ТранспортныеРасходыПР + ВложенныйЗапрос2.КосвенныеРасходыНеПР + ВложенныйЗапрос2.КосвенныеРасходыУчПР + ВложенныйЗапрос2.ПрочиеРасходыНеПР + ВложенныйЗапрос2.ПрямыеРасходыТоварыНеПР + ВложенныйЗапрос2.КосвенныеРасходыРаспрПР) КАК РасходыПР,
        |   СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыУчВР + ВложенныйЗапрос2.ПрямыеРасходыУслугиВР + ВложенныйЗапрос2.ПрочиеРасходыУчВР + ВложенныйЗапрос2.ТранспортныеРасходыВР + ВложенныйЗапрос2.КосвенныеРасходыНеВР + ВложенныйЗапрос2.КосвенныеРасходыУчВР + ВложенныйЗапрос2.ПрочиеРасходыНеВР + ВложенныйЗапрос2.ПрямыеРасходыТоварыНеВр + ВложенныйЗапрос2.КосвенныеРасходыРаспрВР) КАК РасходыВР
        |ИЗ
        |   (ВЫБРАТЬ
        |       ВложенныйЗапрос.Организация КАК Организация,
        |       СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыУчБУ) КАК ПрямыеРасходыТоварыУчБУ,
        |       СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыУчНУ) КАК ПрямыеРасходыТоварыУчНУ,
        |       СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыУчПР) КАК ПрямыеРасходыТоварыУчПР,
        |       СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыУчВР) КАК ПрямыеРасходыТоварыУчВР,
        |       СУММА(ВложенныйЗапрос.ПрямыеРасходыУслугиБУ) КАК ПрямыеРасходыУслугиБУ,
        |       СУММА(ВложенныйЗапрос.ПрямыеРасходыУслугиНУ) КАК ПрямыеРасходыУслугиНУ,
        |       СУММА(ВложенныйЗапрос.ПрямыеРасходыУслугиПР) КАК ПрямыеРасходыУслугиПР,
        |       СУММА(ВложенныйЗапрос.ПрямыеРасходыУслугиВР) КАК ПрямыеРасходыУслугиВР,
        |       СУММА(ВложенныйЗапрос.ПрочиеРасходыУчБУ) КАК ПрочиеРасходыУчБУ,
        |       СУММА(ВложенныйЗапрос.ПрочиеРасходыУчНУ) КАК ПрочиеРасходыУчНУ,
        |       СУММА(ВложенныйЗапрос.ПрочиеРасходыУчПР) КАК ПрочиеРасходыУчПР,
        |       СУММА(ВложенныйЗапрос.ПрочиеРасходыУчВР) КАК ПрочиеРасходыУчВР,
        |       СУММА(ВложенныйЗапрос.ТранспортныеРасходыБУ) КАК ТранспортныеРасходыБУ,
        |       СУММА(ВложенныйЗапрос.ТранспортныеРасходыНУ) КАК ТранспортныеРасходыНУ,
        |       СУММА(ВложенныйЗапрос.ТранспортныеРасходыПР) КАК ТранспортныеРасходыПР,
        |       СУММА(ВложенныйЗапрос.ТранспортныеРасходыВР) КАК ТранспортныеРасходыВР,
        |       СУММА(ВложенныйЗапрос.КосвенныеРасходыНЕБУ) КАК КосвенныеРасходыНЕБУ,
        |       СУММА(ВложенныйЗапрос.КосвенныеРасходыНеНУ) КАК КосвенныеРасходыНеНУ,
        |       СУММА(ВложенныйЗапрос.КосвенныеРасходыНеПР) КАК КосвенныеРасходыНеПР,
        |       СУММА(ВложенныйЗапрос.КосвенныеРасходыНеВР) КАК КосвенныеРасходыНеВР,
        |       СУММА(ВложенныйЗапрос.КосвенныеРасходыУчБУ) КАК КосвенныеРасходыУчБУ,
        |       СУММА(ВложенныйЗапрос.КосвенныеРасходыУчНУ) КАК КосвенныеРасходыУчНУ,
        |       СУММА(ВложенныйЗапрос.КосвенныеРасходыУчПР) КАК КосвенныеРасходыУчПР,
        |       СУММА(ВложенныйЗапрос.КосвенныеРасходыУчВР) КАК КосвенныеРасходыУчВР,
        |       СУММА(ВложенныйЗапрос.ПрочиеРасходыНеБУ) КАК ПрочиеРасходыНеБУ,
        |       СУММА(ВложенныйЗапрос.ПрочиеРасходыНеНУ) КАК ПрочиеРасходыНеНУ,
        |       СУММА(ВложенныйЗапрос.ПрочиеРасходыНеПР) КАК ПрочиеРасходыНеПР,
        |       СУММА(ВложенныйЗапрос.ПрочиеРасходыНеВР) КАК ПрочиеРасходыНеВР,
        |       СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыНеБУ) КАК ПрямыеРасходыТоварыНеБУ,
        |       СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыНеНУ) КАК ПрямыеРасходыТоварыНеНУ,
        |       СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыНеПР) КАК ПрямыеРасходыТоварыНеПР,
        |       СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыНеВр) КАК ПрямыеРасходыТоварыНеВр,
        |       СУММА(ВложенныйЗапрос.КосвенныеРасходыРаспрБУ) КАК КосвенныеРасходыРаспрБУ,
        |       СУММА(ВложенныйЗапрос.КосвенныеРасходыРаспрНУ) КАК КосвенныеРасходыРаспрНУ,
        |       СУММА(ВложенныйЗапрос.КосвенныеРасходыРаспрПР) КАК КосвенныеРасходыРаспрПР,
        |       СУММА(ВложенныйЗапрос.КосвенныеРасходыРаспрВР) КАК КосвенныеРасходыРаспрВР
        |   ИЗ
        |       (ВЫБРАТЬ
        |           ХозрасчетныйОбороты.Организация КАК Организация,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхЗатратХозрасчетный))
        |                   ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ КАК ПрямыеРасходыТоварыУчБУ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхЗатратХозрасчетный))
        |                   ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ КАК ПрямыеРасходыТоварыУчНУ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхЗатратХозрасчетный))
        |                   ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ КАК ПрямыеРасходыТоварыУчПР,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхЗатратХозрасчетный))
        |                   ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ КАК ПрямыеРасходыТоварыУчВР,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхЗатратХозрасчетный)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ КАК ПрямыеРасходыУслугиБУ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхЗатратХозрасчетный)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ КАК ПрямыеРасходыУслугиНУ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхЗатратХозрасчетный)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ КАК ПрямыеРасходыУслугиПР,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхЗатратХозрасчетный)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ КАК ПрямыеРасходыУслугиВР,
        |           0 КАК ПрочиеРасходыУчБУ,
        |           0 КАК ПрочиеРасходыУчНУ,
        |           0 КАК ПрочиеРасходыУчПР,
        |           0 КАК ПрочиеРасходыУчВР,
        |           0 КАК ТранспортныеРасходыБУ,
        |           0 КАК ТранспортныеРасходыНУ,
        |           0 КАК ТранспортныеРасходыПР,
        |           0 КАК ТранспортныеРасходыВР,
        |           0 КАК КосвенныеРасходыНЕБУ,
        |           0 КАК КосвенныеРасходыНеНУ,
        |           0 КАК КосвенныеРасходыНеПР,
        |           0 КАК КосвенныеРасходыНеВР,
        |           0 КАК КосвенныеРасходыУчБУ,
        |           0 КАК КосвенныеРасходыУчНУ,
        |           0 КАК КосвенныеРасходыУчПР,
        |           0 КАК КосвенныеРасходыУчВР,
        |           0 КАК ПрочиеРасходыНеБУ,
        |           0 КАК ПрочиеРасходыНеНУ,
        |           0 КАК ПрочиеРасходыНеПР,
        |           0 КАК ПрочиеРасходыНеВР,
        |           0 КАК ПрямыеРасходыТоварыНеБУ,
        |           0 КАК ПрямыеРасходыТоварыНеНУ,
        |           0 КАК ПрямыеРасходыТоварыНеПР,
        |           0 КАК ПрямыеРасходыТоварыНеВр,
        |           0 КАК КосвенныеРасходыРаспрБУ,
        |           0 КАК КосвенныеРасходыРаспрНУ,
        |           0 КАК КосвенныеРасходыРаспрПР,
        |           0 КАК КосвенныеРасходыРаспрВР
        |       ИЗ
        |           РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериодаТек, &КонецПериодаТек, , Счет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный), , Организация = &Организация, , ) КАК ХозрасчетныйОбороты
        |       
        |       ОБЪЕДИНИТЬ ВСЕ
        |       
        |       ВЫБРАТЬ
        |           ХозрасчетныйОбороты.Организация,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                       И ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыРеализацииТоваров)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                       И ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыРеализацииТоваров)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                       И ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыРеализацииТоваров)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                       И ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыРеализацииТоваров)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           0,
        |           0,
        |           0,
        |           0,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                       И (НЕ ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыРеализацииТоваров))
        |                   ТОГДА ВЫБОР
        |                           КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НЕЕНВД
        |                               ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
        |                           ИНАЧЕ 0
        |                       КОНЕЦ + ВЫБОР
        |                           КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &Распределяются
        |                               ТОГДА ХозрасчетныйОбороты.СуммаОборотДт * (1 - ДолиЕНВД.ДоляЕНВД)
        |                           ИНАЧЕ 0
        |                       КОНЕЦ
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                       И (НЕ ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыРеализацииТоваров))
        |                   ТОГДА ВЫБОР
        |                           КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НЕЕНВД
        |                               ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
        |                           ИНАЧЕ 0
        |                       КОНЕЦ + ВЫБОР
        |                           КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &Распределяются
        |                               ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт * (1 - ДолиЕНВД.ДоляЕНВД)
        |                           ИНАЧЕ 0
        |                       КОНЕЦ
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                       И (НЕ ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыРеализацииТоваров))
        |                   ТОГДА ВЫБОР
        |                           КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НЕЕНВД
        |                               ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
        |                           ИНАЧЕ 0
        |                       КОНЕЦ + ВЫБОР
        |                           КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &Распределяются
        |                               ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт * (1 - ДолиЕНВД.ДоляЕНВД)
        |                           ИНАЧЕ 0
        |                       КОНЕЦ
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                       И (НЕ ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыРеализацииТоваров))
        |                   ТОГДА ВЫБОР
        |                           КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НЕЕНВД
        |                               ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
        |                           ИНАЧЕ 0
        |                       КОНЕЦ + ВЫБОР
        |                           КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &Распределяются
        |                               ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт * (1 - ДолиЕНВД.ДоляЕНВД)
        |                           ИНАЧЕ 0
        |                       КОНЕЦ
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                       И (НЕ ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации))
        |                   ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                       И (НЕ ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации))
        |                   ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                       И (НЕ ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации))
        |                   ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                       И (НЕ ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации))
        |                   ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                       И ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                       И ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                       И ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                       И ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           0,
        |           0,
        |           0,
        |           0
        |       ИЗ
        |           РегистрБухгалтерии.Хозрасчетный.Обороты(
        |                   &НачалоПериодаТек,
        |                   &КонецПериодаТек,
        |                   Месяц,
        |                   Счет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
        |                   &ПрочиеДоходыРасходы,
        |                   Организация = &Организация
        |                       И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок),
        |                   (НЕ КорСчет В ИЕРАРХИИ (&Счет68_02Хозрасчетный))
        |                       И (НЕ КорСчет В ИЕРАРХИИ (&Счет76_ОТХозрасчетный)),
        |                   ) КАК ХозрасчетныйОбороты
        |               ЛЕВОЕ СОЕДИНЕНИЕ ДолиЕНВД КАК ДолиЕНВД
        |               ПО (МЕСЯЦ(ХозрасчетныйОбороты.Период) = ДолиЕНВД.МесяцЕНВД)
        |       
        |       ОБЪЕДИНИТЬ ВСЕ
        |       
        |       ВЫБРАТЬ
        |           ХозрасчетныйОбороты.Организация,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.КорСубконто1.ВидРасходовНУ = &ТранспортныеРасходы
        |                       И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.КорСубконто1.ВидРасходовНУ = &ТранспортныеРасходы
        |                       И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.КорСубконто1.ВидРасходовНУ = &ТранспортныеРасходы
        |                       И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.КорСубконто1.ВидРасходовНУ = &ТранспортныеРасходы
        |                       И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.КорСубконто1.ВидРасходовНУ = &НеУчитываемыеРасходы
        |                       И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.КорСубконто1.ВидРасходовНУ = &НеУчитываемыеРасходы
        |                       И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.КорСубконто1.ВидРасходовНУ = &НеУчитываемыеРасходы
        |                       И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.КорСубконто1.ВидРасходовНУ = &НеУчитываемыеРасходы
        |                       И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидРасходовНУ = &НеУчитываемыеРасходы)
        |                       И (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидРасходовНУ = &ТранспортныеРасходы)
        |                       И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НеЕНВД
        |                   ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидРасходовНУ = &НеУчитываемыеРасходы)
        |                       И (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидРасходовНУ = &ТранспортныеРасходы)
        |                       И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НеЕНВД
        |                   ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидРасходовНУ = &НеУчитываемыеРасходы)
        |                       И (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидРасходовНУ = &ТранспортныеРасходы)
        |                       И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НеЕНВД
        |                   ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидРасходовНУ = &НеУчитываемыеРасходы)
        |                       И (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидРасходовНУ = &ТранспортныеРасходы)
        |                       И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НеЕНВД
        |                   ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0
        |       ИЗ
        |           РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериодаТек, &КонецПериодаТек, , Счет В ИЕРАРХИИ (&СчетаКосвенныхРасходовХозрасчетный), , Организация = &Организация, , &ВидСубконтоСтатьиЗатрат) КАК ХозрасчетныйОбороты
        |       
        |       ОБЪЕДИНИТЬ ВСЕ
        |       
        |       ВЫБРАТЬ
        |           ХозрасчетныйОбороты.Организация,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           ХозрасчетныйОбороты.СуммаОборотДт,
        |           ХозрасчетныйОбороты.СуммаНУОборотДт,
        |           ХозрасчетныйОбороты.СуммаПРОборотДт,
        |           ХозрасчетныйОбороты.СуммаВРОборотДт
        |       ИЗ
        |           РегистрБухгалтерии.Хозрасчетный.Обороты(
        |                   &НачалоПериодаТек,
        |                   &КонецПериодаТек,
        |                   ,
        |                   Счет В ИЕРАРХИИ (&СчетаКосвенныхРасходовХозрасчетный),
        |                   ,
        |                   Организация = &Организация
        |                       И КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &Распределяются
        |                       И (НЕ КорСубконто1.ВидРасходовНУ = &ТранспортныеРасходы),
        |                   ,
        |                   &ВидСубконтоСтатьиЗатрат) КАК ХозрасчетныйОбороты
        |       
        |       ОБЪЕДИНИТЬ ВСЕ
        |       
        |       ВЫБРАТЬ
        |           ХозрасчетныйОбороты.Организация,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           ХозрасчетныйОбороты.СуммаНУОборотКт,
        |           ХозрасчетныйОбороты.СуммаПРОборотКт,
        |           ХозрасчетныйОбороты.СуммаВРОборотКт,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0
        |       ИЗ
        |           РегистрБухгалтерии.Хозрасчетный.Обороты(
        |                   &НачалоПериодаТек,
        |                   &КонецПериодаТек,
        |                   ,
        |                   Счет В ИЕРАРХИИ (&СчетаУбытковХозрасчетный),
        |                   &ВидыРБП,
        |                   Организация = &Организация
        |                       И Субконто1.ВидРБП В (&ВидыУбытков),
        |                   КорСчет В ИЕРАРХИИ (&Счет99неЕНВДХозрасчетный),
        |                   ) КАК ХозрасчетныйОбороты
        |       
        |       ОБЪЕДИНИТЬ ВСЕ
        |       
        |       ВЫБРАТЬ
        |           ХозрасчетныйОбороты.Организация,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                       И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаМПЗХозрасчетный))
        |                   ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                       И (НЕ ХозрасчетныйОбороты.Субконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации))
        |                   ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0
        |       ИЗ
        |           РегистрБухгалтерии.Хозрасчетный.Обороты(
        |                   &НачалоПериодаТек,
        |                   &КонецПериодаТек,
        |                   ,
        |                   Счет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
        |                   &ПрочиеДоходыРасходы,
        |                   Организация = &Организация
        |                       И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)
        |                       И (НЕ КОРСубконто1 = &НалоговНачислено),
        |                   КорСчет В ИЕРАРХИИ (&Счет68_02Хозрасчетный),
        |                   &ВидыНалогов) КАК ХозрасчетныйОбороты
        |       
        |       ОБЪЕДИНИТЬ ВСЕ
        |       
        |       ВЫБРАТЬ
        |           ХозрасчетныйОбороты.Организация,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                   ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                   ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                   ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету
        |                   ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           ВЫБОР
        |               КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
        |                   ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
        |               ИНАЧЕ 0
        |           КОНЕЦ,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0,
        |           0
        |       ИЗ
        |           РегистрБухгалтерии.Хозрасчетный.Обороты(
        |                   &НачалоПериодаТек,
        |                   &КонецПериодаТек,
        |                   ,
        |                   Счет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
        |                   &ПрочиеДоходыРасходы,
        |                   Организация = &Организация
        |                       И Субконто1.ВидПрочихДоходовИРасходов В (&МассивНДССРасходов)
        |                       И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок),
        |                   КорСчет В ИЕРАРХИИ (&Счет68_02Хозрасчетный)
        |                       ИЛИ КорСчет В ИЕРАРХИИ (&Счет76_ОТХозрасчетный),
        |                   ) КАК ХозрасчетныйОбороты) КАК ВложенныйЗапрос
        |   
        |   СГРУППИРОВАТЬ ПО
        |       ВложенныйЗапрос.Организация) КАК ВложенныйЗапрос2
        |
        |СГРУППИРОВАТЬ ПО
        |   ВложенныйЗапрос2.Организация";
		
		Если НомерТекущейСхемы > 20 Тогда
			Запрос.УстановитьПараметр("Организация", СвойстваОрганизации.СписокОП);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		КонецЕсли;
		
		Результат = Запрос.Выполнить();
		
		Если НомерТекущейСхемы > 20 Тогда
			СформироватьТаблицуОрганизаций(ДокументРезультат,Результат.Выгрузить(),"Расходы",2,НазваниеОтчета);
			Возврат;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОбластьОтчета.Параметры.Заполнить(Выборка);
		Если ЭтоЕНВД Тогда
		СоздатьРамку(Выборка, "Расходы", ОбластьОтчета, 56, 47, 60, 2, "РасшифровкаНалог");	
		СоздатьРамку(Выборка, "ПрямыеРасходыТоварыУч", ОбластьОтчета, 12, 38, 60, 2, "РасшифровкаРасходыТовары");
		СоздатьРамку(Выборка, "ПрочиеРасходыУч", ОбластьОтчета, 110, 38, 60, 2, "РасшифровкаПрочиеРасходы");
		СоздатьРамку(Выборка, "ПрямыеРасходыУслуги", ОбластьОтчета, 12, 38, 59, 62, "РасшифровкаРасходыПроизводства");
		СоздатьРамку(Выборка, "ПрочиеРасходыНе", ОбластьОтчета, 110, 38, 59, 62, "РасшифровкаПрочиеРасходы");
		СоздатьРамку(Выборка, "ТранспортныеРасходы", ОбластьОтчета, 12, 38, 60, 121, "РасшифровкаТраспортныеРасходы");
		СоздатьРамку(Выборка, "ПрямыеРасходыТоварыНе", ОбластьОтчета, 110, 38, 60, 121, "РасшифровкаРасходыТовары");
		СоздатьРамку(Выборка, "КосвенныеРасходыУч", ОбластьОтчета, 12, 38, 59, 181, "РасшифровкаКосвенныеРасходы");
		СоздатьРамку(Выборка, "КосвенныеРасходыНе", ОбластьОтчета, 110, 38, 59, 181, "РасшифровкаКосвенныеРасходы");
		СоздатьРамку(Выборка, "КосвенныеРасходыРаспр", ОбластьОтчета, 60, 37, 60, 187, "РасшифровкаРаспределяемыеРасходы");
		
	Иначе
		СоздатьРамку(Выборка, "Расходы", ОбластьОтчета, 56, 47, 59, 1, "РасшифровкаНалог");	
		СоздатьРамку(Выборка, "ПрямыеРасходыТоварыУч", ОбластьОтчета, 12, 38, 59, 1, "РасшифровкаРасходыТовары");
		СоздатьРамку(Выборка, "ПрочиеРасходыУч", ОбластьОтчета, 110, 38, 59, 1, "РасшифровкаПрочиеРасходы");
		СоздатьРамку(Выборка, "ПрямыеРасходыУслуги", ОбластьОтчета, 12, 38, 59, 60, "РасшифровкаРасходыПроизводства");
		СоздатьРамку(Выборка, "ПрочиеРасходыНе", ОбластьОтчета, 110, 38, 59, 60, "РасшифровкаПрочиеРасходы");
		СоздатьРамку(Выборка, "ТранспортныеРасходы", ОбластьОтчета, 12, 38, 59, 119, "РасшифровкаТраспортныеРасходы");
		СоздатьРамку(Выборка, "ПрямыеРасходыТоварыНе", ОбластьОтчета, 110, 38, 59, 119, "РасшифровкаРасходыТовары");
		СоздатьРамку(Выборка, "КосвенныеРасходыУч", ОбластьОтчета, 12, 38, 59, 178, "РасшифровкаКосвенныеРасходы");
		СоздатьРамку(Выборка, "КосвенныеРасходыНе", ОбластьОтчета, 110, 38, 59, 178, "РасшифровкаКосвенныеРасходы");
		КонецЕсли;
		
		ОбластьОтчета.Параметры.РасшифровкаНалог                 = ?(СвойстваОрганизации.ЕстьОП, Неопределено, ПереходКСхеме(0));
		ОбластьОтчета.Параметры.РасшифровкаРасходыТовары         = ПереходКСхеме(3);
		ОбластьОтчета.Параметры.РасшифровкаРасходыПроизводства   = ПереходКСхеме(4);
		ОбластьОтчета.Параметры.РасшифровкаТраспортныеРасходы    = ПереходКСхеме(5);
		ОбластьОтчета.Параметры.РасшифровкаКосвенныеРасходы      = ПереходКСхеме(6);
		ОбластьОтчета.Параметры.РасшифровкаПрочиеРасходы         = ПереходКСхеме(7);
		ОбластьОтчета.Параметры.РасшифровкаРаспределяемыеРасходы = ПереходКСхеме(8);
		ОбластьОтчета.Параметры.РасшифровкаРасходыОбычные        = ПереходКСхеме(10);
		
		Если НЕ ПоказыватьКрасныйПрямоугольник Тогда
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки1);
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки2);
		КонецЕсли;
		
		ОбластьШапка.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное + ", " + ПредставлениеПериода(НачалоМесяца(НачалоПериодаТек), КонецМесяца(КонецПериодаТек), "ФП = Истина");
		ОбластьШапка.Параметры.НазваниеОтчета = НазваниеОтчета;
		ДокументРезультат.Вывести(ОбластьШапка);
		ДокументРезультат.Вывести(ОбластьОтчета);
		
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = "Анализ состояния налогового учета - " + НазваниеОтчета;
	КонецПроцедуры
	
	// Формирует отчет в режиме "Расходы по обычным видам деятельности"
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	Процедура	СформироватьОбычныеРасходы(ДокументРезультат, НомерТекущейСхемы)
	    НазваниеОтчета = "Расходы по обычным видам деятельности";
		
		Макет      = ПолучитьМакет("РасходыОбычные");
		ОбластьОтчета     = Макет.ПолучитьОбласть("Область");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоПериодаТек",     НачалоДня(НачалоПериодаТек));
		Запрос.УстановитьПараметр("КонецПериодаТек",     КонецДня(КонецПериодаТек));
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Запрос.УстановитьПараметр("НачалоПериодаПрошлого",  '20000101');
		Запрос.УстановитьПараметр("КонецПериодаПрошлого",     КонецДня(НачалоДня(НачалоПериодаТек) - 1));
		
		Запрос.УстановитьПараметр("СчетаПрямыхРасходовХозрасчетный", МассивПрямых);
		Запрос.УстановитьПараметр("СчетаКосвенныхРасходовХозрасчетный", МассивВсехКосвенных);
		Запрос.УстановитьПараметр("СчетаДавальческихЗатратХозрасчетный", ПланыСчетов.Хозрасчетный.ПроизводствоИзДавальческогоСырья);
		Запрос.УстановитьПараметр("МассивЗапасовБУ", МассивЗапасов2БУ);
		Запрос.УстановитьПараметр("МассивОСБУ", МассивОСБУ);
		Запрос.УстановитьПараметр("СчетаНЗПХозрасчетный", МассивПрямых);
		Запрос.УстановитьПараметр("СчетаКосвенныхРАсходов90Хозрасчетный", Массив9091БУ);
		
		МассивКосвенныхЗатрат20НУ = Новый Массив;
		МассивКосвенныхЗатрат20НУ.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
		МассивКосвенныхЗатрат20НУ.Добавить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства);
		
		Запрос.УстановитьПараметр("СчетаХозрасчетный", МассивВсехЗатрат);
		
		Запрос.УстановитьПараметр("СчетаТранспортныхРасходовХозрасчетный", ПланыСчетов.Хозрасчетный.ИздержкиОбращения);
		
		Запрос.УстановитьПараметр("НоменклатурныеГруппыЕНВД",  НоменклатурныеГруппыЕНВД);
		
		Запрос.УстановитьПараметр("НеЕНВД",         ВидыРасходовНеЕНВД);
		Запрос.УстановитьПараметр("СтатьиЗатрат",   ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
		Запрос.УстановитьПараметр("НоменклатурныеГруппы",ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
		Запрос.УстановитьПараметр("РасходыТранспортные",Перечисления.ВидыРасходовНУ.ТранспортныеРасходы);
		
		Массив = Новый Массив;
		Массив.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
		Массив.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
		Запрос.УстановитьПараметр("СтатьиЗатратНомГруппы", Массив);
		
		МассивНормируемых = Новый Массив;
		МассивНормируемых.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеЛичноеСтрахование);
		МассивНормируемых.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеЛичноеСтрахованиеНаСлучайСмертиИлиУтратыРаботоспособности);
		МассивНормируемых.Добавить(Перечисления.ВидыРасходовНУ.ДобровольноеСтрахованиеПоДоговорамДолгосрочногоСтрахованияЖизниРаботников);
		МассивНормируемых.Добавить(Перечисления.ВидыРасходовНУ.ПредставительскиеРасходы);
		МассивНормируемых.Добавить(Перечисления.ВидыРасходовНУ.РасходыНаВозмещениеЗатратРаботниковПоУплатеПроцентов);
		МассивНормируемых.Добавить(Перечисления.ВидыРасходовНУ.РасходыНаРекламуНормируемые);
		Запрос.УстановитьПараметр("Нормируемые", МассивНормируемых);
		
		Запрос.МенеджерВременныхТаблиц = НалоговыйУчет.СписокПрямыхРасходовНУ(Организация, КонецПериодаТек);
		
		Запрос.УстановитьПараметр("СчетаКосвенныхРасходов20ХозрасчетныйУчет",    ПланыСчетов.Хозрасчетный.Продажи_УправленческиеРасходы);
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ВложенныйЗапрос2.Организация,
		|	СУММА(ВложенныйЗапрос2.РасходыТранспортныеБУ) КАК РасходыТранспортныеБУ,
		|	СУММА(ВложенныйЗапрос2.РасходыТранспортныеНУ) КАК РасходыТранспортныеНУ,
		|	СУММА(ВложенныйЗапрос2.РасходыТранспортныеПР) КАК РасходыТранспортныеПР,
		|	СУММА(ВложенныйЗапрос2.РасходыТранспортныеВР) КАК РасходыТранспортныеВР,
		|	СУММА(ВложенныйЗапрос2.РасходыТранспортныеНачБУ) КАК РасходыТранспортныеНачБУ,
		|	СУММА(ВложенныйЗапрос2.РасходыТранспортныеНачНУ) КАК РасходыТранспортныеНачНУ,
		|	СУММА(ВложенныйЗапрос2.РасходыТранспортныеНачПР) КАК РасходыТранспортныеНачПР,
		|	СУММА(ВложенныйЗапрос2.РасходыТранспортныеНачВР) КАК РасходыТранспортныеНачВР,
		|	СУММА(ВложенныйЗапрос2.Расходы1БУ) КАК Расходы1БУ,
		|	СУММА(ВложенныйЗапрос2.Расходы1НУ) КАК Расходы1НУ,
		|	СУММА(ВложенныйЗапрос2.Расходы1ПР) КАК Расходы1ПР,
		|	СУММА(ВложенныйЗапрос2.Расходы1Вр) КАК Расходы1Вр,
		|	СУММА(ВложенныйЗапрос2.Расходы2БУ) КАК Расходы2БУ,
		|	СУММА(ВложенныйЗапрос2.Расходы2НУ) КАК Расходы2НУ,
		|	СУММА(ВложенныйЗапрос2.Расходы2Пр) КАК Расходы2Пр,
		|	СУММА(ВложенныйЗапрос2.Расходы2ВР) КАК Расходы2ВР,
		|	СУММА(ВложенныйЗапрос2.РасходыПрямыеБУ) КАК РасходыПрямыеБУ,
		|	СУММА(ВложенныйЗапрос2.РасходыПрямыеНУ) КАК РасходыПрямыеНУ,
		|	СУММА(ВложенныйЗапрос2.РасходыПрямыеПР) КАК РасходыПрямыеПР,
		|	СУММА(ВложенныйЗапрос2.РасходыПрямыеВР) КАК РасходыПрямыеВР,
		|	СУММА(ВложенныйЗапрос2.РасходыКосвенныеБУ) КАК РасходыКосвенныеБУ,
		|	СУММА(ВложенныйЗапрос2.РасходыКосвенныеНУ) КАК РасходыКосвенныеНУ,
		|	СУММА(ВложенныйЗапрос2.РасходыКосвенныеПР) КАК РасходыКосвенныеПР,
		|	СУММА(ВложенныйЗапрос2.РасходыКосвенныеВР) КАК РасходыКосвенныеВР,
		|	СУММА(ВложенныйЗапрос2.РасходыПрямыеБУ + ВложенныйЗапрос2.РасходыКосвенныеБУ + ВложенныйЗапрос2.РасходыТранспортныеБУ) КАК РасходыБУ,
		|	СУММА(ВложенныйЗапрос2.РасходыПрямыеНУ + ВложенныйЗапрос2.РасходыКосвенныеНУ + ВложенныйЗапрос2.РасходыТранспортныеНУ) КАК РасходыНУ,
		|	СУММА(ВложенныйЗапрос2.РасходыПрямыеПР + ВложенныйЗапрос2.РасходыКосвенныеПР + ВложенныйЗапрос2.РасходыТранспортныеПР) КАК РасходыПР,
		|	СУММА(ВложенныйЗапрос2.РасходыПрямыеВР + ВложенныйЗапрос2.РасходыКосвенныеВР + ВложенныйЗапрос2.РасходыТранспортныеВР) КАК РасходыВР,
		|	СУММА(ВложенныйЗапрос2.АмортизацияБУ) КАК АмортизацияБУ,
		|	СУММА(ВложенныйЗапрос2.АмортизацияНУ) КАК АмортизацияНУ,
		|	СУММА(ВложенныйЗапрос2.АмортизацияПР) КАК АмортизацияПР,
		|	СУММА(ВложенныйЗапрос2.АмортизацияВР) КАК АмортизацияВР,
		|	СУММА(ВложенныйЗапрос2.Расходы3БУ) КАК Расходы3БУ,
		|	СУММА(ВложенныйЗапрос2.Расходы3НУ) КАК Расходы3НУ,
		|	СУММА(ВложенныйЗапрос2.Расходы3ПР) КАК Расходы3ПР,
		|	СУММА(ВложенныйЗапрос2.Расходы3ВР) КАК Расходы3ВР,
		|	СУММА(ВложенныйЗапрос2.НЗПБУ) КАК НЗПБУ,
		|	СУММА(ВложенныйЗапрос2.НЗПНУ) КАК НЗПНУ,
		|	СУММА(ВложенныйЗапрос2.НЗППР) КАК НЗППР,
		|	СУММА(ВложенныйЗапрос2.НЗПВР) КАК НЗПВР
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Организация КАК Организация,
		|		СУММА(ВложенныйЗапрос.РасходыТранспортныеБУ) КАК РасходыТранспортныеБУ,
		|		СУММА(ВложенныйЗапрос.РасходыТранспортныеНУ) КАК РасходыТранспортныеНУ,
		|		СУММА(ВложенныйЗапрос.РасходыТранспортныеПР) КАК РасходыТранспортныеПР,
		|		СУММА(ВложенныйЗапрос.РасходыТранспортныеВР) КАК РасходыТранспортныеВР,
		|		СУММА(ВложенныйЗапрос.РасходыТранспортныеНачБУ) КАК РасходыТранспортныеНачБУ,
		|		СУММА(ВложенныйЗапрос.РасходыТранспортныеНачНУ) КАК РасходыТранспортныеНачНУ,
		|		СУММА(ВложенныйЗапрос.РасходыТранспортныеНачПР) КАК РасходыТранспортныеНачПР,
		|		СУММА(ВложенныйЗапрос.РасходыТранспортныеНачВР) КАК РасходыТранспортныеНачВР,
		|		СУММА(ВложенныйЗапрос.Расходы1БУ) КАК Расходы1БУ,
		|		СУММА(ВложенныйЗапрос.Расходы1НУ) КАК Расходы1НУ,
		|		СУММА(ВложенныйЗапрос.Расходы1ПР) КАК Расходы1ПР,
		|		СУММА(ВложенныйЗапрос.Расходы1Вр) КАК Расходы1Вр,
		|		СУММА(ВложенныйЗапрос.Расходы2БУ) КАК Расходы2БУ,
		|		СУММА(ВложенныйЗапрос.Расходы2НУ) КАК Расходы2НУ,
		|		СУММА(ВложенныйЗапрос.Расходы2Пр) КАК Расходы2Пр,
		|		СУММА(ВложенныйЗапрос.Расходы2ВР) КАК Расходы2ВР,
		|		СУММА(ВложенныйЗапрос.РасходыПрямыеБУ) КАК РасходыПрямыеБУ,
		|		СУММА(ВложенныйЗапрос.РасходыПрямыеНУ) КАК РасходыПрямыеНУ,
		|		СУММА(ВложенныйЗапрос.РасходыПрямыеПР) КАК РасходыПрямыеПР,
		|		СУММА(ВложенныйЗапрос.РасходыПрямыеВР) КАК РасходыПрямыеВР,
		|		СУММА(ВложенныйЗапрос.РасходыКосвенныеБУ) КАК РасходыКосвенныеБУ,
		|		СУММА(ВложенныйЗапрос.РасходыКосвенныеНУ) КАК РасходыКосвенныеНУ,
		|		СУММА(ВложенныйЗапрос.РасходыКосвенныеПР) КАК РасходыКосвенныеПР,
		|		СУММА(ВложенныйЗапрос.РасходыКосвенныеВР) КАК РасходыКосвенныеВР,
		|		СУММА(ВложенныйЗапрос.АмортизацияБУ) КАК АмортизацияБУ,
		|		СУММА(ВложенныйЗапрос.АмортизацияНУ) КАК АмортизацияНУ,
		|		СУММА(ВложенныйЗапрос.АмортизацияПР) КАК АмортизацияПР,
		|		СУММА(ВложенныйЗапрос.АмортизацияВР) КАК АмортизацияВР,
		|		СУММА(ВложенныйЗапрос.Расходы3БУ) КАК Расходы3БУ,
		|		СУММА(ВложенныйЗапрос.Расходы3НУ) КАК Расходы3НУ,
		|		СУММА(ВложенныйЗапрос.Расходы3ПР) КАК Расходы3ПР,
		|		СУММА(ВложенныйЗапрос.Расходы3ВР) КАК Расходы3ВР,
		|		СУММА(ВложенныйЗапрос.НЗПБУ) КАК НЗПБУ,
		|		СУММА(ВложенныйЗапрос.НЗПНУ) КАК НЗПНУ,
		|		СУММА(ВложенныйЗапрос.НЗППР) КАК НЗППР,
		|		СУММА(ВложенныйЗапрос.НЗПВР) КАК НЗПВР
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ХозрасчетныйОстаткиИОбороты.Организация КАК Организация,
		|			0 КАК РасходыТранспортныеБУ,
		|			0 КАК РасходыТранспортныеНУ,
		|			0 КАК РасходыТранспортныеПР,
		|			0 КАК РасходыТранспортныеВР,
		|			0 КАК РасходыТранспортныеНачБУ,
		|			0 КАК РасходыТранспортныеНачНУ,
		|			0 КАК РасходыТранспортныеНачПР,
		|			0 КАК РасходыТранспортныеНачВР,
		|			0 КАК Расходы1БУ,
		|			0 КАК Расходы1НУ,
		|			0 КАК Расходы1ПР,
		|			0 КАК Расходы1Вр,
		|			0 КАК Расходы2БУ,
		|			0 КАК Расходы2НУ,
		|			0 КАК Расходы2Пр,
		|			0 КАК Расходы2ВР,
		|			ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК РасходыПрямыеБУ,
		|			ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток КАК РасходыПрямыеНУ,
		|			ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстаток КАК РасходыПрямыеПР,
		|			ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстаток КАК РасходыПрямыеВР,
		|			0 КАК РасходыКосвенныеБУ,
		|			0 КАК РасходыКосвенныеНУ,
		|			0 КАК РасходыКосвенныеПР,
		|			0 КАК РасходыКосвенныеВР,
		|			0 КАК АмортизацияБУ,
		|			0 КАК АмортизацияНУ,
		|			0 КАК АмортизацияПР,
		|			0 КАК АмортизацияВР,
		|			0 КАК Расходы3БУ,
		|			0 КАК Расходы3НУ,
		|			0 КАК Расходы3ПР,
		|			0 КАК Расходы3ВР,
		|			ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК НЗПБУ,
		|			ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток КАК НЗПНУ,
		|			ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстаток КАК НЗППР,
		|			ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстаток КАК НЗПВР
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаНЗПХозрасчетный),
		|					&НоменклатурныеГруппы,
		|					(НЕ Субконто1 В (&НоменклатурныеГруппыЕНВД))
		|						И Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивЗапасовБУ)
		|						ИЛИ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивОСБУ)
		|							И ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ <> ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Амортизация)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивЗапасовБУ)
		|						ИЛИ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивОСБУ)
		|							И ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ <> ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Амортизация)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивЗапасовБУ)
		|						ИЛИ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивОСБУ)
		|							И ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ <> ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Амортизация)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивЗапасовБУ)
		|						ИЛИ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивОСБУ)
		|							И ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ <> ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Амортизация)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивЗапасовБУ))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивОСБУ))
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивЗапасовБУ))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивОСБУ))
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивЗапасовБУ))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивОСБУ))
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивЗапасовБУ))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивОСБУ))
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаПрямыхРАсходовХозрасчетный)
		|						И (НЕ ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаПрямыхРАсходовХозрасчетный)
		|						И (НЕ ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаПрямыхРАсходовХозрасчетный)
		|						И (НЕ ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаПрямыхРАсходовХозрасчетный)
		|						И (НЕ ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаКосвенныхРАсходовХозрасчетный)
		|						И (НЕ ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаКосвенныхРАсходовХозрасчетный)
		|						И (НЕ ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаКосвенныхРАсходовХозрасчетный)
		|						И (НЕ ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаКосвенныхРАсходовХозрасчетный)
		|						И (НЕ ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивОСБУ)
		|						И ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Амортизация)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивОСБУ)
		|						И ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Амортизация)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивОСБУ)
		|						И ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Амортизация)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&МассивОСБУ)
		|						И ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = ЗНАЧЕНИЕ(Перечисление.ВидыРасходовНУ.Амортизация)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаПрямыхРАсходовХозрасчетный)
		|						ИЛИ Счет В ИЕРАРХИИ (&СчетаКосвенныхРАсходовХозрасчетный),
		|					&СтатьиЗатрат,
		|					Организация = &Организация
		|						И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД),
		|					(НЕ КорСчет В ИЕРАРХИИ (&СчетаКосвенныхРАсходовХозрасчетный))
		|						И (НЕ КорСчет В ИЕРАРХИИ (&СчетаПрямыхРАсходовХозрасчетный)),
		|					) КАК ХозрасчетныйОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОстаткиИОбороты.Организация,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОстаткиИОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные
		|					ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОстаткиИОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные
		|					ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаНУОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОстаткиИОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные
		|					ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаПРОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстаток
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОстаткиИОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные
		|					ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаВРОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстаток
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОстаткиИОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные
		|					ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОстаткиИОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные
		|					ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОстаткиИОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные
		|					ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстаток
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОстаткиИОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные
		|					ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстаток
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОстаткиИОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные)
		|						И (НЕ ХозрасчетныйОстаткиИОбороты.Счет В ИЕРАРХИИ (&СчетаНЗПХозрасчетный))
		|					ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОстаткиИОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные)
		|						И (НЕ ХозрасчетныйОстаткиИОбороты.Счет В ИЕРАРХИИ (&СчетаНЗПХозрасчетный))
		|					ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОстаткиИОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные)
		|						И (НЕ ХозрасчетныйОстаткиИОбороты.Счет В ИЕРАРХИИ (&СчетаНЗПХозрасчетный))
		|					ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстаток
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОстаткиИОбороты.Субконто1.ВидРасходовНУ = &РасходыТранспортные)
		|						И (НЕ ХозрасчетныйОстаткиИОбороты.Счет В ИЕРАРХИИ (&СчетаНЗПХозрасчетный))
		|					ТОГДА ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстаток
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаКосвенныхРасходовХозрасчетный),
		|					&СтатьиЗатрат,
		|					Организация = &Организация
		|						И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)) КАК ХозрасчетныйОстаткиИОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОстаткиИОбороты.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
		|			ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток,
		|			ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстаток,
		|			ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстаток,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
		|			ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток,
		|			ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстаток,
		|			ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстаток
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериодаТек, &КонецПериодаТек, , , Счет В ИЕРАРХИИ (&СчетаДавальческихЗатратХозрасчетный), , Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			-ХозрасчетныйОбороты.СуммаНУОборотДт,
		|			ХозрасчетныйОбороты.СуммаПРОборотДт,
		|			ХозрасчетныйОбороты.СуммаНУОборотДт + ХозрасчетныйОбороты.СуммаВРОборотДт,
		|			0,
		|			ХозрасчетныйОбороты.СуммаНУОборотДт,
		|			-ХозрасчетныйОбороты.СуммаПРОборотДт,
		|			-ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаВРОборотДт,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаКосвенныхРасходов20ХозрасчетныйУчет),
		|					&СтатьиЗатратНомГруппы,
		|					Организация = &Организация
		|						И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД),
		|					КорСчет В ИЕРАРХИИ (&СчетаКосвенныхРАсходов90Хозрасчетный),
		|					) КАК ХозрасчетныйОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ХозрасчетныйОбороты.СуммаОборотДт - ХозрасчетныйОбороты.СуммаОборотКт,
		|			ХозрасчетныйОбороты.СуммаНУОборотДт - ХозрасчетныйОбороты.СуммаНУОборотКт,
		|			ХозрасчетныйОбороты.СуммаПРОборотДт - ХозрасчетныйОбороты.СуммаПРОборотКт,
		|			ХозрасчетныйОбороты.СуммаВРОборотДт - ХозрасчетныйОбороты.СуммаВРОборотКт,
		|			0,
		|			0,
		|			0,
		|			0
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаПрошлого,
		|					&КонецПериодаПрошлого,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаКосвенныхРасходовХозрасчетный),
		|					&СтатьиЗатрат,
		|					Организация = &Организация
		|						И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|						И Субконто1.ВидРасходовНУ В (&Нормируемые),
		|					(НЕ КорСчет В ИЕРАРХИИ (&СчетаКосвенныхРАсходовХозрасчетный))
		|						И (НЕ КорСчет В ИЕРАРХИИ (&СчетаПрямыхРАсходовХозрасчетный)),
		|					) КАК ХозрасчетныйОбороты) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Организация) КАК ВложенныйЗапрос2
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос2.Организация";
		
		Если НомерТекущейСхемы > 20 Тогда
			Запрос.УстановитьПараметр("Организация", СвойстваОрганизации.СписокОП);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		КонецЕсли;
		
		Результат = Запрос.Выполнить();
		
		Если НомерТекущейСхемы > 20 Тогда
			СформироватьТаблицуОрганизаций(ДокументРезультат,Результат.Выгрузить(),"Расходы",10, НазваниеОтчета);
			Возврат;
		КонецЕсли;
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОбластьОтчета.Параметры.Заполнить(Выборка);
		
		СоздатьРамку(Выборка, "РасходыПрямые", ОбластьОтчета, 20, 36, 58, 3, "РасшифровкаРасходыПрямые");
		СоздатьРамку(Выборка, "РасходыКосвенные", ОбластьОтчета, 59, 36, 58, 3, "РасшифровкаРасходыКосвенные");
		СоздатьРамку(Выборка, "РасходыТранспортные", ОбластьОтчета, 99, 36, 58, 3, "РасшифровкаРасходыТранспортные");
		СоздатьРамку(Выборка, "Расходы1", ОбластьОтчета, 14, 36, 58, 141, "РасшифровкаРасходы1");
		СоздатьРамку(Выборка, "Амортизация", ОбластьОтчета, 53, 36, 58, 141, "РасшифровкаАмортизация");
		СоздатьРамку(Выборка, "Расходы2", ОбластьОтчета, 92, 36, 58, 141, "РасшифровкаРасходы2");
		СоздатьРамку(Выборка, "РасходыТранспортныеНач", ОбластьОтчета, 32, 36, 62, 205, "РасшифровкаРасходыТранспортныеНач");
		СоздатьРамку(Выборка, "Расходы3", ОбластьОтчета, 73, 36, 62, 205, "РасшифровкаРасходы3");
		СоздатьРамку(Выборка, "НЗП", ОбластьОтчета, 113, 36, 62, 205, "РасшифровкаНЗП");
	    СоздатьРамку(Выборка, "Расходы", ОбластьОтчета, 24, 112, 60, 70, "");	
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", МассивПрямых, МассивПрямыхНУ,"НоменклатурныеГруппы","НЕ ",НоменклатурныеГруппыЕНВД,,,,);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", МассивПрямых,МассивПрямыхНУ,"Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", МассивПрямых, МассивПрямыхНУ,"СтатьиЗатрат","НЕ ВидРасходовНУ","ТранспортныеРасходы",,МассивВсехЗатрат,МассивВсехЗатратНУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "Косвенные20", МассивКосвенныхЗатрат20НУ, ,"СтатьиЗатрат","НЕ ВидРасходовНУ","ТранспортныеРасходы",,"Продажи_УправленческиеРасходыНеЕНВД");
		ОбластьОтчета.Параметры.РасшифровкаРасходыПрямые = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Прямые производственные расходы");
		
		Массив = Новый Массив;
		Массив.Добавить(Перечисления.ВидыРасходовНУ.ТранспортныеРасходы);                                                                                                              
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", МассивВсехКосвенных, МассивВсехКосвенныхНУ,"СтатьиЗатрат","НЕ ВидРасходовНУ",Перечисления.ВидыРасходовНУ.ТранспортныеРасходы);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", МассивВсехКосвенных, МассивВсехКосвенныхНУ,"СтатьиЗатрат","НЕ ВидРасходовНУ","ТранспортныеРасходы",,МассивВсехЗатрат,МассивВсехЗатратНУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "-Косвенные20", МассивКосвенныхЗатрат20НУ, ,"СтатьиЗатрат","НЕ ВидРасходовНУ","ТранспортныеРасходы",,"Продажи_УправленческиеРасходыНеЕНВД");
		ОбластьОтчета.Параметры.РасшифровкаРасходыКосвенные = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Косвенные расходы");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", "ИздержкиОбращения", "ИздержкиОбращения","СтатьиЗатрат","ВидРасходовНУ","ТранспортныеРасходы");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ИздержкиОбращения", "ИздержкиОбращения","СтатьиЗатрат","ВидРасходовНУ","ТранспортныеРасходы");
		ОбластьОтчета.Параметры.РасшифровкаРасходыТранспортные = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Транспортые расходы");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", "ИздержкиОбращения", "ИздержкиОбращения","СтатьиЗатрат","ВидРасходовНУ","ТранспортныеРасходы");
		ОбластьОтчета.Параметры.РасшифровкаРасходыТранспортныеНач = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Транспортные расходы, отнесенные на остаток товаров в прошлых периодах");

		Массив = Новый Массив;
		Массив.Добавить(Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения);  
		Массив.Добавить(Перечисления.ВидыРасходовНУ.ТранспортныеРасходы);  
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СальдоНормируемых", МассивВсехКосвенных, МассивВсехКосвенныхНУ,"СтатьиЗатрат","НЕ ВидРасходовНУ",Перечисления.ВидыРасходовНУ.ТранспортныеРасходы);
		ОбластьОтчета.Параметры.РасшифровкаРасходы3 = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Косвенные расходы, не включенные в уменьшение прибыли в прошлых периодах");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", МассивПрямых, МассивПрямыхНУ,"НоменклатурныеГруппы","НЕ ",НоменклатурныеГруппыЕНВД,,,,);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", МассивПрямых, МассивПрямыхНУ,"Номенклатура");
		ОбластьОтчета.Параметры.РасшифровкаНЗП = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Незавершенное производство прошлых периодов");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", МассивВсехЗатрат, МассивВсехЗатратНУ,
			"СтатьиЗатрат",,,, МассивЗапасов2БУ, МассивЗапасов2НУ);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", МассивВсехЗатрат, МассивВсехЗатратНУ, 
			"СтатьиЗатрат", "НЕ ВидРасходовНУ", Перечисления.ВидыРасходовНУ.Амортизация,, МассивОСБУ,МассивОСНУ);
		ОбластьОтчета.Параметры.РасшифровкаРасходы1 = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Стоимость товаров, списанных на расходы производства и издержки обращения");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", МассивВсехЗатрат, МассивВсехЗатратНУ, 
			"СтатьиЗатрат", "ВидРасходовНУ", Перечисления.ВидыРасходовНУ.Амортизация,, МассивОСБУ,МассивОСНУ);
		ОбластьОтчета.Параметры.РасшифровкаАмортизация = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Амортизация");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", МассивВсехЗатрат,МассивВсехЗатратНУ,"СтатьиЗатрат",,,,МассивЗапасовБУ,МассивЗапасовНУ,"НЕ ");
		ОбластьОтчета.Параметры.РасшифровкаРасходы2 = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Услуги сторонних организаций, оплата труда, налоги и прочие расходы");
		
		Если НЕ ПоказыватьКрасныйПрямоугольник Тогда
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки1);
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки2);
		КонецЕсли;
		
		ОбластьШапка.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное + ", " + ПредставлениеПериода(НачалоМесяца(НачалоПериодаТек), КонецМесяца(КонецПериодаТек), "ФП = Истина");
		ОбластьШапка.Параметры.НазваниеОтчета = НазваниеОтчета;
		ДокументРезультат.Вывести(ОбластьШапка);
		ДокументРезультат.Вывести(ОбластьОтчета);
		
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = "Анализ состояния налогового учета - " + НазваниеОтчета;
	КонецПроцедуры
	
	// Формирует отчет в режиме "Прочие расходы"
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	Процедура  СформироватьПрочиеРасходы(ДокументРезультат, НомерТекущейСхемы)
	    НазваниеОтчета = "Прочие расходы";
		Макет      = ПолучитьМакет("РасходыПрочие" + ?(ЭтоЕНВД,"ЕНВД",""));
		ОбластьОтчета     = Макет.ПолучитьОбласть("Область");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоПериодаТек",     НачалоДня(НачалоПериодаТек));
		Запрос.УстановитьПараметр("КонецПериодаТек",     КонецДня(КонецПериодаТек));
		Запрос.УстановитьПараметр("Организация", Организация);
		
		
		Запрос.УстановитьПараметр("Счет91_02Хозрасчетный", ПланыСчетов.Хозрасчетный.ПрочиеРасходы);
		Запрос.УстановитьПараметр("ВидСубконто", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
		Запрос.УстановитьПараметр("ВидСубконтоСтатьиЗатрат", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
		Запрос.УстановитьПараметр("ПрочиеДоходыРасходы",ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы);
		
		Запрос.УстановитьПараметр("Счет91Хозрасчетный", ПланыСчетов.Хозрасчетный.ПрочиеДоходыИРасходы);
		Запрос.УстановитьПараметр("Счет91_09Хозрасчетный", ПланыСчетов.Хозрасчетный.СальдоПрочихДоходовИРасходов);
		Запрос.УстановитьПараметр("Счет99неЕНВДХозрасчетный",СтруктураПараметров.Счет99);
		Запрос.УстановитьПараметр("Счет91_02Хозрасчетный", ПланыСчетов.Хозрасчетный.ПрочиеРасходы);
		Запрос.УстановитьПараметр("Счет99ЕНВДХозрасчетный",СтруктураПараметров.Счет99ЕНВД);
		Запрос.УстановитьПараметр("СчетНДСХозрасчетный",ПланыСчетов.Хозрасчетный.НДС);
		
		Запрос.УстановитьПараметр("СчетМПЗ2Хозрасчетный", МассивЗапасовБУ);
		
		Запрос.УстановитьПараметр("СчетаУбытковХозрасчетный", МассивУбытков);

		Запрос.УстановитьПараметр("СчетаОСХозрасчетный", МассивОСБУ);
		
		Запрос.УстановитьПараметр("ВидыПрочейРеализации", ВидыПрочейРеализации);
		
		Запрос.УстановитьПараметр("ВидыРеализацииТоваров", ВидыРеализацииТоваров);
		Запрос.УстановитьПараметр("НалоговНачислено", Перечисления.ВидыПлатежейВГосБюджет.Налог);
		Запрос.УстановитьПараметр("ВидыНалогов", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыПлатежейВГосБюджет);
		
		Запрос.УстановитьПараметр("НеЕНВД", НеЕНВД);
		Запрос.УстановитьПараметр("НеЕНВДСписок", ВидыРасходовНеЕНВД);
		Запрос.УстановитьПараметр("ЕНВД",   ЕНВД);
		Запрос.УстановитьПараметр("Распределяются",   Распределяются);
		Запрос.МенеджерВременныхТаблиц = НалоговыйУчет.ПолучитьДолиЕНВД(Новый Структура("ДатаНачалаПериода,ДатаКонцаПериода,СписокОрганизаций",НачалоПериодаТек,КонецПериодаТек,СвойстваОрганизации.СписокОП));
        
        МассивНДССРасходов = Новый Массив;
        МассивНДССРасходов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницыПоРасчетамВУЕ);
        МассивНДССРасходов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате);
        МассивНДССРасходов.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.РасходыПоПередачеТоваровБезвозмездноИДляСобственныхНужд);
        Запрос.УстановитьПараметр("МассивНДССРасходов", МассивНДССРасходов);
        
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ВложенныйЗапрос2.Организация КАК Организация,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыОСБУ) КАК ПрочиеРасходыОСБУ,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыОСНУ) КАК ПрочиеРасходыОСНУ,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыОСПР) КАК ПрочиеРасходыОСПР,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыОСВР) КАК ПрочиеРасходыОСВР,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыДрБУ) КАК ПрочиеРасходыДрБУ,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыДрНУ) КАК ПрочиеРасходыДрНУ,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыДрПР) КАК ПрочиеРасходыДрПР,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыДрВР) КАК ПрочиеРасходыДрВР,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыНеБУ) КАК ПрочиеРасходыНеБУ,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыНеНУ) КАК ПрочиеРасходыНеНУ,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыНеПР) КАК ПрочиеРасходыНеПР,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыНеВР) КАК ПрочиеРасходыНеВР,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыРаспрБУ) КАК ПрочиеРасходыРаспрБУ,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыРаспрНУ) КАК ПрочиеРасходыРаспрНУ,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыРаспрПР) КАК ПрочиеРасходыРаспрПР,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыРаспрВР) КАК ПрочиеРасходыРаспрВР,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыНеЕНВДБУ) КАК ПрочиеРасходыНеЕНВДБУ,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыНеЕНВДНУ) КАК ПрочиеРасходыНеЕНВДНУ,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыНеЕНВДПР) КАК ПрочиеРасходыНеЕНВДПР,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыНеЕНВДВР) КАК ПрочиеРасходыНеЕНВДВР,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыЕНВДБУ) КАК ПрочиеРасходыЕНВДБУ,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыЕНВДНУ) КАК ПрочиеРасходыЕНВДНУ,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыЕНВДПР) КАК ПрочиеРасходыЕНВДПР,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыЕНВДВР) КАК ПрочиеРасходыЕНВДВР,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыОСБУ + ВложенныйЗапрос2.ПрочиеРасходыДрБУ) КАК ПрочиеРасходыБУ,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыОСНУ + ВложенныйЗапрос2.ПрочиеРасходыДрНУ) КАК ПрочиеРасходыНУ,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыОСПР + ВложенныйЗапрос2.ПрочиеРасходыДрПР) КАК ПрочиеРасходыПР,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыОСВР + ВложенныйЗапрос2.ПрочиеРасходыДрВР) КАК ПрочиеРасходыВР,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыНеЕНВДБУ + ВложенныйЗапрос2.ПрочиеРасходыРаспрБУ - ВложенныйЗапрос2.ПрочиеРасходыЕНВДБУ) КАК ПрочиеРасходыУчБУ,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыНеЕНВДНУ + ВложенныйЗапрос2.ПрочиеРасходыРаспрНУ - ВложенныйЗапрос2.ПрочиеРасходыЕНВДНУ) КАК ПрочиеРасходыУчНУ,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыНеЕНВДПР + ВложенныйЗапрос2.ПрочиеРасходыРаспрПР - ВложенныйЗапрос2.ПрочиеРасходыЕНВДПР) КАК ПрочиеРасходыУчПР,
		|	СУММА(ВложенныйЗапрос2.ПрочиеРасходыНеЕНВДВР + ВложенныйЗапрос2.ПрочиеРасходыРаспрВР - ВложенныйЗапрос2.ПрочиеРасходыЕНВДВР) КАК ПрочиеРасходыУчВР
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Организация КАК Организация,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыОСБУ) КАК ПрочиеРасходыОСБУ,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыОСНУ) КАК ПрочиеРасходыОСНУ,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыОСПР) КАК ПрочиеРасходыОСПР,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыОСВР) КАК ПрочиеРасходыОСВР,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыДрБУ) КАК ПрочиеРасходыДрБУ,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыДрНУ) КАК ПрочиеРасходыДрНУ,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыДрПР) КАК ПрочиеРасходыДрПР,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыДрВР) КАК ПрочиеРасходыДрВР,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыНеБУ) КАК ПрочиеРасходыНеБУ,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыНеНУ) КАК ПрочиеРасходыНеНУ,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыНеПР) КАК ПрочиеРасходыНеПР,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыНеВР) КАК ПрочиеРасходыНеВР,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыРаспрБУ) КАК ПрочиеРасходыРаспрБУ,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыРаспрНУ) КАК ПрочиеРасходыРаспрНУ,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыРаспрПР) КАК ПрочиеРасходыРаспрПР,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыРаспрВР) КАК ПрочиеРасходыРаспрВР,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыНеЕНВДБУ) КАК ПрочиеРасходыНеЕНВДБУ,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыНеЕНВДНУ) КАК ПрочиеРасходыНеЕНВДНУ,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыНеЕНВДПР) КАК ПрочиеРасходыНеЕНВДПР,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыНеЕНВДВР) КАК ПрочиеРасходыНеЕНВДВР,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыЕНВДБУ) КАК ПрочиеРасходыЕНВДБУ,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыЕНВДНУ) КАК ПрочиеРасходыЕНВДНУ,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыЕНВДПР) КАК ПрочиеРасходыЕНВДПР,
		|		СУММА(ВложенныйЗапрос.ПрочиеРасходыЕНВДВР) КАК ПрочиеРасходыЕНВДВР
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация КАК Организация,
		|			ХозрасчетныйОбороты.СуммаОборотДт КАК ПрочиеРасходыОСБУ,
		|			ХозрасчетныйОбороты.СуммаНУОборотДт КАК ПрочиеРасходыОСНУ,
		|			ХозрасчетныйОбороты.СуммаПРОборотДт КАК ПрочиеРасходыОСПР,
		|			ХозрасчетныйОбороты.СуммаВРОборотДт КАК ПрочиеРасходыОСВР,
		|			0 КАК ПрочиеРасходыДрБУ,
		|			0 КАК ПрочиеРасходыДрНУ,
		|			0 КАК ПрочиеРасходыДрПР,
		|			0 КАК ПрочиеРасходыДрВР,
		|			0 КАК ПрочиеРасходыНеБУ,
		|			0 КАК ПрочиеРасходыНеНУ,
		|			0 КАК ПрочиеРасходыНеПР,
		|			0 КАК ПрочиеРасходыНеВР,
		|			0 КАК ПрочиеРасходыРаспрБУ,
		|			0 КАК ПрочиеРасходыРаспрНУ,
		|			0 КАК ПрочиеРасходыРаспрПР,
		|			0 КАК ПрочиеРасходыРаспрВР,
		|			ХозрасчетныйОбороты.СуммаОборотДт КАК ПрочиеРасходыНеЕНВДБУ,
		|			ХозрасчетныйОбороты.СуммаНУОборотДт КАК ПрочиеРасходыНеЕНВДНУ,
		|			ХозрасчетныйОбороты.СуммаПРОборотДт КАК ПрочиеРасходыНеЕНВДПР,
		|			ХозрасчетныйОбороты.СуммаВРОборотДт КАК ПрочиеРасходыНеЕНВДВР,
		|			0 КАК ПрочиеРасходыЕНВДБУ,
		|			0 КАК ПрочиеРасходыЕНВДНУ,
		|			0 КАК ПрочиеРасходыЕНВДПР,
		|			0 КАК ПрочиеРасходыЕНВДВР
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
		|					&ПрочиеДоходыРасходы,
		|					Организация = &Организация
		|						И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НеЕНВД
		|						И Субконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации)
		|						И Субконто1.ПринятиеКналоговомуУчету,
		|					КорСчет В ИЕРАРХИИ (&СчетаОСХозрасчетный),
		|					) КАК ХозрасчетныйОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ХозрасчетныйОбороты.СуммаОборотДт,
		|			ХозрасчетныйОбороты.СуммаНУОборотДт,
		|			ХозрасчетныйОбороты.СуммаПРОборотДт,
		|			ХозрасчетныйОбороты.СуммаВРОборотДт,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ХозрасчетныйОбороты.СуммаОборотДт,
		|			ХозрасчетныйОбороты.СуммаНУОборотДт,
		|			ХозрасчетныйОбороты.СуммаПРОборотДт,
		|			ХозрасчетныйОбороты.СуммаВРОборотДт,
		|			0,
		|			0,
		|			0,
		|			0
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
		|					&ПрочиеДоходыРасходы,
		|					Организация = &Организация
		|						И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НеЕНВД
		|						И (НЕ Субконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации)),
		|					(НЕ КорСчет В ИЕРАРХИИ (&СчетНДСХозрасчетный)),
		|					) КАК ХозрасчетныйОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ХозрасчетныйОбороты.СуммаОборотДт,
		|			ХозрасчетныйОбороты.СуммаНУОборотДт,
		|			ХозрасчетныйОбороты.СуммаПРОборотДт,
		|			ХозрасчетныйОбороты.СуммаВРОборотДт,
		|			0,
		|			0,
		|			0,
		|			0,
		|			-ХозрасчетныйОбороты.СуммаОборотДт,
		|			-ХозрасчетныйОбороты.СуммаНУОборотДт,
		|			-ХозрасчетныйОбороты.СуммаПРОборотДт,
		|			-ХозрасчетныйОбороты.СуммаВРОборотДт,
		|			0,
		|			0,
		|			0,
		|			0
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
		|					&ПрочиеДоходыРасходы,
		|					Организация = &Организация
		|						И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)
		|						И ((НЕ Субконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации))
		|							И (НЕ Субконто1.ПринятиеКналоговомуУчету)),
		|					(НЕ КорСчет В ИЕРАРХИИ (&СчетНДСХозрасчетный)),
		|					) КАК ХозрасчетныйОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ХозрасчетныйОбороты.СуммаОборотДт,
		|			ХозрасчетныйОбороты.СуммаНУОборотДт,
		|			ХозрасчетныйОбороты.СуммаПРОборотДт,
		|			ХозрасчетныйОбороты.СуммаВРОборотДт,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ХозрасчетныйОбороты.СуммаОборотДт * ДолиЕНВД.ДоляЕНВД,
		|			ХозрасчетныйОбороты.СуммаНУОборотДт * ДолиЕНВД.ДоляЕНВД,
		|			ХозрасчетныйОбороты.СуммаПРОборотДт * ДолиЕНВД.ДоляЕНВД,
		|			ХозрасчетныйОбороты.СуммаВРОборотДт * ДолиЕНВД.ДоляЕНВД
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					Месяц,
		|					Счет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
		|					&ПрочиеДоходыРасходы,
		|					Организация = &Организация
		|						И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &Распределяются,
		|					(НЕ КорСчет В ИЕРАРХИИ (&СчетНДСХозрасчетный))
		|						И (НЕ КорСчет В ИЕРАРХИИ (&СчетМПЗ2Хозрасчетный)),
		|					) КАК ХозрасчетныйОбороты
		|				ЛЕВОЕ СОЕДИНЕНИЕ ДолиЕНВД КАК ДолиЕНВД
		|				ПО (МЕСЯЦ(ХозрасчетныйОбороты.Период) = ДолиЕНВД.МесяцЕНВД)
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ХозрасчетныйОбороты.СуммаОборотДт,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ХозрасчетныйОбороты.СуммаОборотДт,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
		|					&ПрочиеДоходыРасходы,
		|					Организация = &Организация
		|						И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НеЕНВД
		|						И (НЕ Субконто1.ВидПрочихДоходовИРасходов В (&ВидыРеализацииТоваров))
		|						И (НЕ КорСубконто1 = &НалоговНачислено),
		|					КорСчет В ИЕРАРХИИ (&СчетНДСХозрасчетный),
		|					&ВидыНалогов) КАК ХозрасчетныйОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ХозрасчетныйОбороты.СуммаОборотДт,
		|			ХозрасчетныйОбороты.СуммаНУОборотДт,
		|			ХозрасчетныйОбороты.СуммаПРОборотДт,
		|			ХозрасчетныйОбороты.СуммаВРОборотДт,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.Субконто1.ПринятиеКналоговомуУчету)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
		|					&ПрочиеДоходыРасходы,
		|					Организация = &Организация
		|						И Субконто1.ВидПрочихДоходовИРасходов  В (&МассивНДССРасходов)
		|						И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД),
		|					КорСчет В ИЕРАРХИИ (&СчетНДСХозрасчетный),
		|					) КАК ХозрасчетныйОбороты) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Организация) КАК ВложенныйЗапрос2
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос2.Организация";
		
		Если НомерТекущейСхемы > 20 Тогда
			Запрос.УстановитьПараметр("Организация", СвойстваОрганизации.СписокОП);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		КонецЕсли;
		
		Результат = Запрос.Выполнить();
		
		Если НомерТекущейСхемы > 20 Тогда
			СформироватьТаблицуОрганизаций(ДокументРезультат,Результат.Выгрузить(),"ПрочиеРасходы",7, НазваниеОтчета);
			Возврат;
		КонецЕсли;
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОбластьОтчета.Параметры.Заполнить(Выборка);
		
		МассивЗапасов2_НДСБУ = Новый Массив;
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.ОборудованиеКУстановке);
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы);
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.Материалы);
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.Полуфабрикаты);
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыНаСкладах);
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговле);
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.ТараПодТоваромИПорожняя);
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.ПокупныеИзделия);
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ);
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ);
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ);
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыОтгруженные);
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.РасходыБудущихПериодов);
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников);
		МассивЗапасов2_НДСБУ.Добавить(ПланыСчетов.Хозрасчетный.НДС);
		
		Если ЭтоЕНВД Тогда
		СоздатьРамку(Выборка, "ПрочиеРасходыНе", ОбластьОтчета, 14, 37, 60, 2, "РасшифровкаПрочиеРасходыНе");
		СоздатьРамку(Выборка, "ПрочиеРасходыУч", ОбластьОтчета, 51, 37, 60, 2, "РасшифровкаПрочиеРасходыУч");
		СоздатьРамку(Выборка, "ПрочиеРасходыНЕЕНВД", ОбластьОтчета, 36, 36, 60, 68, "РасшифровкаПрочиеРасходыНЕЕНВД");
		СоздатьРамку(Выборка, "ПрочиеРасходыЕНВД", ОбластьОтчета, 78, 36, 60, 68, "РасшифровкаПрочиеРасходыЕНВД");
		СоздатьРамку(Выборка, "ПрочиеРасходы", ОбластьОтчета, 26, 36, 60, 134, "РасшифровкаПрочиеРасходы");
		СоздатьРамку(Выборка, "ПрочиеРасходыРаспр", ОбластьОтчета, 63, 36, 60, 134, "РасшифровкаПрочиеРасходыРаспр");
		СоздатьРамку(Выборка, "ПрочиеРасходыОС", ОбластьОтчета, 13, 36, 60, 199, "РасшифровкаРасходыТовары");
		СоздатьРамку(Выборка, "ПрочиеРасходыДр", ОбластьОтчета, 51, 36, 60, 199, "РасшифровкаПрочиеРасходыДр");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "СальдоПрочихДоходовИРасходов",,,,,,"ПрибылиИУбыткиЕНВД");                                        
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "СальдоПрочихДоходовИРасходов",,,,,"-","ПрибылиИУбыткиЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", , "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидДеятельностиДляНалоговогоУчетаЗатрат",Распределяются,,,"РасходыПоДеятельностиЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", ,"ПрочиеДоходыИРасходы","ВидДеятельностиДляНалоговогоУчетаЗатрат",ЕНВД,"-");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ПрочиеДоходы", ,"ПрочиеДоходыИРасходы","ВидДеятельностиДляНалоговогоУчетаЗатрат",ЕНВД);
		ОбластьОтчета.Параметры.РасшифровкаПрочиеРасходыЕНВД = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Прочие расходы, отнесенные на ЕНВД (Расходы по видам деятельности, не относящимся к обычным, облагаемым ЕНВД)");
		
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидДеятельностиДляНалоговогоУчетаЗатрат",Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ВидДеятельностиОпределяетсяПоДоходам,,МассивЗапасов2_НДСБУ,МассивЗапасов2НУ,"НЕ ДопСубк","ПринятиеКналоговомуУчету",Истина);
		ОбластьОтчета.Параметры.РасшифровкаПрочиеРасходыРаспр = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Прочие расходы (распределяемые)");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","НЕ ВидПрочихДоходовИРасходов",ВидыПрочейРеализации,,,,"ДопСубк","ПринятиеКналоговомуУчету",Истина);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидПрочихДоходовИРасходов",ВидыПрочейРеализации,,МассивОСБУ,МассивОСНУ,"ДопСубк","ПринятиеКналоговомуУчету",Истина);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "РасходыБудущихПериодов","РасходыБудущихПериодов","РасходыБудущихПериодов","ВидРБП",МассивУбытков,,"ПрибылиИУбыткиБезНалогаНаПрибыль");
		ОбластьОтчета.Параметры.РасшифровкаПрочиеРасходыНеЕНВД = ПереходКРасшифровке(ТаблицаФорматаРасшифровки,"Прочие расходы (НЕ ЕНВД), учитываемые в НУ");
		
	Иначе
		СоздатьРамку(Выборка, "ПрочиеРасходыНе", ОбластьОтчета, 19, 37, 58, 7, "РасшифровкаПрочиеРасходыНе");
		СоздатьРамку(Выборка, "ПрочиеРасходыУч", ОбластьОтчета, 64, 37, 58, 7, "РасшифровкаПрочиеРасходыУч");
		СоздатьРамку(Выборка, "ПрочиеРасходыОС", ОбластьОтчета, 19, 37, 58, 150, "РасшифровкаРасходыТовары");
		СоздатьРамку(Выборка, "ПрочиеРасходыДр", ОбластьОтчета, 64, 37, 58, 150, "РасшифровкаПрочиеРасходыДр");
	КонецЕсли;	
	
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","НЕ ВидПрочихДоходовИРасходов",ВидыПрочейРеализации,,,,"ДопСубк","ПринятиеКналоговомуУчету",Истина);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидДеятельностиДляНалоговогоУчетаЗатрат",Распределяются,,МассивЗапасов2_НДСБУ,МассивЗапасов2НУ,"НЕ ДопСубк","ПринятиеКналоговомуУчету",Истина);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидПрочихДоходовИРасходов",ВидыПрочейРеализации,,МассивОСБУ,МассивОСНУ,"ДопСубк","ПринятиеКналоговомуУчету",Истина);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "РасходыБудущихПериодов","РасходыБудущихПериодов","РасходыБудущихПериодов","ВидРБП",МассивУбытков,,"ПрибылиИУбыткиБезНалогаНаПрибыль");
		
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "СальдоПрочихДоходовИРасходов",,,,,"-","ПрибылиИУбыткиЕНВД");                                        
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "СальдоПрочихДоходовИРасходов",,,,,,"ПрибылиИУбыткиЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", , "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидДеятельностиДляНалоговогоУчетаЗатрат",Распределяются,"-",,"РасходыПоДеятельностиЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", ,"ПрочиеДоходыИРасходы","ВидДеятельностиДляНалоговогоУчетаЗатрат",ЕНВД);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ПрочиеДоходы", ,"ПрочиеДоходыИРасходы","ВидДеятельностиДляНалоговогоУчетаЗатрат",ЕНВД,"-");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидПрочихДоходовИРасходов",Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницыПоРасчетамВУЕ,,"НДС",,"ДопСубк","ПринятиеКналоговомуУчету",Истина);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидПрочихДоходовИРасходов",Перечисления.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате,,"НДС",,"ДопСубк","ПринятиеКналоговомуУчету",Истина);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидПрочихДоходовИРасходов",Перечисления.ВидыПрочихДоходовИРасходов.РасходыПоПередачеТоваровБезвозмездноИДляСобственныхНужд,,"НДС",,"ДопСубк","ПринятиеКналоговомуУчету",Истина);
        ОбластьОтчета.Параметры.РасшифровкаПрочиеРасходыУч = ПереходКРасшифровке(ТаблицаФорматаРасшифровки,"Прочие расходы, учитываемые в НУ");
	
	
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","НЕ ВидПрочихДоходовИРасходов",ВидыПрочейРеализации,,,,"ДопСубк","ПринятиеКналоговомуУчету",Ложь);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидПрочихДоходовИРасходов",Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницыПоРасчетамВУЕ,,"НДС",,"ДопСубк","ПринятиеКналоговомуУчету",Ложь);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидПрочихДоходовИРасходов",Перечисления.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате,,"НДС",,"ДопСубк","ПринятиеКналоговомуУчету",Ложь);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидПрочихДоходовИРасходов",Перечисления.ВидыПрочихДоходовИРасходов.РасходыПоПередачеТоваровБезвозмездноИДляСобственныхНужд,,"НДС",,"ДопСубк","ПринятиеКналоговомуУчету",Ложь);
        ОбластьОтчета.Параметры.РасшифровкаПрочиеРасходыНе = ПереходКРасшифровке(ТаблицаФорматаРасшифровки,"Прочие расходы, не учитываемые в НУ");
		                                                                                                                                                                                                                                                   
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","НЕ ВидПрочихДоходовИРасходов",ВидыПрочейРеализации,,,,"ДопСубк","ВидДеятельностиДляНалоговогоУчетаЗатрат",неЕНВД);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "РасходыБудущихПериодов","РасходыБудущихПериодов","РасходыБудущихПериодов","ВидРБП",МассивУбытков,,"ПрибылиИУбыткиБезНалогаНаПрибыль");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидПрочихДоходовИРасходов",ВидыПрочейРеализации,,МассивОСБУ,МассивОСНУ,"91НЕЕНВДДопСубк","ПринятиеКналоговомуУчету",Истина);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидПрочихДоходовИРасходов",Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницыПоРасчетамВУЕ,,"НДС",,"ДопСубк","ВидДеятельностиДляНалоговогоУчетаЗатрат",неЕНВД);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидПрочихДоходовИРасходов",Перечисления.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате,,"НДС",,"ДопСубк","ВидДеятельностиДляНалоговогоУчетаЗатрат",неЕНВД);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидПрочихДоходовИРасходов",Перечисления.ВидыПрочихДоходовИРасходов.РасходыПоПередачеТоваровБезвозмездноИДляСобственныхНужд,,"НДС",,"ДопСубк","ВидДеятельностиДляНалоговогоУчетаЗатрат",неЕНВД);
        ОбластьОтчета.Параметры.РасшифровкаПрочиеРасходы = ПереходКРасшифровке(ТаблицаФорматаРасшифровки,"Прочие расходы");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();  
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","НЕ ВидПрочихДоходовИРасходов",ВидыПрочейРеализации,,,,"ДопСубк","ВидДеятельностиДляНалоговогоУчетаЗатрат",неЕНВД);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "РасходыБудущихПериодов","РасходыБудущихПериодов","РасходыБудущихПериодов","ВидРБП",МассивУбытков,,"ПрибылиИУбыткиБезНалогаНаПрибыль");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидПрочихДоходовИРасходов",Перечисления.ВидыПрочихДоходовИРасходов.КурсовыеРазницыПоРасчетамВУЕ,,"НДС",,"ДопСубк","ВидДеятельностиДляНалоговогоУчетаЗатрат",неЕНВД);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидПрочихДоходовИРасходов",Перечисления.ВидыПрочихДоходовИРасходов.ШтрафыПениНеустойкиКПолучениюУплате,,"НДС",,"ДопСубк","ВидДеятельностиДляНалоговогоУчетаЗатрат",неЕНВД);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидПрочихДоходовИРасходов",Перечисления.ВидыПрочихДоходовИРасходов.РасходыПоПередачеТоваровБезвозмездноИДляСобственныхНужд,,"НДС",,"ДопСубк","ВидДеятельностиДляНалоговогоУчетаЗатрат",неЕНВД);
		ОбластьОтчета.Параметры.РасшифровкаПрочиеРасходыДр = ПереходКРасшифровке(ТаблицаФорматаРасшифровки,"Другие прочие расходы (кроме реализации амортизируемого и прочего имущества)");
		
		ОбластьОтчета.Параметры.РасшифровкаРасходыТовары = ПереходКСхеме(3);
		
		Если НЕ ПоказыватьКрасныйПрямоугольник Тогда
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки1);
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки2);
		КонецЕсли;
		
		ОбластьШапка.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное + ", " + ПредставлениеПериода(НачалоМесяца(НачалоПериодаТек), КонецМесяца(КонецПериодаТек), "ФП = Истина");
		ОбластьШапка.Параметры.НазваниеОтчета = НазваниеОтчета;
		
		ДокументРезультат.Вывести(ОбластьШапка);
		ДокументРезультат.Вывести(ОбластьОтчета);
		
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = "Анализ состояния налогового учета - " + НазваниеОтчета
	КонецПроцедуры
	
		// Формирует отчет в режиме "Стоимость активов"
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	Процедура  СформироватьСтоимостьЗапасов(ДокументРезультат, НомерТекущейСхемы)
		НазваниеОтчета = "Активы";
		Макет      = ПолучитьМакет("СтоимостьТоваров");
		ОбластьОтчета     = Макет.ПолучитьОбласть("Область");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоПериодаТек",    НачалоПериодаТек);
		Запрос.УстановитьПараметр("КонецПериодаТек",     КонецПериодаТек);
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Запрос.УстановитьПараметр("СчетаТранспортныхРасходовХозрасчетный", ПланыСчетов.Хозрасчетный.ИздержкиОбращения);
		
		Запрос.УстановитьПараметр("СчетаХозрасчетный", МассивЗапасовБУ);
		Запрос.УстановитьПараметр("СчетаРасчетовХозрасчетный", МассивРасчетовБУ);
		Запрос.УстановитьПараметр("СчетаОСХозрасчетный", МассивОСБУ);
		Запрос.УстановитьПараметр("СчетаВыпускаХозрасчетный", МассивПрямых);
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ВложенныйЗапрос2.Организация,
		|	СУММА(ВложенныйЗапрос2.СтоимостьДтБУ) КАК СтоимостьДтБУ,
		|	СУММА(ВложенныйЗапрос2.СтоимостьДтНУ) КАК СтоимостьДтНУ,
		|	СУММА(ВложенныйЗапрос2.СтоимостьДтПР) КАК СтоимостьДтПР,
		|	СУММА(ВложенныйЗапрос2.СтоимостьДтВР) КАК СтоимостьДтВР,
		|	СУММА(ВложенныйЗапрос2.СтоимостьВыпускаБУ) КАК СтоимостьВыпускаБУ,
		|	СУММА(ВложенныйЗапрос2.СтоимостьВыпускаНУ) КАК СтоимостьВыпускаНУ,
		|	СУММА(ВложенныйЗапрос2.СтоимостьВыпускаПР) КАК СтоимостьВыпускаПР,
		|	СУММА(ВложенныйЗапрос2.СтоимостьВыпускаВР) КАК СтоимостьВыпускаВР,
		|	СУММА(ВложенныйЗапрос2.СтоимостьИзлишковБУ) КАК СтоимостьИзлишковБУ,
		|	СУММА(ВложенныйЗапрос2.СтоимостьИзлишковНУ) КАК СтоимостьИзлишковНУ,
		|	СУММА(ВложенныйЗапрос2.СтоимостьИзлишковПР) КАК СтоимостьИзлишковПР,
		|	СУММА(ВложенныйЗапрос2.СтоимостьИзлишковВР) КАК СтоимостьИзлишковВР,
		|	СУММА(ВложенныйЗапрос2.СтоимостьНачБУ) КАК СтоимостьНачБУ,
		|	СУММА(ВложенныйЗапрос2.СтоимостьНачНУ) КАК СтоимостьНачНУ,
		|	СУММА(ВложенныйЗапрос2.СтоимостьНачПР) КАК СтоимостьНачПР,
		|	СУММА(ВложенныйЗапрос2.СтоимостьНачВР) КАК СтоимостьНачВР,
		|	СУММА(ВложенныйЗапрос2.СтоимостьВыпускаБУ + ВложенныйЗапрос2.СтоимостьИзлишковБУ + ВложенныйЗапрос2.СтоимостьДтБУ + ВложенныйЗапрос2.СтоимостьНачБУ) КАК СтоимостьБУ,
		|	СУММА(ВложенныйЗапрос2.СтоимостьВыпускаНУ + ВложенныйЗапрос2.СтоимостьИзлишковНУ + ВложенныйЗапрос2.СтоимостьДтНУ + ВложенныйЗапрос2.СтоимостьНачНУ) КАК СтоимостьНУ,
		|	СУММА(ВложенныйЗапрос2.СтоимостьВыпускаПР + ВложенныйЗапрос2.СтоимостьИзлишковПР + ВложенныйЗапрос2.СтоимостьДтПР + ВложенныйЗапрос2.СтоимостьНачПР) КАК СтоимостьПР,
		|	СУММА(ВложенныйЗапрос2.СтоимостьВыпускаВР + ВложенныйЗапрос2.СтоимостьИзлишковВР + ВложенныйЗапрос2.СтоимостьДтВР + ВложенныйЗапрос2.СтоимостьНачВР) КАК СтоимостьВР
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Организация КАК Организация,
		|		СУММА(ВложенныйЗапрос.СтоимостьДтБУ) КАК СтоимостьДтБУ,
		|		СУММА(ВложенныйЗапрос.СтоимостьДтНУ) КАК СтоимостьДтНУ,
		|		СУММА(ВложенныйЗапрос.СтоимостьДтПР) КАК СтоимостьДтПР,
		|		СУММА(ВложенныйЗапрос.СтоимостьДтВР) КАК СтоимостьДтВР,
		|		СУММА(ВложенныйЗапрос.СтоимостьВыпускаБУ) КАК СтоимостьВыпускаБУ,
		|		СУММА(ВложенныйЗапрос.СтоимостьВыпускаНУ) КАК СтоимостьВыпускаНУ,
		|		СУММА(ВложенныйЗапрос.СтоимостьВыпускаПР) КАК СтоимостьВыпускаПР,
		|		СУММА(ВложенныйЗапрос.СтоимостьВыпускаВР) КАК СтоимостьВыпускаВР,
		|		СУММА(ВложенныйЗапрос.СтоимостьИзлишковБУ) КАК СтоимостьИзлишковБУ,
		|		СУММА(ВложенныйЗапрос.СтоимостьИзлишковНУ) КАК СтоимостьИзлишковНУ,
		|		СУММА(ВложенныйЗапрос.СтоимостьИзлишковПР) КАК СтоимостьИзлишковПР,
		|		СУММА(ВложенныйЗапрос.СтоимостьИзлишковВР) КАК СтоимостьИзлишковВР,
		|		СУММА(ВложенныйЗапрос.СтоимостьНачБУ) КАК СтоимостьНачБУ,
		|		СУММА(ВложенныйЗапрос.СтоимостьНачНУ) КАК СтоимостьНачНУ,
		|		СУММА(ВложенныйЗапрос.СтоимостьНачПР) КАК СтоимостьНачПР,
		|		СУММА(ВложенныйЗапрос.СтоимостьНачВР) КАК СтоимостьНачВР
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ХозрасчетныйОстаткиИОбороты.Организация КАК Организация,
		|			ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК СтоимостьНачБУ,
		|			ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстаток КАК СтоимостьНачНУ,
		|			ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстаток КАК СтоимостьНачПР,
		|			ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстаток КАК СтоимостьНачВР,
		|			0 КАК СтоимостьДтБУ,
		|			0 КАК СтоимостьДтНУ,
		|			0 КАК СтоимостьДтПР,
		|			0 КАК СтоимостьДтВР,
		|			0 КАК СтоимостьВыпускаБУ,
		|			0 КАК СтоимостьВыпускаНУ,
		|			0 КАК СтоимостьВыпускаПР,
		|			0 КАК СтоимостьВыпускаВР,
		|			0 КАК СтоимостьИзлишковБУ,
		|			0 КАК СтоимостьИзлишковНУ,
		|			0 КАК СтоимостьИзлишковПР,
		|			0 КАК СтоимостьИзлишковВР
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						ИЛИ Счет В ИЕРАРХИИ (&СчетаОСХозрасчетный),
		|					,
		|					Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаРасчетовХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаРасчетовХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаРасчетовХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаРасчетовХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаВыпускаХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаВыпускаХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаВыпускаХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаВыпускаХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаРасчетовХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаВыпускаХозрасчетный))
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаРасчетовХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаВыпускаХозрасчетный))
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаРасчетовХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаВыпускаХозрасчетный))
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаРасчетовХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаВыпускаХозрасчетный))
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						ИЛИ Счет В ИЕРАРХИИ (&СчетаОСХозрасчетный),
		|					,
		|					Организация = &Организация,
		|					(НЕ КорСчет В ИЕРАРХИИ (&СчетаХозрасчетный))
		|						И (НЕ КорСчет В ИЕРАРХИИ (&СчетаОСХозрасчетный)),
		|					) КАК ХозрасчетныйОбороты) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Организация) КАК ВложенныйЗапрос2
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос2.Организация";
		
		Если НомерТекущейСхемы > 20 Тогда
			Запрос.УстановитьПараметр("Организация", СвойстваОрганизации.СписокОП);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		КонецЕсли;
		
		Результат = Запрос.Выполнить();
		
		Если НомерТекущейСхемы > 20 Тогда
			СформироватьТаблицуОрганизаций(ДокументРезультат,Результат.Выгрузить(),"Стоимость",9, НазваниеОтчета);
			Возврат;
		КонецЕсли;
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОбластьОтчета.Параметры.Заполнить(Выборка);
		
		СоздатьРамку(Выборка, "Стоимость", ОбластьОтчета, 14, 108, 60, 5, "РасшифровкаРасходыТовары");
		СоздатьРамку(Выборка, "СтоимостьДт", ОбластьОтчета, 14, 36, 59, 81, "РасшифровкаСтоимостьДт");
		СоздатьРамку(Выборка, "СтоимостьНач", ОбластьОтчета, 86, 36, 59, 81, "РасшифровкаСтоимостьНач");
		СоздатьРамку(Выборка, "СтоимостьВыпуска", ОбластьОтчета, 32, 36, 58, 150, "РасшифровкаСтоимостьВыпуска");
		СоздатьРамку(Выборка, "СтоимостьИзлишков", ОбластьОтчета, 70, 36, 58, 150, "РасшифровкаСтоимостьИзлишков");
		
		 // Обращение к счетам сделано не через массивы, для того чтобы детилизировать аналитику
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ОСвОрганизации","ОСвОрганизации","ОсновныеСредства",,,,МассивРасчетовБУ,МассивРасчетовНУ, "");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ДоходныеВложенияВ_МЦ","ДоходныеВложенияВ_МЦ","ОсновныеСредства",,,,МассивРасчетовБУ,МассивРасчетовНУ, "");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "НематериальныеАктивы","НематериальныеАктивы","НематериальныеАктивы",,,,МассивРасчетовБУ,МассивРасчетовНУ, "");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ОборудованиеКУстановке","ОборудованиеКУстановке","Номенклатура",,,,МассивРасчетовБУ,МассивРасчетовНУ, "");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ВложенияВоВнеоборотныеАктивы","ВложенияВоВнеоборотныеАктивы",,,,,МассивРасчетовБУ,МассивРасчетовНУ, "");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "Материалы","Материалы","Номенклатура",,,,МассивРасчетовБУ,МассивРасчетовНУ, "");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "Полуфабрикаты","Полуфабрикаты","Номенклатура",,,,МассивРасчетовБУ,МассивРасчетовНУ, "");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "Товары","Товары","Номенклатура",,,,МассивРасчетовБУ,МассивРасчетовНУ, "");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ТоварыОтгруженные","ТоварыОтгруженные","Номенклатура",,,,МассивРасчетовБУ,МассивРасчетовНУ, "");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ГотоваяПродукция","ГотоваяПродукция","Номенклатура",,,,МассивРасчетовБУ,МассивРасчетовНУ, "");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", МассивРБПБУ,МассивРБПНУ,"РасходыБудущихПериодов",,,,МассивРасчетовБУ,МассивРасчетовНУ, "");
		ОбластьОтчета.Параметры.РасшифровкаСтоимостьДт = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Расходы на приобретение товаров, амортизируемого имущества, РБП у сторонних организаций");
		
	    Массив1 = Новый Массив;
		Массив1.Добавить(ПланыСчетов.Хозрасчетный.ОсновныеСредства);
		Массив1.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОС_01);
		Массив1.Добавить(ПланыСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости);
		
	    Массив2 = Новый Массив;
		Массив2.Добавить(ПланыСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ);
		Массив2.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОС_03);
		
	    Массив3 = Новый Массив;
		Массив3.Добавить(ПланыСчетов.Хозрасчетный.НематериальныеАктивы);
		Массив3.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов);
		
	    Массив1НУ = Новый Массив;
		Массив1НУ.Добавить(ПланыСчетов.Хозрасчетный.ОсновныеСредства);
		Массив1НУ.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОС_01);
		Массив1НУ.Добавить(ПланыСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости);
		
	    Массив2НУ = Новый Массив;
		Массив2НУ.Добавить(ПланыСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ);
		Массив2НУ.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОС_03);
		
	    Массив3НУ = Новый Массив;
		Массив3НУ.Добавить(ПланыСчетов.Хозрасчетный.НематериальныеАктивы);
		Массив3НУ.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов);

		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", Массив1,Массив1НУ,"ОсновныеСредства");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", Массив2,Массив2НУ,"ОсновныеСредства");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", Массив3,Массив3НУ,"НематериальныеАктивы");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", "ОборудованиеКУстановке","ОборудованиеКУстановке","Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", "ВложенияВоВнеоборотныеАктивы","ВложенияВоВнеоборотныеАктивы");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", "Материалы","Материалы","Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", "Полуфабрикаты","Полуфабрикаты","Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", "ТоварыНаСкладах","ТоварыНаСкладах","Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН",  МассивРозницы,"ТоварыВРозничнойТорговле","Склады");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", "ТараПодТоваромИПорожняя","ТараПодТоваромИПорожняя","Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", "ПокупныеИзделия","ПокупныеИзделия","Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", "ТоварыОтгруженные","ТоварыОтгруженные","Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", "ГотоваяПродукция","ГотоваяПродукция","Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СН", МассивРБПБУ,МассивРБПНУ,"РасходыБудущихПериодов");
		ОбластьОтчета.Параметры.РасшифровкаСтоимостьНач = ПереходКРасшифровке(ТаблицаФорматаРасшифровки,"Стоимость несписанных в предыдущем периоде товаров, амортизируемого имущества, РБП", Ложь);
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", МассивЗапасовБУ,МассивЗапасовНУ,"Номенклатура",,,,МассивПрямых,МассивПрямыхНУ);
		ОбластьОтчета.Параметры.РасшифровкаСтоимостьВыпуска = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Стоимость выпущенной продукции");
		
		МассивБУ = Новый Массив;
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоКраткосрочнымКредитамИЗаймам);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоДолгосрочнымКредитамИЗаймам);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами_);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПерсоналомПоПрочимОперациям);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРазнымиДебиторамиИКредиторами);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.Касса);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.РасчетныеСчета);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ВалютныеСчета);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство_);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ОсновныеСредства);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.НематериальныеАктивы);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОсновныхСредств);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ОборудованиеКУстановке);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.Материалы);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.Полуфабрикаты);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыНаСкладах);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговле);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ТараПодТоваромИПорожняя);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ПокупныеИзделия);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыОтгруженные);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.РасходыБудущихПериодов);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников);
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ОСвОрганизации","ОСвОрганизации","ОсновныеСредства",,,,МассивБУ,МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ДоходныеВложенияВ_МЦ","ДоходныеВложенияВ_МЦ","ОсновныеСредства",,,,МассивБУ,МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "АмортизацияОсновныхСредств","АмортизацияОсновныхСредств",,,,,МассивБУ,МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "НематериальныеАктивы","НематериальныеАктивы","НематериальныеАктивы",,,,МассивБУ,МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "АмортизацияНематериальныхАктивов","АмортизацияНематериальныхАктивов",,,,,МассивБУ,МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ВложенияВоВнеоборотныеАктивы","ВложенияВоВнеоборотныеАктивы",,,,,МассивБУ,МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "Материалы","Материалы","Номенклатура",,,,МассивБУ,МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "Полуфабрикаты","Полуфабрикаты","Номенклатура",,,,МассивБУ,МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ТоварыНаСкладах","ТоварыНаСкладах","Номенклатура",,,,МассивБУ,МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ТоварыВРозничнойТорговле","ТоварыВРозничнойТорговле",,,,,МассивБУ,МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ТараПодТоваромИПорожняя","ТараПодТоваромИПорожняя",,,,,МассивБУ,МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПокупныеИзделия","ПокупныеИзделия",,,,,МассивБУ,МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ТоварыОтгруженные","ТоварыОтгруженные",,,,,МассивБУ,МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ГотоваяПродукция","ГотоваяПродукция","Номенклатура",,,,МассивБУ,МассивБУ,"НЕ ");
		ОбластьОтчета.Параметры.РасшифровкаСтоимостьИзлишков = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Оприходование излишков и др.");
		
		ОбластьОтчета.Параметры.РасшифровкаРасходыТовары         = ПереходКСхеме(3);
		
		Если НЕ ПоказыватьКрасныйПрямоугольник Тогда
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки1);
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки2);
		КонецЕсли;
		
		ОбластьШапка.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное + ", " + ПредставлениеПериода(НачалоМесяца(НачалоПериодаТек), КонецМесяца(КонецПериодаТек), "ФП = Истина");
		ОбластьШапка.Параметры.НазваниеОтчета = НазваниеОтчета;
		ДокументРезультат.Вывести(ОбластьШапка);
		ДокументРезультат.Вывести(ОбластьОтчета);
		
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = "Анализ состояния налогового учета - " + НазваниеОтчета;
	КонецПроцедуры

	// Формирует отчет в режиме "Расходы распределяемые"
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	Процедура СформироватьРаспределяемыеРасходы(ДокументРезультат, НомерТекущейСхемы)
		
		НазваниеОтчета = "Распределяемые расходы";	
		Макет      = ПолучитьМакет("РасходыРаспределяемые");
		ОбластьОтчета     = Макет.ПолучитьОбласть("Область");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоПериодаТек",     НачалоДня(НачалоПериодаТек));
		Запрос.УстановитьПараметр("КонецПериодаТек",     КонецДня(КонецПериодаТек));
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Запрос.УстановитьПараметр("СчетаПрямыхРасходовХозрасчетный", МассивПрямых);
		Запрос.УстановитьПараметр("СчетаРасходовХозрасчетный", МассивВсехЗатрат);
		Запрос.УстановитьПараметр("СчетаКосвенныхРасходовХозрасчетный", МассивКосвенных);
		
		МассивРасходовБУ = Новый Массив;
		МассивРасходовБУ.Добавить(ПланыСчетов.Хозрасчетный.Продажи_РасходыНаПродажу);
		МассивРасходовБУ.Добавить(ПланыСчетов.Хозрасчетный.Продажи_УправленческиеРасходы);
		Запрос.УстановитьПараметр("СчетаТекущихРасходовХозрасчетный", МассивРасходовБУ);
		
		МассивРасходовБУНеЕНВД = Новый Массив;
		МассивРасходовБУНеЕНВД.Добавить(Счет90_7);
		МассивРасходовБУНеЕНВД.Добавить(Счет90_8);
		Запрос.УстановитьПараметр("СчетРасходовНеЕНВДХозрасчетный", МассивРасходовБУНеЕНВД);
		
		МассивРасходовБУЕНВД = Новый Массив;
		МассивРасходовБУЕНВД.Добавить(Счет90_7ЕНВД);
		МассивРасходовБУЕНВД.Добавить(Счет90_8ЕНВД);
		Запрос.УстановитьПараметр("СчетРасходовЕНВДХозрасчетный", МассивРасходовБУЕНВД);
		
		МассивОПРОХРНУ = Новый Массив;
		МассивОПРОХРНУ.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
		МассивОПРОХРНУ.Добавить(ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы);
		Запрос.УстановитьПараметр("СчетаОПРОХРХозрасчетный", МассивОПРОХРНУ);
		
		Запрос.УстановитьПараметр("Распределяются",         Распределяются);
		
	    НоменклатурныеГруппыЕНВД =  ПолучитьСписокНоменклатурныхГруппЕНВД();
		Запрос.УстановитьПараметр("НоменклатурныеГруппыЕНВД", НоменклатурныеГруппыЕНВД);
		
		Запрос.УстановитьПараметр("ТранспортныеРасходы",    Перечисления.ВидыРасходовНУ.ТранспортныеРасходы);
		Запрос.УстановитьПараметр("СтатьиЗатрат", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
		Запрос.УстановитьПараметр("НоменклатурныеГруппы", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ВложенныйЗапрос2.Организация,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходы20БУ + ВложенныйЗапрос2.РаспределяемыеРасходы90БУ + ВложенныйЗапрос2.РаспределяемыеРасходыЕНВДБУ) КАК РаспределяемыеРасходыБУ,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходы20НУ + ВложенныйЗапрос2.РаспределяемыеРасходы90НУ + ВложенныйЗапрос2.РаспределяемыеРасходыЕНВДНУ) КАК РаспределяемыеРасходыНУ,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходы20ПР + ВложенныйЗапрос2.РаспределяемыеРасходы90ПР + ВложенныйЗапрос2.РаспределяемыеРасходыЕНВДПР) КАК РаспределяемыеРасходыПР,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходы20ВР + ВложенныйЗапрос2.РаспределяемыеРасходы90ВР + ВложенныйЗапрос2.РаспределяемыеРасходыЕНВДВР) КАК РаспределяемыеРасходыВР,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходы20БУ) КАК РаспределяемыеРасходы20БУ,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходы20НУ) КАК РаспределяемыеРасходы20НУ,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходы20ПР) КАК РаспределяемыеРасходы20ПР,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходы20ВР) КАК РаспределяемыеРасходы20ВР,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходы90БУ) КАК РаспределяемыеРасходы90БУ,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходы90НУ) КАК РаспределяемыеРасходы90НУ,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходы90ПР) КАК РаспределяемыеРасходы90ПР,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходы90ВР) КАК РаспределяемыеРасходы90ВР,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходыЕНВДБУ) КАК РаспределяемыеРасходыЕНВДБУ,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходыЕНВДНУ) КАК РаспределяемыеРасходыЕНВДНУ,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходыЕНВДПР) КАК РаспределяемыеРасходыЕНВДПР,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходыЕНВДВР) КАК РаспределяемыеРасходыЕНВДВР,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходы20БУ + ВложенныйЗапрос2.РаспределяемыеРасходы90БУ) КАК РаспределяемыеРасходыНеЕНВДБУ,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходы20НУ + ВложенныйЗапрос2.РаспределяемыеРасходы90НУ) КАК РаспределяемыеРасходыНеЕНВДНУ,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходы20ПР + ВложенныйЗапрос2.РаспределяемыеРасходы90ПР) КАК РаспределяемыеРасходыНеЕНВДПР,
		|	СУММА(ВложенныйЗапрос2.РаспределяемыеРасходы20ВР + ВложенныйЗапрос2.РаспределяемыеРасходы90ВР) КАК РаспределяемыеРасходыНеЕНВДВР
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Организация КАК Организация,
		|		СУММА(ВложенныйЗапрос.РаспределяемыеРасходы20БУ) КАК РаспределяемыеРасходы20БУ,
		|		СУММА(ВложенныйЗапрос.РаспределяемыеРасходы20НУ) КАК РаспределяемыеРасходы20НУ,
		|		СУММА(ВложенныйЗапрос.РаспределяемыеРасходы20ПР) КАК РаспределяемыеРасходы20ПР,
		|		СУММА(ВложенныйЗапрос.РаспределяемыеРасходы20ВР) КАК РаспределяемыеРасходы20ВР,
		|		СУММА(ВложенныйЗапрос.РаспределяемыеРасходы90БУ) КАК РаспределяемыеРасходы90БУ,
		|		СУММА(ВложенныйЗапрос.РаспределяемыеРасходы90НУ) КАК РаспределяемыеРасходы90НУ,
		|		СУММА(ВложенныйЗапрос.РаспределяемыеРасходы90ПР) КАК РаспределяемыеРасходы90ПР,
		|		СУММА(ВложенныйЗапрос.РаспределяемыеРасходы90ВР) КАК РаспределяемыеРасходы90ВР,
		|		СУММА(ВложенныйЗапрос.РаспределяемыеРасходыЕНВДБУ) КАК РаспределяемыеРасходыЕНВДБУ,
		|		СУММА(ВложенныйЗапрос.РаспределяемыеРасходыЕНВДНУ) КАК РаспределяемыеРасходыЕНВДНУ,
		|		СУММА(ВложенныйЗапрос.РаспределяемыеРасходыЕНВДПР) КАК РаспределяемыеРасходыЕНВДПР,
		|		СУММА(ВложенныйЗапрос.РаспределяемыеРасходыЕНВДВР) КАК РаспределяемыеРасходыЕНВДВР
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация КАК Организация,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1 В (&НоменклатурныеГруппыЕНВД))
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК РаспределяемыеРасходы20БУ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1 В (&НоменклатурныеГруппыЕНВД))
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК РаспределяемыеРасходы20НУ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1 В (&НоменклатурныеГруппыЕНВД))
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК РаспределяемыеРасходы20ПР,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1 В (&НоменклатурныеГруппыЕНВД))
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК РаспределяемыеРасходы20ВР,
		|			0 КАК РаспределяемыеРасходы90БУ,
		|			0 КАК РаспределяемыеРасходы90НУ,
		|			0 КАК РаспределяемыеРасходы90ПР,
		|			0 КАК РаспределяемыеРасходы90ВР,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСубконто1 В (&НоменклатурныеГруппыЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК РаспределяемыеРасходыЕНВДБУ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСубконто1 В (&НоменклатурныеГруппыЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК РаспределяемыеРасходыЕНВДНУ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСубконто1 В (&НоменклатурныеГруппыЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК РаспределяемыеРасходыЕНВДПР,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСубконто1 В (&НоменклатурныеГруппыЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК РаспределяемыеРасходыЕНВДВР
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаКосвенныхРасходовХозрасчетный),
		|					&СтатьиЗатрат,
		|					Организация = &Организация
		|						И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &Распределяются
		|						И (НЕ Субконто1.ВидРасходовНУ = &ТранспортныеРасходы),
		|					КорСЧет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный),
		|					&НоменклатурныеГруппы) КАК ХозрасчетныйОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетРасходовНеЕНВДХозрасчетный)
		|						И (НЕ ХозрасчетныйОбороты.КорСубконто1 В (&НоменклатурныеГруппыЕНВД))
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетРасходовНеЕНВДХозрасчетный)
		|						И (НЕ ХозрасчетныйОбороты.КорСубконто1 В (&НоменклатурныеГруппыЕНВД))
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетРасходовНеЕНВДХозрасчетный)
		|						И (НЕ ХозрасчетныйОбороты.КорСубконто1 В (&НоменклатурныеГруппыЕНВД))
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетРасходовНеЕНВДХозрасчетный)
		|						И (НЕ ХозрасчетныйОбороты.КорСубконто1 В (&НоменклатурныеГруппыЕНВД))
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетРасходовЕНВДХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетРасходовЕНВДХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетРасходовЕНВДХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетРасходовЕНВДХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаРасходовХозрасчетный),
		|					&СтатьиЗатрат,
		|					Организация = &Организация
		|						И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &Распределяются
		|						И (НЕ Субконто1.ВидРасходовНУ = &ТранспортныеРасходы),
		|					КорСЧет В ИЕРАРХИИ (&СчетаТекущихРасходовХозрасчетный),
		|					&НоменклатурныеГруппы) КАК ХозрасчетныйОбороты) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Организация) КАК ВложенныйЗапрос2
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос2.Организация";
		
		
		Если НоменклатурныеГруппыЕНВД.Количество() = 0 Тогда
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "КОГДА КорСубконто1 В (&НоменклатурныеГруппыЕНВД)", "КОГДА &ЛОЖЬ");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И КорСубконто1 В (&НоменклатурныеГруппыЕНВД)", "И &ЛОЖЬ");
		    Запрос.УстановитьПараметр("Ложь",        Ложь);
		КонецЕсли;
	
		
		
		Если НомерТекущейСхемы > 20 Тогда
			Запрос.УстановитьПараметр("Организация", СвойстваОрганизации.СписокОП);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		КонецЕсли;
		
		Результат = Запрос.Выполнить();
		
		Если НомерТекущейСхемы > 20 Тогда
			СформироватьТаблицуОрганизаций(ДокументРезультат,Результат.Выгрузить(),"РаспределяемыеРасходы",8,НазваниеОтчета);
			Возврат;
		КонецЕсли;
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОбластьОтчета.Параметры.Заполнить(Выборка);
		
		СоздатьРамку(Выборка, "РаспределяемыеРасходы20", ОбластьОтчета, 13, 37, 59, 3, "РасшифровкаРаспределяемыеРасходы20");	
		СоздатьРамку(Выборка, "РаспределяемыеРасходы90", ОбластьОтчета, 51, 36, 59, 3, "РасшифровкаРаспределяемыеРасходы90");	
		СоздатьРамку(Выборка, "РаспределяемыеРасходыНеЕНВД", ОбластьОтчета, 36, 36, 59, 73, "РасшифровкаРаспределяемыеРасходыНеЕНВД");	
		СоздатьРамку(Выборка, "РаспределяемыеРасходыЕНВД", ОбластьОтчета, 73, 36, 59, 73, "РасшифровкаРаспределяемыеРасходыЕНВД");
		СоздатьРамку(Выборка, "РаспределяемыеРасходы", ОбластьОтчета, 55, 37, 59, 141, "РасшифровкаРаспределяемыеРасходы");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО-ДО", МассивКосвенных,МассивОПРОХРНУ,"СтатьиЗатрат","ВидДеятельностиДляНалоговогоУчетаЗатрат","РасходыРаспределяются","НЕЕНВД",МассивПрямых,МассивПрямыхНУ);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КосвенныеВР", МассивКосвенных,МассивКосвенных,"СтатьиЗатрат","ВидДеятельностиДляНалоговогоУчетаЗатрат",Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ВидДеятельностиОпределяетсяПоДоходам,,МассивПрямых,МассивПрямыхНУ);
		ОбластьОтчета.Параметры.РасшифровкаРаспределяемыеРасходы20 = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Общепроизводственные и общехозяйственные расходы, списанные на прямые расходы (распределяемые)");

		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", МассивВсехЗатрат, МассивВсехЗатратНУ,"СтатьиЗатрат","ВидДеятельностиДляНалоговогоУчетаЗатрат","РасходыРаспределяются","НЕЕНВД",МассивРасходовБУНеЕНВД,МассивРасходовБУНеЕНВД);
		ОбластьОтчета.Параметры.РасшифровкаРаспределяемыеРасходы90 = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Косвенные распределяемые расходы, учитываемые в НУ");
		
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО-ДО", МассивКосвенных,МассивОПРОХРНУ,"СтатьиЗатрат","ВидДеятельностиДляНалоговогоУчетаЗатрат","РасходыРаспределяются","НЕЕНВД",МассивПрямых,МассивПрямыхНУ);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КосвенныеВР", МассивКосвенных,МассивКосвенных,"СтатьиЗатрат","ВидДеятельностиДляНалоговогоУчетаЗатрат",Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ВидДеятельностиОпределяетсяПоДоходам,"НЕЕНВД",МассивПрямых,МассивПрямыхНУ);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", МассивВсехЗатрат, МассивВсехЗатратНУ,"СтатьиЗатрат","ВидДеятельностиДляНалоговогоУчетаЗатрат","РасходыРаспределяются","НЕЕНВД",МассивРасходовБУНеЕНВД,МассивРасходовБУНеЕНВД);
		ОбластьОтчета.Параметры.РасшифровкаРаспределяемыеРасходыНеЕНВД = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Косвенные распределяемые расходы, отнесенные к деятельности, не облагаемой ЕНВД");
		
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", МассивВсехЗатрат, МассивВсехЗатратНУ,"СтатьиЗатрат","ВидДеятельностиДляНалоговогоУчетаЗатрат","РасходыРаспределяются",,МассивРасходовБУЕНВД,МассивРасходовБУЕНВД);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", МассивКосвенных,МассивОПРОХРНУ,"СтатьиЗатрат","ВидДеятельностиДляНалоговогоУчетаЗатрат","РасходыРаспределяются","ЕНВД",МассивПрямых,МассивПрямыхНУ);
		ОбластьОтчета.Параметры.РасшифровкаРаспределяемыеРасходыЕНВД = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Косвенные распределяемые расходы, отнесенные к деятельности, облагаемой ЕНВД");
		
		
		ОбластьОтчета.Параметры.РасшифровкаРаспределяемыеРасходы = ПереходКСхеме(10);
		
		Если НЕ ПоказыватьКрасныйПрямоугольник Тогда
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки1);
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки2);
		КонецЕсли;
		
		ОбластьШапка.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное + ", " + ПредставлениеПериода(НачалоМесяца(НачалоПериодаТек), КонецМесяца(КонецПериодаТек), "ФП = Истина");
		ОбластьШапка.Параметры.НазваниеОтчета = НазваниеОтчета;
		ДокументРезультат.Вывести(ОбластьШапка);
		ДокументРезультат.Вывести(ОбластьОтчета);
		
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = "Анализ состояния налогового учета - " + НазваниеОтчета;
	КонецПроцедуры

	// Формирует отчет в режиме "Производство"
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	Процедура СформироватьРасходыПроизводства(ДокументРезультат, НомерТекущейСхемы)
		 НазваниеОтчета = "Расходы производства";
	
		Макет      = ПолучитьМакет("РасходыПроизводства" + ?(ЭтоЕНВД,"ЕНВД",""));
		ОбластьОтчета     = Макет.ПолучитьОбласть("Область");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоПериодаТек",     НачалоДня(НачалоПериодаТек));
		Запрос.УстановитьПараметр("КонецПериодаТек",     КонецДня(КонецПериодаТек));
		Запрос.УстановитьПараметр("КонецПериодаТек2",    НачалоДня(КонецДня(КонецПериодаТек)+2));
		Запрос.УстановитьПараметр("НачалоПериодаТек2",    КонецДня(НачалоДня(НачалоПериодаТек)-2));
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Запрос.УстановитьПараметр("СчетаУчетаУслугНеЕНВДХозрасчетный", Счет90_2);
		Запрос.УстановитьПараметр("Счет40Хозрасчетный", ПланыСчетов.Хозрасчетный.ВыпускПродукции);
		Запрос.УстановитьПараметр("СчетаУчетаАктивовХозрасчетный", МассивЗапасовБУ);
		Запрос.УстановитьПараметр("СчетаПрямыхЗатратХозрасчетный", МассивПрямых);
		Запрос.УстановитьПараметр("СчетаКосвенныхРасходовХозрасчетный", МассивКосвенных);
		Запрос.УстановитьПараметр("СчетаДавальческихЗатратХозрасчетный", ПланыСчетов.Хозрасчетный.ПроизводствоИзДавальческогоСырья);
		
		МассивОПРОХРНУ = Новый Массив;
		МассивОПРОХРНУ.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
		МассивОПРОХРНУ.Добавить(ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы);
		
		Запрос.УстановитьПараметр("СчетаОПРОХРХозрасчетный", МассивОПРОХРНУ);
		
		Запрос.УстановитьПараметр("НеЕНВД",         НеЕНВД);
		Запрос.УстановитьПараметр("Распределяются", Распределяются);
		 
		Запрос.УстановитьПараметр("НоменклатурныеГруппыЕНВД",   НоменклатурныеГруппыЕНВД);
		
		Запрос.УстановитьПараметр("НоменклатурныеГруппы", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
		Запрос.УстановитьПараметр("СтатьиЗатрат", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
		
		Запрос.УстановитьПараметр("ТранспортныеРасходы", Перечисления.ВидыРасходовНУ.ТранспортныеРасходы);
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ВложенныйЗапрос2.Организация,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыВыпускБУ) КАК ПрямыеРасходыВыпускБУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыВыпускНУ) КАК ПрямыеРасходыВыпускНУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыВыпускПР) КАК ПрямыеРасходыВыпускПР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыВыпускВР) КАК ПрямыеРасходыВыпускВР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыУслугиБУ) КАК ПрямыеРасходыУслугиБУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыУслугиНУ) КАК ПрямыеРасходыУслугиНУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыУслугиПР) КАК ПрямыеРасходыУслугиПР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыУслугиВР) КАК ПрямыеРасходыУслугиВР,
		|	СУММА(ВложенныйЗапрос2.ОХРБУ) КАК ОХРБУ,
		|	СУММА(ВложенныйЗапрос2.ОХРНУ) КАК ОХРНУ,
		|	СУММА(ВложенныйЗапрос2.ОХРПР) КАК ОХРПР,
		|	СУММА(ВложенныйЗапрос2.ОХРВР) КАК ОХРВР,
		|	СУММА(ВложенныйЗапрос2.ОХРРаспрБУ) КАК ОХРРаспрБУ,
		|	СУММА(ВложенныйЗапрос2.ОХРРаспрНУ) КАК ОХРРаспрНУ,
		|	СУММА(ВложенныйЗапрос2.ОХРРаспрПР) КАК ОХРРаспрПР,
		|	СУММА(ВложенныйЗапрос2.ОХРРаспрВР) КАК ОХРРаспрВР,
		|	СУММА(ВложенныйЗапрос2.НЗПБУ) КАК НЗПБУ,
		|	СУММА(ВложенныйЗапрос2.НЗПНУ) КАК НЗПНУ,
		|	СУММА(ВложенныйЗапрос2.НЗППР) КАК НЗППР,
		|	СУММА(ВложенныйЗапрос2.НЗПВР) КАК НЗПВР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыВыпускБУ + ВложенныйЗапрос2.ПрямыеРасходыУслугиБУ + ВложенныйЗапрос2.НЗПБУ) КАК ПрямыеРасходыБУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыВыпускНУ + ВложенныйЗапрос2.ПрямыеРасходыУслугиНУ + ВложенныйЗапрос2.НЗПНУ) КАК ПрямыеРасходыНУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыВыпускПР + ВложенныйЗапрос2.ПрямыеРасходыУслугиПР + ВложенныйЗапрос2.НЗППР) КАК ПрямыеРасходыПР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыВыпускВР + ВложенныйЗапрос2.ПрямыеРасходыУслугиВР + ВложенныйЗапрос2.НЗПВР) КАК ПрямыеРасходыВР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыВыпускБУ + ВложенныйЗапрос2.ПрямыеРасходыУслугиБУ + ВложенныйЗапрос2.НЗПБУ - ВложенныйЗапрос2.ОХРБУ - ВложенныйЗапрос2.ОХРРаспрБУ) КАК ПроизводствоБУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыВыпускНУ + ВложенныйЗапрос2.ПрямыеРасходыУслугиНУ + ВложенныйЗапрос2.НЗПНУ - ВложенныйЗапрос2.ОХРНУ - ВложенныйЗапрос2.ОХРРаспрНУ) КАК ПроизводствоНУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыВыпускПР + ВложенныйЗапрос2.ПрямыеРасходыУслугиПР + ВложенныйЗапрос2.НЗППР - ВложенныйЗапрос2.ОХРПР - ВложенныйЗапрос2.ОХРРаспрПР) КАК ПроизводствоПР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыВыпускВР + ВложенныйЗапрос2.ПрямыеРасходыУслугиВР + ВложенныйЗапрос2.НЗПВР - ВложенныйЗапрос2.ОХРВР - ВложенныйЗапрос2.ОХРРаспрВР) КАК ПРоизводствоВР
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Организация КАК Организация,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыВыпускБУ) КАК ПрямыеРасходыВыпускБУ,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыВыпускНУ) КАК ПрямыеРасходыВыпускНУ,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыВыпускПР) КАК ПрямыеРасходыВыпускПР,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыВыпускВР) КАК ПрямыеРасходыВыпускВР,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыУслугиБУ) КАК ПрямыеРасходыУслугиБУ,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыУслугиНУ) КАК ПрямыеРасходыУслугиНУ,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыУслугиПР) КАК ПрямыеРасходыУслугиПР,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыУслугиВР) КАК ПрямыеРасходыУслугиВР,
		|		СУММА(ВложенныйЗапрос.ОХРБУ) КАК ОХРБУ,
		|		СУММА(ВложенныйЗапрос.ОХРНУ) КАК ОХРНУ,
		|		СУММА(ВложенныйЗапрос.ОХРПР) КАК ОХРПР,
		|		СУММА(ВложенныйЗапрос.ОХРВР) КАК ОХРВР,
		|		СУММА(ВложенныйЗапрос.ОХРРаспрБУ) КАК ОХРРаспрБУ,
		|		СУММА(ВложенныйЗапрос.ОХРРаспрНУ) КАК ОХРРаспрНУ,
		|		СУММА(ВложенныйЗапрос.ОХРРаспрПР) КАК ОХРРаспрПР,
		|		СУММА(ВложенныйЗапрос.ОХРРаспрВР) КАК ОХРРаспрВР,
		|		СУММА(ВложенныйЗапрос.НЗПБУ) КАК НЗПБУ,
		|		СУММА(ВложенныйЗапрос.НЗПНУ) КАК НЗПНУ,
		|		СУММА(ВложенныйЗапрос.НЗППР) КАК НЗППР,
		|		СУММА(ВложенныйЗапрос.НЗПВР) КАК НЗПВР
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация КАК Организация,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаУчетаАктивовХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК ПрямыеРасходыВыпускБУ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаУчетаАктивовХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК ПрямыеРасходыВыпускНУ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаУчетаАктивовХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК ПрямыеРасходыВыпускПР,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаУчетаАктивовХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК ПрямыеРасходыВыпускВР,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаУчетаУслугНеЕНВДХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК ПрямыеРасходыУслугиБУ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаУчетаУслугНеЕНВДХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК ПрямыеРасходыУслугиНУ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаУчетаУслугНеЕНВДХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК ПрямыеРасходыУслугиПР,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаУчетаУслугНеЕНВДХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК ПрямыеРасходыУслугиВР,
		|			0 КАК ОХРБУ,
		|			0 КАК ОХРНУ,
		|			0 КАК ОХРПР,
		|			0 КАК ОХРВР,
		|			0 КАК ОХРРаспрБУ,
		|			0 КАК ОХРРаспрНУ,
		|			0 КАК ОХРРаспрПР,
		|			0 КАК ОХРРаспрВР,
		|			0 КАК НЗПБУ,
		|			0 КАК НЗПНУ,
		|			0 КАК НЗППР,
		|			0 КАК НЗПВР
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаПрямыхЗатратХозрасчетный)
		|						ИЛИ Счет В ИЕРАРХИИ (&Счет40Хозрасчетный),
		|					,
		|					Организация = &Организация,
		|					(НЕ КорСчет В ИЕРАРХИИ (&СчетаПрямыхЗатратХозрасчетный)),
		|					) КАК ХозрасчетныйОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОстатки.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ХозрасчетныйОстатки.СуммаКонечныйОстаток,
		|			ХозрасчетныйОстатки.СуммаНУКонечныйОстаток,
		|			ХозрасчетныйОстатки.СуммаПРКонечныйОстаток,
		|			ХозрасчетныйОстатки.СуммаВРКонечныйОстаток
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаПрямыхЗатратХозрасчетный),
		|					&НоменклатурныеГруппы,
		|					Организация = &Организация
		|						И (НЕ Субконто1 В (&НоменклатурныеГруппыЕНВД))) КАК ХозрасчетныйОстатки
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НеЕНВД
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НеЕНВД
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НеЕНВД
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НеЕНВД
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &Распределяются
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &Распределяются
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &Распределяются
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &Распределяются
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			0,
		|			0,
		|			0,
		|			0
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаКосвенныхРасходовХозрасчетный),
		|					&СтатьиЗатрат,
		|					Организация = &Организация
		|						И (НЕ КорСубконто1 В (&НоменклатурныеГруппыЕНВД))
		|						И (НЕ Субконто1.ВидРасходовНУ = &ТранспортныеРасходы),
		|					КорСчет В ИЕРАРХИИ (&СчетаПрямыхЗатратХозрасчетный),
		|					&НоменклатурныеГруппы) КАК ХозрасчетныйОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОстатки.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ХозрасчетныйОстатки.СуммаКонечныйОстаток,
		|			ХозрасчетныйОстатки.СуммаНУКонечныйОстаток,
		|			ХозрасчетныйОстатки.СуммаПРКонечныйОстаток,
		|			ХозрасчетныйОстатки.СуммаВРКонечныйОстаток
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериодаТек, &КонецПериодаТек, , , Счет В ИЕРАРХИИ (&СчетаДавальческихЗатратХозрасчетный), , Организация = &Организация) КАК ХозрасчетныйОстатки) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Организация) КАК ВложенныйЗапрос2
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос2.Организация";
		
		Если НоменклатурныеГруппыЕНВД.Количество() = 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И (НЕ КорСубконто1 В (&НоменклатурныеГруппыЕНВД))", "");
		КонецЕсли;
		
		
		Если НомерТекущейСхемы > 20 Тогда
			Запрос.УстановитьПараметр("Организация", СвойстваОрганизации.СписокОП);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		КонецЕсли;
		
		Результат = Запрос.Выполнить();
		
		Если НомерТекущейСхемы > 20 Тогда
			СформироватьТаблицуОрганизаций(ДокументРезультат,Результат.Выгрузить(),"ПрямыеРасходы",4, НазваниеОтчета);
			Возврат;
		КонецЕсли;
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОбластьОтчета.Параметры.Заполнить(Выборка);
		
		Если ЭтоЕНВД Тогда
			СоздатьРамку(Выборка, "ПрямыеРасходыУслуги", ОбластьОтчета, 13, 37, 60, 5, "ПрямыеРасходыУслуги");	
			СоздатьРамку(Выборка, "ПрямыеРасходыВыпуск", ОбластьОтчета, 51, 37, 60, 5, "РасшифровкаАктивы");
			СоздатьРамку(Выборка, "НЗП", ОбластьОтчета, 91, 37, 60, 5, "РасшифровкаНЗП");
			СоздатьРамку(Выборка, "Производство", ОбластьОтчета, 13, 37, 60, 142, "РасшифровкаРасходыОбычные");
			СоздатьРамку(Выборка, "ОХР", ОбластьОтчета, 51, 37, 60, 142, "РасшифровкаКосвенныеРасходы");
			СоздатьРамку(Выборка, "ОХРРаспр", ОбластьОтчета, 90, 37, 60, 142, "РасшифровкаРаспределяемыеРасходы");
	    	СоздатьРамку(Выборка, "ПрямыеРасходы", ОбластьОтчета, 13, 111, 60, 73, "");	
			
			ОбластьОтчета.Параметры.РасшифровкаРаспределяемыеРасходы = ПереходКСхеме(8);
			
			
		Иначе
			СоздатьРамку(Выборка, "ПрямыеРасходыУслуги", ОбластьОтчета, 15, 37, 60, 4, "ПрямыеРасходыУслуги");	
			СоздатьРамку(Выборка, "ПрямыеРасходыВыпуск", ОбластьОтчета, 54, 35, 60, 4, "РасшифровкаАктивы");
			СоздатьРамку(Выборка, "НЗП", ОбластьОтчета, 90, 37, 60, 4, "РасшифровкаНЗП");
			СоздатьРамку(Выборка, "Производство", ОбластьОтчета, 15, 35, 60, 155, "РасшифровкаРасходыОбычные");
			СоздатьРамку(Выборка, "ОХР", ОбластьОтчета, 53, 35, 60, 155, "РасшифровкаКосвенныеРасходы");
	    	СоздатьРамку(Выборка, "ПрямыеРасходы", ОбластьОтчета, 14, 111, 60, 80, "");	
			
		КонецЕсли;
		
		ОбластьОтчета.Параметры.РасшифровкаКосвенныеРасходы = ПереходКСхеме(6);
		ОбластьОтчета.Параметры.РасшифровкаАктивы           = ПереходКСхеме(9);
		ОбластьОтчета.Параметры.РасшифровкаРасходыОбычные   = ПереходКСхеме(10);
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", МассивПрямых, МассивПрямыхНУ,"НоменклатурныеГруппы",,,,"СебестоимостьПродажНЕЕНВД","СебестоимостьПродаж");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ПроизводствоИзДавальческогоСырья", "ПроизводствоИзДавальческогоСырья","Номенклатура",,,,"СебестоимостьПродажНЕЕНВД","СебестоимостьПродаж");
		ОбластьОтчета.Параметры.ПрямыеРасходыУслуги = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Прямые расходы по реализованным услугам, учитываемые в НУ");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", МассивПрямых, МассивПрямыхНУ,"НоменклатурныеГруппы","НЕ ",НоменклатурныеГруппыЕНВД,,,,);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", МассивПрямых,МассивПрямыхНУ,"Номенклатура");
		ОбластьОтчета.Параметры.РасшифровкаНЗП = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Незавершенное производство");
		
		Если НЕ ПоказыватьКрасныйПрямоугольник Тогда
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки1);
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки2);
		КонецЕсли;
		
		ОбластьШапка.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное + ", " + ПредставлениеПериода(НачалоМесяца(НачалоПериодаТек), КонецМесяца(КонецПериодаТек), "ФП = Истина");
		ОбластьШапка.Параметры.НазваниеОтчета = НазваниеОтчета;
		ДокументРезультат.Вывести(ОбластьШапка);
		ДокументРезультат.Вывести(ОбластьОтчета);
		
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = "Анализ состояния налогового учета - " + НазваниеОтчета;
	КонецПроцедуры
	
	// Формирует отчет в режиме "Стоимость запасов"
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	Процедура	СформироватьРасходыПоТоварам(ДокументРезультат, НомерТекущейСхемы)
		НазваниеОтчета = "Стоимость активов";
		
		Макет      = ПолучитьМакет("СтоимостьСписанияТоваров" + ?(ЭтоЕНВД,"ЕНВД",""));
		ОбластьОтчета     = Макет.ПолучитьОбласть("Область");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоПериодаТек",     НачалоДня(НачалоПериодаТек));
		Запрос.УстановитьПараметр("КонецПериодаТек",     КонецДня(КонецПериодаТек));
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("СчетаХозрасчетный", МассивЗапасов2БУ);
		Запрос.УстановитьПараметр("СчетаОСХозрасчетный", МассивОСБУ);
		Запрос.УстановитьПараметр("СчетаНЗПХозрасчетный", МассивПрямых);
		Запрос.УстановитьПараметр("СчетаПрямыхРасходовХозрасчетный", Счет90_2);
		
		МассивЕНВД = Новый Массив;
		МассивЕНВД.Добавить(Счет90_2ЕНВД);
		МассивЕНВД.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
		Запрос.УстановитьПараметр("СчетаПрямыхРасходовЕНВДХозрасчетный", МассивЕНВД);
		
		Запрос.УстановитьПараметр("Счет90Хозрасчетный",    ПланыСчетов.Хозрасчетный.Продажи);
		Запрос.УстановитьПараметр("Счет91_02Хозрасчетный", ПланыСчетов.Хозрасчетный.ПрочиеРасходы);
		Запрос.УстановитьПараметр("СчетаВсехЗатратХозрасчетный", МассивВсехЗатрат);
		
		Запрос.УстановитьПараметр("НеЕНВД",         ВидыРасходовНеЕНВД);
		
		Запрос.УстановитьПараметр("ПрочиеРасходы", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы);
		Запрос.УстановитьПараметр("СтатьиЗатрат",   ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
		
		Запрос.УстановитьПараметр("ВидыПрочейРеализации", ВидыПрочейРеализации);
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ВложенныйЗапрос2.Организация,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыБУ + ВложенныйЗапрос2.ПрямыеРасходыТоварыЕНВДБУ + ВложенныйЗапрос2.ПрямыеРасходыОСБУ + ВложенныйЗапрос2.ПрямыеРасходыТоварыНЕБУ + ВложенныйЗапрос2.АктивыКонБУ + ВложенныйЗапрос2.ПрямыеРасходыДтБУ) КАК АктивыБУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыНУ + ВложенныйЗапрос2.ПрямыеРасходыТоварыЕНВДНУ + ВложенныйЗапрос2.ПрямыеРасходыОСНУ + ВложенныйЗапрос2.ПрямыеРасходыТоварыНЕНУ + ВложенныйЗапрос2.АктивыКонНУ + ВложенныйЗапрос2.ПрямыеРасходыДтНУ) КАК АктивыНУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыПР + ВложенныйЗапрос2.ПрямыеРасходыТоварыЕНВДПР + ВложенныйЗапрос2.ПрямыеРасходыОСПР + ВложенныйЗапрос2.ПрямыеРасходыТоварыНЕПР + ВложенныйЗапрос2.АктивыКонПР + ВложенныйЗапрос2.ПрямыеРасходыДтПР) КАК АктивыПР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыВР + ВложенныйЗапрос2.ПрямыеРасходыТоварыЕНВДВР + ВложенныйЗапрос2.ПрямыеРасходыОСВР + ВложенныйЗапрос2.ПрямыеРасходыТоварыНЕВР + ВложенныйЗапрос2.АктивыКонВР + ВложенныйЗапрос2.ПрямыеРасходыДтВР) КАК АктивыВР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыБУ) КАК ПрямыеРасходыТоварыБУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыНУ) КАК ПрямыеРасходыТоварыНУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыПР) КАК ПрямыеРасходыТоварыПР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыВР) КАК ПрямыеРасходыТоварыВР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыЕНВДБУ) КАК ПрямыеРасходыТоварыЕНВДБУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыЕНВДНУ) КАК ПрямыеРасходыТоварыЕНВДНУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыЕНВДПР) КАК ПрямыеРасходыТоварыЕНВДПР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыЕНВДВР) КАК ПрямыеРасходыТоварыЕНВДВР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыОСБУ) КАК ПрямыеРасходыОСБУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыОСНУ) КАК ПрямыеРасходыОСНУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыОСПР) КАК ПрямыеРасходыОСПР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыОСВР) КАК ПрямыеРасходыОСВР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыНЕБУ) КАК ПрямыеРасходыТоварыНЕБУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыНЕНУ) КАК ПрямыеРасходыТоварыНЕНУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыНЕПР) КАК ПрямыеРасходыТоварыНЕПР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыТоварыНЕВР) КАК ПрямыеРасходыТоварыНЕВР,
		|	СУММА(ВложенныйЗапрос2.АктивыКонБУ) КАК АктивыКонБУ,
		|	СУММА(ВложенныйЗапрос2.АктивыКонНУ) КАК АктивыКонНУ,
		|	СУММА(ВложенныйЗапрос2.АктивыКонПР) КАК АктивыКонПР,
		|	СУММА(ВложенныйЗапрос2.АктивыКонВР) КАК АктивыКонВР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыДтБУ) КАК ПрямыеРасходыДтБУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыДтНУ) КАК ПрямыеРасходыДтНУ,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыДтПР) КАК ПрямыеРасходыДтПР,
		|	СУММА(ВложенныйЗапрос2.ПрямыеРасходыДтВР) КАК ПрямыеРасходыДтВР
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Организация КАК Организация,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыБУ) КАК ПрямыеРасходыТоварыБУ,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыНУ) КАК ПрямыеРасходыТоварыНУ,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыПР) КАК ПрямыеРасходыТоварыПР,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыВР) КАК ПрямыеРасходыТоварыВР,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыЕНВДБУ) КАК ПрямыеРасходыТоварыЕНВДБУ,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыЕНВДНУ) КАК ПрямыеРасходыТоварыЕНВДНУ,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыЕНВДПР) КАК ПрямыеРасходыТоварыЕНВДПР,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыЕНВДВР) КАК ПрямыеРасходыТоварыЕНВДВР,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыОСБУ) КАК ПрямыеРасходыОСБУ,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыОСНУ) КАК ПрямыеРасходыОСНУ,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыОСПР) КАК ПрямыеРасходыОСПР,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыОСВР) КАК ПрямыеРасходыОСВР,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыНЕБУ) КАК ПрямыеРасходыТоварыНЕБУ,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыНЕНУ) КАК ПрямыеРасходыТоварыНЕНУ,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыНЕПР) КАК ПрямыеРасходыТоварыНЕПР,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыТоварыНЕВР) КАК ПрямыеРасходыТоварыНЕВР,
		|		СУММА(ВложенныйЗапрос.АктивыКонБУ) КАК АктивыКонБУ,
		|		СУММА(ВложенныйЗапрос.АктивыКонНУ) КАК АктивыКонНУ,
		|		СУММА(ВложенныйЗапрос.АктивыКонПР) КАК АктивыКонПР,
		|		СУММА(ВложенныйЗапрос.АктивыКонВР) КАК АктивыКонВР,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыДтБУ) КАК ПрямыеРасходыДтБУ,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыДтНУ) КАК ПрямыеРасходыДтНУ,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыДтПР) КАК ПрямыеРасходыДтПР,
		|		СУММА(ВложенныйЗапрос.ПрямыеРасходыДтВР) КАК ПрямыеРасходыДтВР
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ХозрасчетныйОстаткиИОбороты.Организация КАК Организация,
		|			ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК АктивыКонБУ,
		|			ХозрасчетныйОстаткиИОбороты.СуммаНУКонечныйОстаток КАК АктивыКонНУ,
		|			ХозрасчетныйОстаткиИОбороты.СуммаПРКонечныйОстаток КАК АктивыКонПР,
		|			ХозрасчетныйОстаткиИОбороты.СуммаВРКонечныйОстаток КАК АктивыКонВР,
		|			ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК АктивыКтБУ,
		|			ХозрасчетныйОстаткиИОбороты.СуммаНУОборотКт КАК АктивыКтНУ,
		|			ХозрасчетныйОстаткиИОбороты.СуммаПРОборотКт КАК АктивыКтПР,
		|			ХозрасчетныйОстаткиИОбороты.СуммаВРОборотКт КАК АктивыКтВР,
		|			0 КАК ПрямыеРасходыТоварыБУ,
		|			0 КАК ПрямыеРасходыТоварыНУ,
		|			0 КАК ПрямыеРасходыТоварыПР,
		|			0 КАК ПрямыеРасходыТоварыВР,
		|			0 КАК ПрямыеРасходыТоварыЕНВДБУ,
		|			0 КАК ПрямыеРасходыТоварыЕНВДНУ,
		|			0 КАК ПрямыеРасходыТоварыЕНВДПР,
		|			0 КАК ПрямыеРасходыТоварыЕНВДВР,
		|			0 КАК ПрямыеРасходыОСБУ,
		|			0 КАК ПрямыеРасходыОСНУ,
		|			0 КАК ПрямыеРасходыОСПР,
		|			0 КАК ПрямыеРасходыОСВР,
		|			0 КАК ПрямыеРасходыТоварыНЕБУ,
		|			0 КАК ПрямыеРасходыТоварыНЕНУ,
		|			0 КАК ПрямыеРасходыТоварыНЕПР,
		|			0 КАК ПрямыеРасходыТоварыНЕВР,
		|			0 КАК ПрямыеРасходыДтБУ,
		|			0 КАК ПрямыеРасходыДтНУ,
		|			0 КАК ПрямыеРасходыДтПР,
		|			0 КАК ПрямыеРасходыДтВР
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						ИЛИ Счет В ИЕРАРХИИ (&СчетаОСХозрасчетный),
		|					,
		|					Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовЕНВДХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовЕНВДХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовЕНВДХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						И ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовЕНВДХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовЕНВДХозрасчетный))
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовЕНВДХозрасчетный))
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовЕНВДХозрасчетный))
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовЕНВДХозрасчетный))
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						ИЛИ Счет В ИЕРАРХИИ (&СчетаОСХозрасчетный),
		|					,
		|					Организация = &Организация,
		|					(НЕ КорСчет В ИЕРАРХИИ (&Счет91_02Хозрасчетный))
		|						И (НЕ КОрСчет В ИЕРАРХИИ (&СчетаХозрасчетный))
		|						И (НЕ КорСчет В ИЕРАРХИИ (&СчетаОСХозрасчетный))
		|						И (НЕ КорСчет В ИЕРАРХИИ (&СчетаВсехЗатратХозрасчетный)),
		|					) КАК ХозрасчетныйОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСубконто1.ПринятиеКналоговомуУчету
		|						И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСубконто1.ПринятиеКналоговомуУчету
		|						И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСубконто1.ПринятиеКналоговомуУчету
		|						И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСубконто1.ПринятиеКналоговомуУчету
		|						И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД))
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД))
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД))
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД))
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСубконто1.ПринятиеКналоговомуУчету
		|						И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаОСХозрасчетный)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСубконто1.ПринятиеКналоговомуУчету
		|						И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаОСХозрасчетный)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСубконто1.ПринятиеКналоговомуУчету
		|						И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаОСХозрасчетный)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСубконто1.ПринятиеКналоговомуУчету
		|						И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаОСХозрасчетный)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1.ПринятиеКналоговомуУчету)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1.ПринятиеКналоговомуУчету)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1.ПринятиеКналоговомуУчету)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСубконто1.ПринятиеКналоговомуУчету)
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСубконто1.ПринятиеКналоговомуУчету
		|						И (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации))
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСубконто1.ПринятиеКналоговомуУчету
		|						И (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации))
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСубконто1.ПринятиеКналоговомуУчету
		|						И (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации))
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСубконто1.ПринятиеКналоговомуУчету
		|						И (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидПрочихДоходовИРасходов В (&ВидыПрочейРеализации))
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						ИЛИ Счет В ИЕРАРХИИ (&СчетаОСХозрасчетный),
		|					,
		|					Организация = &Организация,
		|					КорСчет В ИЕРАРХИИ (&Счет91_02Хозрасчетный),
		|					&ПрочиеРасходы) КАК ХозрасчетныйОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовЕНВДХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД))
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовЕНВДХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД))
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовЕНВДХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД))
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовЕНВДХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД))
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовЕНВДХозрасчетный))
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовЕНВДХозрасчетный))
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовЕНВДХозрасчетный))
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ,
		|			ВЫБОР
		|				КОГДА (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовХозрасчетный))
		|						И (НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхРасходовЕНВДХозрасчетный))
		|						И ХозрасчетныйОбороты.КорСубконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВД)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаХозрасчетный)
		|						ИЛИ Счет В ИЕРАРХИИ (&СчетаОСХозрасчетный),
		|					,
		|					Организация = &Организация,
		|					КорСчет В ИЕРАРХИИ (&СчетаВсехЗатратХозрасчетный),
		|					&СтатьиЗатрат) КАК ХозрасчетныйОбороты) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Организация) КАК ВложенныйЗапрос2
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос2.Организация";
		
		Если НомерТекущейСхемы > 20 Тогда
			Запрос.УстановитьПараметр("Организация", СвойстваОрганизации.СписокОП);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		КонецЕсли;
		
		Результат = Запрос.Выполнить();
		
		Если НомерТекущейСхемы > 20 Тогда
			СформироватьТаблицуОрганизаций(ДокументРезультат,Результат.Выгрузить(),"Активы",3, НазваниеОтчета);
			Возврат;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОбластьОтчета.Параметры.Заполнить(Выборка);
		
		Если ЭтоЕНВД Тогда
			
		СоздатьРамку(Выборка, "ПрямыеРасходыТовары", ОбластьОтчета, 14, 35, 60, 6, "РасшифровкаПрямыеРасходыТовары");
		СоздатьРамку(Выборка, "ПрямыеРасходыОС", ОбластьОтчета, 51, 35, 60, 6, "РасшифровкаПрямыеРасходыОС");
		СоздатьРамку(Выборка, "ПрямыеРасходыТоварыЕНВД", ОбластьОтчета, 107, 36, 60, 82, "РасшифровкаПрямыеРасходыТоварыЕНВД");
		СоздатьРамку(Выборка, "ПрямыеРасходыДт", ОбластьОтчета, 88, 35, 59, 6, "РасшифровкаПрямыеРасходыДт");
		СоздатьРамку(Выборка, "Активы", ОбластьОтчета, 14, 127, 60, 156, "РасшифровкаАктивы");
		СоздатьРамку(Выборка, "ПрямыеРасходыТоварыНЕ", ОбластьОтчета, 23, 36, 59, 82, "РасшифровкаПрямыеРасходыТоварыНЕ");
		СоздатьРамку(Выборка, "АктивыКон", ОбластьОтчета, 65, 36, 59, 82, "РасшифровкаАктивыКон");
	Иначе
		
		СоздатьРамку(Выборка, "ПрямыеРасходыТовары", ОбластьОтчета, 11, 36, 60, 4, "РасшифровкаПрямыеРасходыТовары");
		СоздатьРамку(Выборка, "ПрямыеРасходыОС", ОбластьОтчета, 50, 36, 60, 4, "РасшифровкаПрямыеРасходыОС");
		СоздатьРамку(Выборка, "Активы", ОбластьОтчета, 11, 111, 60, 154, "РасшифровкаАктивы");
		СоздатьРамку(Выборка, "ПрямыеРасходыДт", ОбластьОтчета, 88, 37, 60, 4, "РасшифровкаПрямыеРасходыДт");
		СоздатьРамку(Выборка, "ПрямыеРасходыТоварыНЕ", ОбластьОтчета, 26, 36, 59, 79, "РасшифровкаПрямыеРасходыТоварыНЕ");
		СоздатьРамку(Выборка, "АктивыКон", ОбластьОтчета, 72, 36, 59, 79, "РасшифровкаАктивыКон");
	КонецЕсли;
	
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ВложенияВоВнеоборотныеАктивы","ВложенияВоВнеоборотныеАктивы",,,,,"СебестоимостьПродажНеЕНВД", "СебестоимостьПродаж");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "Материалы","Материалы","Номенклатура",,,,"СебестоимостьПродажНеЕНВД", "СебестоимостьПродаж");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "Полуфабрикаты","Полуфабрикаты","Номенклатура",,,,"СебестоимостьПродажНеЕНВД", "СебестоимостьПродаж");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТоварыНаСкладах","ТоварыНаСкладах","Номенклатура",,,,"СебестоимостьПродажНеЕНВД", "СебестоимостьПродаж");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", МассивРозницы,"ТоварыВРозничнойТорговле","Склады",,,,"СебестоимостьПродажНеЕНВД", "СебестоимостьПродаж");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТараПодТоваромИПорожняя","ТараПодТоваромИПорожняя","Номенклатура",,,,"СебестоимостьПродажНеЕНВД", "СебестоимостьПродаж");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ПокупныеИзделия","ПокупныеИзделия","Номенклатура",,,,"СебестоимостьПродажНеЕНВД", "СебестоимостьПродаж");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТоварыОтгруженные","ТоварыОтгруженные","Номенклатура",,,,"СебестоимостьПродажНеЕНВД", "СебестоимостьПродаж");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ГотоваяПродукция","ГотоваяПродукция","Номенклатура",,,,"СебестоимостьПродажНеЕНВД", "СебестоимостьПродаж");
		
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ВложенияВоВнеоборотныеАктивы","ВложенияВоВнеоборотныеАктивы",,,,,"ПрочиеРасходы", "ПрочиеРасходы","Кор91НЕЕНВД","ПринятиеКналоговомуУчету",Истина);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "Материалы","Материалы","Номенклатура",,,,"ПрочиеРасходы", "ПрочиеРасходы","Кор91НЕЕНВД","ПринятиеКналоговомуУчету",Истина);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "Полуфабрикаты","Полуфабрикаты","Номенклатура",,,,"ПрочиеРасходы", "ПрочиеРасходы","Кор91НЕЕНВД","ПринятиеКналоговомуУчету",Истина);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТоварыНаСкладах","ТоварыНаСкладах","Номенклатура",,,,"ПрочиеРасходы", "ПрочиеРасходы","Кор91НЕЕНВД","ПринятиеКналоговомуУчету",Истина);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", МассивРозницы,"ТоварыВРозничнойТорговле","Склады",,,,"ПрочиеРасходы", "ПрочиеРасходы","Кор91НЕЕНВД","ПринятиеКналоговомуУчету",Истина);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТараПодТоваромИПорожняя","ТараПодТоваромИПорожняя","Номенклатура",,,,"ПрочиеРасходы", "ПрочиеРасходы","Кор91НЕЕНВД","ПринятиеКналоговомуУчету",Истина);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ПокупныеИзделия","ПокупныеИзделия","Номенклатура",,,,"ПрочиеРасходы", "ПрочиеРасходы","Кор91НЕЕНВД","ПринятиеКналоговомуУчету",Истина);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТоварыОтгруженные","ТоварыОтгруженные","Номенклатура",,,,"ПрочиеРасходы", "ПрочиеРасходы","Кор91НЕЕНВД","ПринятиеКналоговомуУчету",Истина);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ГотоваяПродукция","ГотоваяПродукция","Номенклатура",,,,"ПрочиеРасходы", "ПрочиеРасходы","Кор91НЕЕНВД","ПринятиеКналоговомуУчету",Истина);
		ОбластьОтчета.Параметры.РасшифровкаПрямыеРасходыТовары = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Прямые расходы по реализованным товарам, учитываемые в НУ");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидПрочихДоходовИРасходов",ВидыПрочейРеализации,,МассивОСБУ,МассивОСНУ,"91НЕЕНВДДопСубк","ПринятиеКналоговомуУчету",Истина);
		ОбластьОтчета.Параметры.РасшифровкаПрямыеРасходыОС = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Расходы, относящиеся к стоимости реализованного амортизируемого имущества");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы","ПрочиеРасходы","ПрочиеДоходыИРасходы","ПринятиеКналоговомуУчету",Ложь,,МассивЗапасовБУ, МассивЗапасовНУ);
		ОбластьОтчета.Параметры.РасшифровкаПрямыеРасходыТоварыНЕ = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Прямые расходы по реализованным товарам, не учитываемые в НУ");
		
	    Массив1 = Новый Массив;
		Массив1.Добавить(ПланыСчетов.Хозрасчетный.ОсновныеСредства);
		Массив1.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОС_01);
		Массив1.Добавить(ПланыСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости);
        
	    Массив2 = Новый Массив;
		Массив2.Добавить(ПланыСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ);
		Массив2.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОС_03);
		
	    Массив3 = Новый Массив;
		Массив3.Добавить(ПланыСчетов.Хозрасчетный.НематериальныеАктивы);
		Массив3.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов);
		
	    Массив1НУ = Новый Массив;
		Массив1НУ.Добавить(ПланыСчетов.Хозрасчетный.ОсновныеСредства);
		Массив1НУ.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОС_01);
		Массив1НУ.Добавить(ПланыСчетов.Хозрасчетный.ПереданныеОбъектыНедвижимости);
		
	    Массив2НУ = Новый Массив;
		Массив2НУ.Добавить(ПланыСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ);
		Массив2НУ.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОС_03);
		
	    Массив3НУ = Новый Массив;
		Массив3НУ.Добавить(ПланыСчетов.Хозрасчетный.НематериальныеАктивы);
		Массив3НУ.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов);

		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", Массив1,Массив1НУ,"ОсновныеСредства");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", Массив2,Массив2НУ,"ОсновныеСредства");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", Массив3,Массив3НУ,"НематериальныеАктивы");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", "ОборудованиеКУстановке","ОборудованиеКУстановке","Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", "ВложенияВоВнеоборотныеАктивы","ВложенияВоВнеоборотныеАктивы");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", "Материалы","Материалы","Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", "Полуфабрикаты","Полуфабрикаты","Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", "ТоварыНаСкладах","ТоварыНаСкладах","Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК",  МассивРозницы,"ТоварыВРозничнойТорговле","Склады");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", "ТараПодТоваромИПорожняя","ТараПодТоваромИПорожняя","Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", "ПокупныеИзделия","ПокупныеИзделия","Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", "ТоварыОтгруженные","ТоварыОтгруженные","Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", "ГотоваяПродукция","ГотоваяПродукция","Номенклатура");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", МассивРБПБУ,МассивРБПНУ,"РасходыБудущихПериодов");
		ОбластьОтчета.Параметры.РасшифровкаАктивыКон = ПереходКРасшифровке(ТаблицаФорматаРасшифровки,"Стоимость несписанных товаров, амортизируемого имущества, РБП", Ложь);
		
		
		МассивБУ = Новый Массив;
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ОСвОрганизации);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.НематериальныеАктивы);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОсновныхСредств);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияНематериальныхАктивов);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ОборудованиеКУстановке);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.Материалы);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.Полуфабрикаты);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыНаСкладах);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговле);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ТараПодТоваромИПорожняя);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ПокупныеИзделия);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаАТТ);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ТорговаяНаценкаНТТ);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ТоварыОтгруженные);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ГотоваяПродукция);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.РасходыБудущихПериодов);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ПлатежиПоДобровольномуСтрахованиюРаботников);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.Продажи);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеДоходыИРасходы);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ОсновноеПроизводство);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ВспомогательныеПроизводства);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.БракВПроизводстве);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.ОбслуживающиеПроизводства);
		МассивБУ.Добавить(ПланыСчетов.Хозрасчетный.РасходыНаПродажу);
		
		
		МассивВидов91 = Новый Массив;
		МассивВидов91.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ПрочиеВнереализационныеДоходыРасходы);
		МассивВидов91.Добавить(Перечисления.ВидыПрочихДоходовИРасходов.ПрочиеКосвенныеРасходы);
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();

		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", Массив1,Массив1,"ОсновныеСредства",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорНЕЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", Массив2,Массив2,"ОсновныеСредства",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорНЕЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", Массив3,Массив3,"НематериальныеАктивы",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорНЕЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ВложенияВоВнеоборотныеАктивы","ВложенияВоВнеоборотныеАктивы",,,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорНЕЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "Материалы","Материалы","Номенклатура",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорНЕЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "Полуфабрикаты","Полуфабрикаты","Номенклатура",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорНЕЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТоварыНаСкладах","ТоварыНаСкладах","Номенклатура",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорНЕЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", МассивРозницы,"ТоварыВРозничнойТорговле","Склады",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорНЕЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТараПодТоваромИПорожняя","ТараПодТоваромИПорожняя","Номенклатура",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорНЕЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ПокупныеИзделия","ПокупныеИзделия","Номенклатура",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорНЕЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТоварыОтгруженные","ТоварыОтгруженные","Номенклатура",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорНЕЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ГотоваяПродукция","ГотоваяПродукция","Номенклатура",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорНЕЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", МассивРБПБУ,МассивРБПНУ,"РасходыБудущихПериодов",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорНЕЕНВД");
		
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", Массив1,Массив1,"ОсновныеСредства",,,,МассивБУ, МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", Массив2,Массив2,"ОсновныеСредства",,,,МассивБУ, МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", Массив3,Массив3,"НематериальныеАктивы",,,,МассивБУ, МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", Массив1,Массив1,"ОсновныеСредства",,,,"ПрочиеДоходыИРасходы", "ПрочиеДоходыИРасходы",,"ВидПрочихДоходовИРасходов",МассивВидов91);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", Массив2,Массив2,"ОсновныеСредства",,,,"ПрочиеДоходыИРасходы", "ПрочиеДоходыИРасходы",,"ВидПрочихДоходовИРасходов",МассивВидов91);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", Массив3,Массив3,"НематериальныеАктивы",,,,"ПрочиеДоходыИРасходы", "ПрочиеДоходыИРасходы",,"ВидПрочихДоходовИРасходов",МассивВидов91);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ВложенияВоВнеоборотныеАктивы","ВложенияВоВнеоборотныеАктивы",,,,,МассивБУ, МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "Материалы","Материалы","Номенклатура",,,,МассивБУ, МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "Полуфабрикаты","Полуфабрикаты","Номенклатура",,,,МассивБУ, МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТоварыНаСкладах","ТоварыНаСкладах","Номенклатура",,,,МассивБУ, МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", МассивРозницы,"ТоварыВРозничнойТорговле","Склады",,,,МассивБУ, МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТараПодТоваромИПорожняя","ТараПодТоваромИПорожняя","Номенклатура",,,,МассивБУ, МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ПокупныеИзделия","ПокупныеИзделия","Номенклатура",,,,МассивБУ, МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТоварыОтгруженные","ТоварыОтгруженные","Номенклатура",,,,МассивБУ, МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ГотоваяПродукция","ГотоваяПродукция","Номенклатура",,,,МассивБУ, МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", МассивРБПБУ,МассивРБПНУ,"РасходыБудущихПериодов",,,,МассивБУ, МассивБУ,"НЕ ");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","НЕ ВидПрочихДоходовИРасходов",ВидыПрочейРеализации,,МассивЗапасов2БУ,МассивЗапасов2НУ,"ДопСубк","ПринятиеКналоговомуУчету",Истина);
		ОбластьОтчета.Параметры.РасшифровкаПрямыеРасходыДт = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Амортизация, списанные РБП, и товары, списанные не на реализацию");
		
		Если ЭтоЕНВД Тогда
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ВложенияВоВнеоборотныеАктивы","ВложенияВоВнеоборотныеАктивы",,,,,МассивЕНВД, "РасходыПоДеятельностиЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "Материалы","Материалы","Номенклатура",,,,МассивЕНВД, "РасходыПоДеятельностиЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "Полуфабрикаты","Полуфабрикаты","Номенклатура",,,,МассивЕНВД, "РасходыПоДеятельностиЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТоварыНаСкладах","ТоварыНаСкладах","Номенклатура",,,,МассивЕНВД, "РасходыПоДеятельностиЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", МассивРозницы,"ТоварыВРозничнойТорговле","Склады",,,,МассивЕНВД, "РасходыПоДеятельностиЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТараПодТоваромИПорожняя","ТараПодТоваромИПорожняя","Номенклатура",,,,МассивЕНВД, "РасходыПоДеятельностиЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ПокупныеИзделия","ПокупныеИзделия","Номенклатура",,,,МассивЕНВД, "РасходыПоДеятельностиЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТоварыОтгруженные","ТоварыОтгруженные","Номенклатура",,,,МассивЕНВД, "РасходыПоДеятельностиЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ГотоваяПродукция","ГотоваяПродукция","Номенклатура",,,,МассивЕНВД, "РасходыПоДеятельностиЕНВД");
		
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "ДО", "ПрочиеРасходы", "ПрочиеРасходы","ПрочиеДоходыИРасходы","ВидДеятельностиДляНалоговогоУчетаЗатрат",ЕНВД,,МассивЗапасовБУ,МассивЗапасовНУ);
		
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", Массив1,Массив1НУ,"ОсновныеСредства",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", Массив2,Массив2НУ,"ОсновныеСредства",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", Массив3,Массив3НУ,"НематериальныеАктивы",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ВложенияВоВнеоборотныеАктивы","ВложенияВоВнеоборотныеАктивы",,,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "Материалы","Материалы","Номенклатура",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "Полуфабрикаты","Полуфабрикаты","Номенклатура",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТоварыНаСкладах","ТоварыНаСкладах","Номенклатура",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", МассивРозницы,"ТоварыВРозничнойТорговле","Склады",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТараПодТоваромИПорожняя","ТараПодТоваромИПорожняя","Номенклатура",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ПокупныеИзделия","ПокупныеИзделия","Номенклатура",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ТоварыОтгруженные","ТоварыОтгруженные","Номенклатура",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ГотоваяПродукция","ГотоваяПродукция","Номенклатура",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорЕНВД");
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", МассивРБПБУ,МассивРБПНУ,"РасходыБудущихПериодов",,,,МассивВсехЗатрат, МассивВсехЗатратНУ,"КорЕНВД");
		
		ОбластьОтчета.Параметры.РасшифровкаПрямыеРасходыТоварыЕНВД = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Прямые расходы по реализованным товарам, относящиеся к деятельности, облагаемой ЕНВД");
		КонецЕсли;
		
		
		ОбластьОтчета.Параметры.РасшифровкаАктивы  = ПереходКСхеме(9);
		
		Если НЕ ПоказыватьКрасныйПрямоугольник Тогда
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки1);
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки2);
		КонецЕсли;
		
		ОбластьШапка.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное + ", " + ПредставлениеПериода(НачалоМесяца(НачалоПериодаТек), КонецМесяца(КонецПериодаТек), "ФП = Истина");
		ОбластьШапка.Параметры.НазваниеОтчета = НазваниеОтчета;
		ДокументРезультат.Вывести(ОбластьШапка);
		ДокументРезультат.Вывести(ОбластьОтчета);
		
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = "Анализ состояния налогового учета - " + НазваниеОтчета;
	КонецПроцедуры

	Процедура	СформироватьТранспортныеРасходы(ДокументРезультат, НомерТекущейСхемы)
	    НазваниеОтчета = "Транспортные расходы";
		
		Макет      = ПолучитьМакет("РасходыТранспортные");
		ОбластьОтчета     = Макет.ПолучитьОбласть("Область");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоПериодаТек",     НачалоДня(НачалоПериодаТек));
		Запрос.УстановитьПараметр("КонецПериодаТек",     КонецДня(КонецПериодаТек));
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Запрос.УстановитьПараметр("СчетаТранспортныхРасходовХозрасчетный", ПланыСчетов.Хозрасчетный.ИздержкиОбращения);
		Запрос.УстановитьПараметр("СчетРасходовХозрасчетный", Счет90_7);
		
		Запрос.УстановитьПараметр("НеЕНВДСписок", ВидыРасходовНеЕНВД);
		Запрос.УстановитьПараметр("СтатьиЗатрат",   ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
		Запрос.УстановитьПараметр("ТранспортныеРасходы",Перечисления.ВидыРасходовНУ.ТранспортныеРасходы);  
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Организация КАК Организация,
		|	СУММА(ВложенныйЗапрос.ТранспортныеРасходыБУ) КАК ТранспортныеРасходыБУ,
		|	СУММА(ВложенныйЗапрос.ТранспортныеРасходыНУ) КАК ТранспортныеРасходыНУ,
		|	СУММА(ВложенныйЗапрос.ТранспортныеРасходыПР) КАК ТранспортныеРасходыПР,
		|	СУММА(ВложенныйЗапрос.ТранспортныеРасходыВР) КАК ТранспортныеРасходыВР,
		|	СУММА(ВложенныйЗапрос.ТранспортныеРасходыСписБУ) КАК ТранспортныеРасходыСписБУ,
		|	СУММА(ВложенныйЗапрос.ТранспортныеРасходыСписНУ) КАК ТранспортныеРасходыСписНУ,
		|	СУММА(ВложенныйЗапрос.ТранспортныеРасходыСписВР) КАК ТранспортныеРасходыСписВР,
		|	СУММА(ВложенныйЗапрос.ТранспортныеРасходыОстБУ) КАК ТранспортныеРасходыОстБУ,
		|	СУММА(ВложенныйЗапрос.ТранспортныеРасходыОстНУ) КАК ТранспортныеРасходыОстНУ,
		|	СУММА(ВложенныйЗапрос.ТранспортныеРасходыОстПР) КАК ТранспортныеРасходыОстПР,
		|	СУММА(ВложенныйЗапрос.ТранспортныеРасходыОстВР) КАК ТранспортныеРасходыОстВР,
		|	СУММА(ВложенныйЗапрос.ТранспортныеРасходыСписПР) КАК ТранспортныеРасходыСписПР
		|ИЗ
		|	(ВЫБРАТЬ
		|		ХозрасчетныйОстаткиИОбороты.Организация КАК Организация,
		|		ХозрасчетныйОстаткиИОбороты.СуммаОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстатокДт КАК ТранспортныеРасходыБУ,
		|		ХозрасчетныйОстаткиИОбороты.СуммаНУОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаНУНачальныйОстатокДт КАК ТранспортныеРасходыНУ,
		|		ХозрасчетныйОстаткиИОбороты.СуммаПРОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаПРНачальныйОстатокДт КАК ТранспортныеРасходыПР,
		|		ХозрасчетныйОстаткиИОбороты.СуммаВРОборотДт + ХозрасчетныйОстаткиИОбороты.СуммаВРНачальныйОстатокДт КАК ТранспортныеРасходыВР,
		|		0 КАК ТранспортныеРасходыСписБУ,
		|		0 КАК ТранспортныеРасходыСписНУ,
		|		0 КАК ТранспортныеРасходыСписПР,
		|		0 КАК ТранспортныеРасходыСписВР,
		|		ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК ТранспортныеРасходыОстБУ,
		|		ХозрасчетныйОстаткиИОбороты.СуммаНУКонечныйОстатокДт КАК ТранспортныеРасходыОстНУ,
		|		ХозрасчетныйОстаткиИОбороты.СуммаПРКонечныйОстатокДт КАК ТранспортныеРасходыОстПР,
		|		ХозрасчетныйОстаткиИОбороты.СуммаВРКонечныйОстатокДт КАК ТранспортныеРасходыОстВР
		|	ИЗ
		|		РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
		|				&НачалоПериодаТек,
		|				&КонецПериодаТек,
		|				,
		|				,
		|				Счет В ИЕРАРХИИ (&СчетаТранспортныхРасходовХозрасчетный),
		|				&СтатьиЗатрат,
		|				Организация = &Организация
		|					И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)
		|					И Субконто1.ВидРасходовНУ = &ТранспортныеРасходы) КАК ХозрасчетныйОстаткиИОбороты
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ХозрасчетныйОбороты.Организация,
		|		0,
		|		0,
		|		0,
		|		0,
		|		ХозрасчетныйОбороты.СуммаОборотКт,
		|		ХозрасчетныйОбороты.СуммаНУОборотКт,
		|		ХозрасчетныйОбороты.СуммаПРОборотКт,
		|		ХозрасчетныйОбороты.СуммаВРОборотКт,
		|		0,
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		РегистрБухгалтерии.Хозрасчетный.Обороты(
		|				&НачалоПериодаТек,
		|				&КонецПериодаТек,
		|				,
		|				Счет В ИЕРАРХИИ (&СчетаТранспортныхРасходовХозрасчетный),
		|				&СтатьиЗатрат,
		|				Организация = &Организация
		|					И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат В (&НеЕНВДСписок)
		|					И Субконто1.ВидРасходовНУ = &ТранспортныеРасходы,
		|				КорСчет В ИЕРАРХИИ (&СчетРасходовХозрасчетный),
		|				) КАК ХозрасчетныйОбороты) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Организация";
		
		Если НомерТекущейСхемы > 20 Тогда
			Запрос.УстановитьПараметр("Организация", СвойстваОрганизации.СписокОП);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		КонецЕсли;
		
		Результат = Запрос.Выполнить();
		
		Если НомерТекущейСхемы > 20 Тогда
			СформироватьТаблицуОрганизаций(ДокументРезультат,Результат.Выгрузить(),"ТранспортныеРасходы",5, НазваниеОтчета);
			Возврат;
		КонецЕсли;
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОбластьОтчета.Параметры.Заполнить(Выборка);
		
		СоздатьРамку(Выборка, "ТранспортныеРасходыСпис", ОбластьОтчета, 13, 37, 59, 4, "РасшифровкаТранспортныеРасходыСпис");
		СоздатьРамку(Выборка, "ТранспортныеРасходы", ОбластьОтчета, 33, 37, 59, 81, "РасшифровкаРасходыОбычные");
		СоздатьРамку(Выборка, "ТранспортныеРасходыОст", ОбластьОтчета, 52, 37, 59, 4, "РасшифровкаТранспортныеРасходыОст");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", "ИздержкиОбращения", "ИздержкиОбращения","СтатьиЗатрат","ВидРасходовНУ","ТранспортныеРасходы",,"Продажи_РасходыНаПродажуНеЕНВД","Продажи_РасходыНаПродажу");
		ОбластьОтчета.Параметры.РасшифровкаТранспортныеРасходыСпис = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Транспортные расходы, учитываемые в НУ (Транспортные расходы, отнесенные на стоимость реализованных товаров)");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", "ИздержкиОбращения", "ИздержкиОбращения","СтатьиЗатрат","ВидРасходовНУ","ТранспортныеРасходы");
		ОбластьОтчета.Параметры.РасшифровкаТранспортныеРасходыОст = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Транспортные расходы, отнесенные на остаток товаров");
		
		ОбластьОтчета.Параметры.РасшифровкаРасходыОбычные = ПереходКСхеме(10);
		
		Если НЕ ПоказыватьКрасныйПрямоугольник Тогда
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки1);
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки2);
		КонецЕсли;
		
		ОбластьШапка.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное + ", " + ПредставлениеПериода(НачалоМесяца(НачалоПериодаТек), КонецМесяца(КонецПериодаТек), "ФП = Истина");
		ОбластьШапка.Параметры.НазваниеОтчета = НазваниеОтчета;
		ДокументРезультат.Вывести(ОбластьШапка);
		ДокументРезультат.Вывести(ОбластьОтчета);
		
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = "Анализ состояния налогового учета - " + НАзваниеОтчета;
	КонецПроцедуры

	// Формирует отчет в режиме "Транспортные расходы"
	// в соответствии с настройками, заданными значениями реквизитов отчета.
	//
	Процедура	СформироватьКосвенныеРасходы(ДокументРезультат, НомерТекущейСхемы)
		НазваниеОтчета = "Косвенные расходы";
		Макет      = ПолучитьМакет("КосвенныеРасходы");
		ОбластьОтчета     = Макет.ПолучитьОбласть("Область");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоПериодаТек",     НачалоДня(НачалоПериодаТек));
		Запрос.УстановитьПараметр("КонецПериодаТек",     КонецДня(КонецПериодаТек));
		Запрос.УстановитьПараметр("КонецПериодаТек2",     НачалоДня(КонецДня(КонецПериодаТек)+2));
		Запрос.УстановитьПараметр("Организация", Организация);
		
		Запрос.УстановитьПараметр("СчетаХозрасчетный", МассивВсехЗатрат);
		Запрос.УстановитьПараметр("СчетаПрямыхХозрасчетный", МассивПрямых);
		
		МассивОПРОХРНУ = Новый Массив;
		МассивОПРОХРНУ.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
		МассивОПРОХРНУ.Добавить(ПланыСчетов.Хозрасчетный.ОбщехозяйственныеРасходы);
		
		Запрос.УстановитьПараметр("СчетаОПРОХРХозрасчетный", МассивОПРОХРНУ);
		Запрос.УстановитьПараметр("СчетаКосвенныхРасходовХозрасчетный", МассивВсехКосвенных);
		
		МассивРасходовБУ = Новый Массив;
		МассивРасходовБУ.Добавить(Счет90_7);
		МассивРасходовБУ.Добавить(Счет90_8);
		Запрос.УстановитьПараметр("СчетаТекущихРасходовХозрасчетный", МассивРасходовБУ);
		
		Запрос.УстановитьПараметр("НеЕНВД",         НеЕНВД);
		Запрос.УстановитьПараметр("СтатьиЗатрат",   ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
		Запрос.УстановитьПараметр("НоменклатурныеГруппы",ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
		Запрос.УстановитьПараметр("НеУчитываемые",Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения);  
		Запрос.УстановитьПараметр("ТранспортныеРасходы",Перечисления.ВидыРасходовНУ.ТранспортныеРасходы); 
		Запрос.УстановитьПараметр("НоменклатурныеГруппыЕНВД",   НоменклатурныеГруппыЕНВД);
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ВложенныйЗапрос2.Организация КАК Организация,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыУчБУ) КАК КосвенныеРасходыУчБУ,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыУчНУ) КАК КосвенныеРасходыУчНУ,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыУчПР) КАК КосвенныеРасходыУчПР,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыУчВР) КАК КосвенныеРасходыУчВР,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыНеБУ) КАК КосвенныеРасходыНеБУ,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыНеНУ) КАК КосвенныеРасходыНеНУ,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыНеПР) КАК КосвенныеРасходыНеПР,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыНеВР) КАК КосвенныеРасходыНеВР,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыСписБУ) КАК КосвенныеРасходыСписБУ,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыСписНУ) КАК КосвенныеРасходыСписНУ,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыСписПР) КАК КосвенныеРасходыСписПР,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыСписВР) КАК КосвенныеРасходыСписВР,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыОстБУ) КАК КосвенныеРасходыОстБУ,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыОстНУ) КАК КосвенныеРасходыОстНУ,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыОстПР) КАК КосвенныеРасходыОстПР,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыОстВР) КАК КосвенныеРасходыОстВР,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыУчБУ + ВложенныйЗапрос2.КосвенныеРасходыНеБУ + ВложенныйЗапрос2.КосвенныеРасходыСписБУ + ВложенныйЗапрос2.КосвенныеРасходыОстБУ) КАК КосвенныеРасходыБУ,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыУчНУ + ВложенныйЗапрос2.КосвенныеРасходыНеНУ + ВложенныйЗапрос2.КосвенныеРасходыСписНУ + ВложенныйЗапрос2.КосвенныеРасходыОстНУ) КАК КосвенныеРасходыНУ,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыУчПР + ВложенныйЗапрос2.КосвенныеРасходыНеПР + ВложенныйЗапрос2.КосвенныеРасходыСписПР + ВложенныйЗапрос2.КосвенныеРасходыОстПР) КАК КосвенныеРасходыПР,
		|	СУММА(ВложенныйЗапрос2.КосвенныеРасходыУчВР + ВложенныйЗапрос2.КосвенныеРасходыНеВР + ВложенныйЗапрос2.КосвенныеРасходыСписВР + ВложенныйЗапрос2.КосвенныеРасходыОстВР) КАК КосвенныеРасходыВР
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Организация КАК Организация,
		|		СУММА(ВложенныйЗапрос.КосвенныеРасходыУчБУ) КАК КосвенныеРасходыУчБУ,
		|		СУММА(ВложенныйЗапрос.КосвенныеРасходыУчНУ) КАК КосвенныеРасходыУчНУ,
		|		СУММА(ВложенныйЗапрос.КосвенныеРасходыУчПР) КАК КосвенныеРасходыУчПР,
		|		СУММА(ВложенныйЗапрос.КосвенныеРасходыУчвР) КАК КосвенныеРасходыУчВР,
		|		СУММА(ВложенныйЗапрос.КосвенныеРасходыНеБУ) КАК КосвенныеРасходыНеБУ,
		|		СУММА(ВложенныйЗапрос.КосвенныеРасходыНеНУ) КАК КосвенныеРасходыНеНУ,
		|		СУММА(ВложенныйЗапрос.КосвенныеРасходыНеПР) КАК КосвенныеРасходыНеПР,
		|		СУММА(ВложенныйЗапрос.КосвенныеРасходыНеВР) КАК КосвенныеРасходыНеВР,
		|		СУММА(ВложенныйЗапрос.КосвенныеРасходыСписБУ) КАК КосвенныеРасходыСписБУ,
		|		СУММА(ВложенныйЗапрос.КосвенныеРасходыСписНУ) КАК КосвенныеРасходыСписНУ,
		|		СУММА(ВложенныйЗапрос.КосвенныеРасходыСписПР) КАК КосвенныеРасходыСписПР,
		|		СУММА(ВложенныйЗапрос.КосвенныеРасходыСписВР) КАК КосвенныеРасходыСписВР,
		|		СУММА(ВложенныйЗапрос.КосвенныеРасходыОстБУ) КАК КосвенныеРасходыОстБУ,
		|		СУММА(ВложенныйЗапрос.КосвенныеРасходыОстНУ) КАК КосвенныеРасходыОстНУ,
		|		СУММА(ВложенныйЗапрос.КосвенныеРасходыОстПР) КАК КосвенныеРасходыОстПР,
		|		СУММА(ВложенныйЗапрос.КосвенныеРасходыОстВР) КАК КосвенныеРасходыОстВР
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ХозрасчетныйОбороты.Организация КАК Организация,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаТекущихРасходовХозрасчетный)
		|						И (НЕ ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = &НеУчитываемые)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК КосвенныеРасходыУчБУ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаТекущихРасходовХозрасчетный)
		|						И (НЕ ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = &НеУчитываемые)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК КосвенныеРасходыУчНУ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаТекущихРасходовХозрасчетный)
		|						И (НЕ ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = &НеУчитываемые)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК КосвенныеРасходыУчПР,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаТекущихРасходовХозрасчетный)
		|						И (НЕ ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = &НеУчитываемые)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК КосвенныеРасходыУчвР,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаТекущихРасходовХозрасчетный)
		|						И ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = &НеУчитываемые
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК КосвенныеРасходыНеБУ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаТекущихРасходовХозрасчетный)
		|						И ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = &НеУчитываемые
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК КосвенныеРасходыНеНУ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаТекущихРасходовХозрасчетный)
		|						И ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = &НеУчитываемые
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК КосвенныеРасходыНеПР,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаТекущихРасходовХозрасчетный)
		|						И ХозрасчетныйОбороты.Субконто1.ВидРасходовНУ = &НеУчитываемые
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК КосвенныеРасходыНеВР,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхХозрасчетный)
		|						И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаКосвенныхРасходовХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаОборотКт - ХозрасчетныйОбороты.СуммаОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК КосвенныеРасходыСписБУ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхХозрасчетный)
		|						И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаКосвенныхРасходовХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаНУОборотКт - ХозрасчетныйОбороты.СуммаНУОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК КосвенныеРасходыСписНУ,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхХозрасчетный)
		|						И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаКосвенныхРасходовХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаПРОборотКт - ХозрасчетныйОбороты.СуммаПРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК КосвенныеРасходыСписПР,
		|			ВЫБОР
		|				КОГДА ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&СчетаПрямыхХозрасчетный)
		|						И ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&СчетаКосвенныхРасходовХозрасчетный)
		|					ТОГДА ХозрасчетныйОбороты.СуммаВРОборотКт - ХозрасчетныйОбороты.СуммаВРОборотДт
		|				ИНАЧЕ 0
		|			КОНЕЦ КАК КосвенныеРасходыСписВР,
		|			0 КАК КосвенныеРасходыОстБУ,
		|			0 КАК КосвенныеРасходыОстНУ,
		|			0 КАК КосвенныеРасходыОстПР,
		|			0 КАК КосвенныеРасходыОстВР
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Обороты(
		|					&НачалоПериодаТек,
		|					&КонецПериодаТек,
		|					,
		|					Счет В ИЕРАРХИИ (&СчетаХозрасчетный),
		|					&СтатьиЗатрат,
		|					Организация = &Организация
		|						И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НеЕНВД
		|						И (НЕ Субконто1.ВидРасходовНУ = &ТранспортныеРасходы),
		|					,
		|					) КАК ХозрасчетныйОбороты
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			ХозрасчетныйОстатки.Организация,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			0,
		|			ХозрасчетныйОстатки.СуммаОстатокДт,
		|			ХозрасчетныйОстатки.СуммаНУОстатокДт,
		|			ХозрасчетныйОстатки.СуммаПРОстатокДт,
		|			ХозрасчетныйОстатки.СуммаВРОстатокДт
		|		ИЗ
		|			РегистрБухгалтерии.Хозрасчетный.Остатки(
		|					&КонецПериодаТек2,
		|					Счет В ИЕРАРХИИ (&СчетаКосвенныхРасходовХозрасчетный),
		|					&СтатьиЗатрат,
		|					Организация = &Организация
		|						И Субконто1.ВидДеятельностиДляНалоговогоУчетаЗатрат = &НеЕНВД
		|						И (НЕ Субконто1.ВидРасходовНУ = &ТранспортныеРасходы)) КАК ХозрасчетныйОстатки) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Организация) КАК ВложенныйЗапрос2
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос2.Организация";
		
		Если НомерТекущейСхемы > 20 Тогда
			Запрос.УстановитьПараметр("Организация", СвойстваОрганизации.СписокОП);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "Организация В (&Организация)");
		КонецЕсли;
		
		Результат = Запрос.Выполнить();
		
		Если НомерТекущейСхемы > 20 Тогда
			СформироватьТаблицуОрганизаций(ДокументРезультат,Результат.Выгрузить(),"КосвенныеРасходы",6, НазваниеОтчета);
			Возврат;
		КонецЕсли;
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ОбластьОтчета.Параметры.Заполнить(Выборка);
		
		СоздатьРамку(Выборка, "КосвенныеРасходыУч", ОбластьОтчета, 13, 37, 60, 2, "РасшифровкаКосвенныеРасходыУч");	
		СоздатьРамку(Выборка, "КосвенныеРасходыНе", ОбластьОтчета, 52, 37, 60, 2, "РасшифровкаКосвенныеРасходыНЕ");	
		СоздатьРамку(Выборка, "КосвенныеРасходыСпис", ОбластьОтчета, 90, 37, 60, 2, "РасшифровкаКосвенныеРасходыСпис");	
		СоздатьРамку(Выборка, "КосвенныеРасходыОст", ОбластьОтчета, 30, 37, 60, 69, "РасшифровкаКосвенныеРасходыОст");	
		СоздатьРамку(Выборка, "КосвенныеРасходы", ОбластьОтчета, 17, 106, 60, 138, "РасшифровкаРасходыОбычные");
		
		ОбластьОтчета.Параметры.РасшифровкаРасходыОбычные = ПереходКСхеме(10);
		
		Массив = Новый Массив;
		Массив.Добавить(Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения);  
		Массив.Добавить(Перечисления.ВидыРасходовНУ.ТранспортныеРасходы);  
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", МассивВсехЗатрат,МассивВсехЗатратНУ,"СтатьиЗатрат","НЕ ВидРасходовНУ",Массив,,МассивРасходовБУ,МассивРасходовНУ,"ДопСубк","ВидДеятельностиДляНалоговогоУчетаЗатрат",неЕНВД);
		ОбластьОтчета.Параметры.РасшифровкаКосвенныеРасходыУч = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Косвенные расходы, учитываемые в НУ");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО", МассивВсехЗатрат,МассивВсехЗатратНУ,"СтатьиЗатрат","ВидРасходовНУ",Перечисления.ВидыРасходовНУ.НеУчитываемыеВЦеляхНалогообложения,,МассивРасходовБУ,МассивРасходовНУ,"ДопСубк","ВидДеятельностиДляНалоговогоУчетаЗатрат",неЕНВД);
		ОбластьОтчета.Параметры.РасшифровкаКосвенныеРасходыНе = ПереходКРасшифровке(ТаблицаФорматаРасшифровки,  "Косвенные расходы, не учитываемые в НУ");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО-ДО", МассивКосвенных,МассивОПРОХРНУ,"СтатьиЗатрат","ВидДеятельностиДляНалоговогоУчетаЗатрат",неЕНВД,,МассивПрямых,МассивПрямыхНУ);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КосвенныеВР", МассивКосвенных,МассивКосвенных,"СтатьиЗатрат","ВидДеятельностиДляНалоговогоУчетаЗатрат",неЕНВД,,МассивПрямых,МассивПрямыхНУ);
		ОбластьОтчета.Параметры.РасшифровкаКосвенныеРасходыСпис = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "ОПР и ОХР, списанные на прямые расходы");
		
		ТаблицаФорматаРасшифровки = СоздатьТаблицуФорматаРасшифровки();
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "СК", МассивВсехЗатрат,МассивВсехЗатратНУ,"СтатьиЗатрат","НЕ ВидРасходовНУ",Массив,,,,"ДопСубк","ВидДеятельностиДляНалоговогоУчетаЗатрат",неЕНВД);
		ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, "КО-ДО", ,МассивВсехЗатратНУ,"СтатьиЗатрат","НЕ ВидРасходовНУ",Массив,,,"Пустой");
		ОбластьОтчета.Параметры.РасшифровкаКосвенныеРасходыОст = ПереходКРасшифровке(ТаблицаФорматаРасшифровки, "Косвенные расходы, не включенные в уменьшение прибыли");
		
		Если НЕ ПоказыватьКрасныйПрямоугольник Тогда
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки1);
			ОбластьШапка.Рисунки.Удалить(ОбластьШапка.Рисунки.ПояснениеКраснойОбводки2);
		КонецЕсли;
		
		ОбластьШапка.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное + ", " + ПредставлениеПериода(НачалоМесяца(НачалоПериодаТек), КонецМесяца(КонецПериодаТек), "ФП = Истина");
		ОбластьШапка.Параметры.НазваниеОтчета = НазваниеОтчета;
		ДокументРезультат.Вывести(ОбластьШапка);
		ДокументРезультат.Вывести(ОбластьОтчета);
		
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа
		ДокументРезультат.ИмяПараметровПечати = "Анализ состояния налогового учета - " + НазваниеОтчета;
	КонецПроцедуры

// Процедура формирует список обособленных подразделений
// с суммами по одному основному показателю "НазиваниеПараметра"
Процедура	СформироватьТаблицуОрганизаций(ДокументРезультат,Результат,НазваниеПараметра,НомерСхемы,НазваниеОтчета)
		
		Макет      = ПолучитьМакет("СписокОрганизаций");
		ОбластьОтчета    = Макет.ПолучитьОбласть("Область");
		ЗаголовокОтчета  = Макет.ПолучитьОбласть("Заголовок");
		ПодвалОтчета     = Макет.ПолучитьОбласть("Подвал");
		
		ЗаголовокОтчета.Параметры.НазваниеОрганизации = Организация.НаименованиеПолное + " с обособленными подразделениями, " + ПредставлениеПериода(НачалоМесяца(НачалоПериодаТек), КонецМесяца(КонецПериодаТек), "ФП = Истина");
		ЗаголовокОтчета.Параметры.НазваниеОтчета = НазваниеОтчета;

		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
		ДокументРезультат.Вывести(ЗаголовокОтчета);
		
		
  Для Каждого Выборка ИЗ Результат Цикл
		ОбластьОтчета.Параметры.Текст = Выборка.Организация;
		ОбластьОтчета.Параметры.СуммаБУ = Выборка[НазваниеПараметра + "БУ"];
		ОбластьОтчета.Параметры.СуммаНУ = Выборка[НазваниеПараметра + "НУ"];
		ОбластьОтчета.Параметры.СуммаПР = Выборка[НазваниеПараметра + "ПР"];
		ОбластьОтчета.Параметры.СуммаВР = Выборка[НазваниеПараметра + "ВР"];
		ОбластьОтчета.Параметры.Контроль = Округлить(ОбластьОтчета.Параметры.СуммаБУ - ОбластьОтчета.Параметры.СуммаНУ - ОбластьОтчета.Параметры.СуммаПР - ОбластьОтчета.Параметры.СуммаВР);
		ОбластьОтчета.Параметры.СхемаРасшифровки = ПереходКСхеме(НомерСхемы,Выборка.Организация);
		ДокументРезультат.Вывести(ОбластьОтчета);
		
	КонецЦикла;
	
	ПодвалОтчета.Параметры.СуммаБУ = Результат.Итог(НазваниеПараметра + "БУ");
	ПодвалОтчета.Параметры.СуммаНУ = Результат.Итог(НазваниеПараметра + "НУ");
	ПодвалОтчета.Параметры.СуммаПР = Результат.Итог(НазваниеПараметра + "ПР");
	ПодвалОтчета.Параметры.СуммаВР = Результат.Итог(НазваниеПараметра + "ВР");
	
	ДокументРезультат.Вывести(ПодвалОтчета);
	
	// Присвоим имя для сохранения параметров печати табличного документа
	ДокументРезультат.ИмяПараметровПечати = "Анализ состояния налогового учета - " + НазваниеОтчета;
КонецПроцедуры

	
//////////////////////////////////////////////////////////
// ПОСТРОЕНИЕ РАСШИФРОВОК
//

// Заполнение расшифровки для перехода к режиму "Схема"
//
Функция ПереходКСхеме(НомерСхемы,ТекущаяОрганизация = Неопределено)
	
		РасшифровкаТек = Новый Соответствие;
		РасшифровкаТек.Вставить("ИмяОбъекта", "АнализСостоянияНалоговогоУчета");
		РасшифровкаТек.Вставить("НачалоПериодаТек", НачалоПериодаТек);
		РасшифровкаТек.Вставить("КонецПериодаТек", КонецПериодаТек);
		РасшифровкаТек.Вставить("Организация", ?(ТекущаяОрганизация = Неопределено, Организация, ТекущаяОрганизация));
		РасшифровкаТек.Вставить("НомерТекущейСхемы", НомерСхемы);
		РасшифровкаТек.Вставить("ВидРасшифровки", "Схема");
		РасшифровкаТек.Вставить("ВключатьОбособленныеПодразделения", СвойстваОрганизации.ЕстьОП);
		Возврат РасшифровкаТек;
КонецФункции
	
// Заполнение расшифровки для перехода к режиму "Таблица"
//
Функция ПереходКРасшифровке(ТаблицаФорматаРасшифровки, ЗаголовокТекущий = "", ДоступностьПоДокументам = Истина)
	
	РасшифровкаТек = Новый Соответствие;
		РасшифровкаТек.Вставить("ИмяОбъекта", "АнализСостоянияНалоговогоУчета");
		РасшифровкаТек.Вставить("НачалоПериодаТек", НачалоПериодаТек);
		РасшифровкаТек.Вставить("КонецПериодаТек", КонецПериодаТек);
		РасшифровкаТек.Вставить("Организация", Организация);
		РасшифровкаТек.Вставить("НомерТекущейСхемы", НомерТекущейСхемы);
		РасшифровкаТек.Вставить("ТаблицаФорматаРасшифровки", ТаблицаФорматаРасшифровки);
		РасшифровкаТек.Вставить("ЗаголовокТекущий", ЗаголовокТекущий);
		РасшифровкаТек.Вставить("ВидРасшифровки", "Отчет");
		РасшифровкаТек.Вставить("ДоступностьПоДокументам", ДоступностьПоДокументам);
		РасшифровкаТек.Вставить("ВключатьОбособленныеПодразделения", Ложь);
		Возврат РасшифровкаТек;
		
	КонецФункции

// Создание таблицы для открытия отчета в режиме "Таблица"
//
Функция СоздатьТаблицуФорматаРасшифровки()
	ТаблицаФорматаРасшифровки = Новый ТаблицаЗначений;
	ТаблицаФорматаРасшифровки.Колонки.Добавить("ВидСуммы");
	ТаблицаФорматаРасшифровки.Колонки.Добавить("Счет");
	ТаблицаФорматаРасшифровки.Колонки.Добавить("СчетДоп");
	ТаблицаФорматаРасшифровки.Колонки.Добавить("ВидСубконто");
	ТаблицаФорматаРасшифровки.Колонки.Добавить("РеквизитСубконто");
	ТаблицаФорматаРасшифровки.Колонки.Добавить("ЗначениеСубконто");
	ТаблицаФорматаРасшифровки.Колонки.Добавить("РеквизитКорСубконто");
	ТаблицаФорматаРасшифровки.Колонки.Добавить("ЗначениеКорСубконто");
	ТаблицаФорматаРасшифровки.Колонки.Добавить("Знак");
	ТаблицаФорматаРасшифровки.Колонки.Добавить("КорСчет");
	ТаблицаФорматаРасшифровки.Колонки.Добавить("КорСчетДоп");
	ТаблицаФорматаРасшифровки.Колонки.Добавить("Заголовок");
	
	Возврат ТаблицаФорматаРасшифровки;
КонецФункции
	
// Заполнение строки таблицы для открытия отчета в режиме "Таблица
//	
Процедура ДобавитьСтрокуФорматаРасшифровки(ТаблицаФорматаРасшифровки, ВидСуммы, Счет, СчетДоп, ВидСубконто = "", РеквизитСубконто = "", ЗначениеСубконто = "", Знак = "+", КорСчет = "", КорСчетДоп = "", Заголовок = "", РеквизитКорСубконто = "", ЗначениеКорСубконто = "")
	
	Строка = ТаблицаФорматаРасшифровки.Добавить();
	Строка.ВидСуммы    = ВидСуммы;
	Строка.Счет        = Счет;
	Строка.СчетДоп     = СчетДоп;
	Строка.ВидСубконто = ВидСубконто;
	
	Если ЗначениеЗаполнено(ЗначениеСубконто) Тогда
	Строка.РеквизитСубконто = РеквизитСубконто;
	Строка.ЗначениеСубконто = ЗначениеСубконто;
КонецЕсли;

	Если ЗначениеЗаполнено(ЗначениеКорСубконто) Тогда
	Строка.РеквизитКорСубконто = РеквизитКорСубконто;
	Строка.ЗначениеКорСубконто = ЗначениеКорСубконто;
КонецЕсли;

	Строка.Знак        = Знак;
	Строка.КорСчет     = КорСчет;
	Строка.КорСчетДоп  = КорСчетДоп;
	Строка.Заголовок   = Заголовок;
КонецПроцедуры

//////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ
//

// Формирует текст пояснений в таблице
//

// Формирует список номенклатурных групп использованных для отражения деятельности по ЕНВД по данным БУ
// Требуется для создания элементов отчетов, связанных с ЕНВД
//

Функция ПолучитьСписокНоменклатурныхГруппЕНВД()
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НачалоПериодаТек",     НачалоДня(НачалоПериодаТек));
		Запрос.УстановитьПараметр("КонецПериодаТек",     КонецДня(КонецПериодаТек));
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("ДоходыЕНВД", Счет90_1ЕНВД);
		Запрос.УстановитьПараметр("НоменклатурныеГруппы", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы);
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ХозрасчетныйОбороты.Субконто1,
		               |	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборот
		               |ИЗ
		               |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериодаТек, &КонецПериодаТек, , Счет В ИЕРАРХИИ (&ДоходыЕНВД), &НоменклатурныеГруппы, Организация = &Организация, , ) КАК ХозрасчетныйОбороты
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ХозрасчетныйОбороты.Субконто1";
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		Возврат Результат.ВыгрузитьКолонку("Субконто1");
	КонецФункции
	
// Формирует обводку вокруг элементов схемы
// если внутри схемы не выполняется правило БУ = НУ + ПР + ВР, то обводка красного цвета
// иначе одна не видима
//
Функция СоздатьРамку(Выборка, Сумма, ОбластьОтчета, Верх, Высота, Ширина = 65, Лево, Расшифровка, ПоказыватьЗеленый = Ложь)
	
	
	Верх = Верх - 11;
	СуммаБУ = ?(Выборка[Сумма + "БУ"] = Неопределено, 0, Окр(Выборка[Сумма + "БУ"],2));
	СуммаНУ = ?(Выборка[Сумма + "НУ"] = Неопределено, 0, Окр(Выборка[Сумма + "НУ"],2));
	СуммаПР = ?(Выборка[Сумма + "ПР"] = Неопределено, 0, Окр(Выборка[Сумма + "ПР"],2));
	СуммаВР = ?(Выборка[Сумма + "ВР"] = Неопределено, 0, Окр(Выборка[Сумма + "ВР"],2));
	
	СтроимПрямоугольник = Истина;
	Если (СуммаБУ - СуммаНУ - СуммаПР - СуммаВР < 10 И СуммаБУ - СуммаНУ - СуммаПР - СуммаВР > -10) 
		Или (Сумма = "Налог" И Выборка.НалогБУКор = 0 И СуммаНУ < 0) Тогда
		Если Не ПоказыватьЗеленый Тогда
			СтроимПрямоугольник = Ложь;
		Иначе
			ЦветЛинии = WebЦвета.Зеленый
		КонецЕсли;
	Иначе
		ПоказыватьКрасныйПрямоугольник = Истина;
		ЦветЛинии = WebЦвета.Красный
	КонецЕсли;
	
	Если СтроимПрямоугольник Тогда
		НовыйРисунок = ОбластьОтчета.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
		НовыйРисунок.ЦветЛинии = ЦветЛинии;
		ПоказыватьГраницы = Истина;
		НовыйРисунок.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 2);
	Иначе
		НовыйРисунок = ОбластьОтчета.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
		ПоказыватьГраницы = Ложь;
		
	КонецЕсли;
	
	НовыйРисунок.ГраницаСлева  = ПоказыватьГраницы;
	НовыйРисунок.ГраницаСправа = ПоказыватьГраницы;
	НовыйРисунок.ГраницаСверху = ПоказыватьГраницы;
	НовыйРисунок.ГраницаСнизу = ПоказыватьГраницы;
	НовыйРисунок.ЦветФона = Новый Цвет;
	НовыйРисунок.Верх  = Верх;
	НовыйРисунок.Высота  = Высота;
	НовыйРисунок.Ширина = Ширина;
	НовыйРисунок.Лево = Лево;
	НовыйРисунок.ПараметрРасшифровки = Расшифровка;
	НовыйРисунок.Защита = Истина;
	
КонецФункции


Функция СоздатьПояснение(Строка,Выборка,ВидСуммы,ЗначениеСубконто,РеквизитСубконто,НеЗначениеСубконто)
				
					Заголовок = ?(Строка.Знак = "-" , "- ", "");
					
					Если ВидСуммы = "СН" Или ВидСуммы = "СальдоНормируемых" Тогда
						Заголовок = Заголовок + "Счет " + Выборка.Счет + " сальдо на начало";
					ИначеЕсли ВидСуммы = "СК" Тогда
						Заголовок = Заголовок + "Счет " + Выборка.Счет + " сальдо на конец";
					ИначеЕсли ВидСуммы = "ДО" Тогда
						Заголовок = Заголовок + " Дт счета " + Выборка.Счет;
						Если ЗначениеЗаполнено(Выборка.КорСчет) Тогда
							Заголовок =  Заголовок + " Кт счета " + Выборка.КорСчет;
						КонецЕсли;
					ИначеЕсли ВидСуммы = "КО" Тогда
						Если ЗначениеЗаполнено(Выборка.КорСчет) Тогда
							Заголовок =  Заголовок + " Дт счета " + Выборка.КорСчет;
						КонецЕсли;
							Заголовок =  Заголовок + " Кт счета " + Выборка.Счет;
					ИначеЕсли ВидСуммы = "КО-ДО" И Не Строка.КорСчет = "Пустой" Тогда
							Заголовок =  " Дт счета " + Выборка.КорСчет + " Кт счета " + Выборка.Счет +"
							             |-Дт счета " + Выборка.Счет + " Кт счета " + Выборка.КорСчет;
					ИначеЕсли ВидСуммы = "КО-ДО" И Строка.КорСчет = "Пустой" Тогда
							Заголовок =  " Дт счета ПУСТОЙ Кт счета " + Выборка.Счет +"
							             |-Дт счета " + Выборка.Счет + " Кт счета ПУСТОЙ";					 
					ИначеЕсли ВидСуммы = "КосвенныеВР" Тогда
							Заголовок =  "Временные разницы по косвенным расходам НУ
							             | Дт счета " + Выборка.КорСчет + " Кт счета " + Выборка.Счет +"
							             |-Дт счета " + Выборка.Счет + " Кт счета " + Выборка.КорСчет;
					ИначеЕсли ВидСуммы = "Косвенные20" Или ВидСуммы = "-Косвенные20" Тогда
							Заголовок =  "Разницы по расходам прямым в БУ и косвенным в НУ
							             | Дт счета " + Выборка.КорСчет + " Кт счета " + Выборка.Счет +"
							             |-Дт счета " + Выборка.Счет + " Кт счета " + Выборка.КорСчет;
					Иначе
						Заголовок = "";
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ЗначениеСубконто) И НЕ ТипЗнч(ЗначениеСубконто) = Тип("Массив")  Тогда
						Заголовок = Заголовок + " по " + ?(НеЗначениеСубконто, "НЕ ","") + РеквизитСубконто + " = " + ЗначениеСубконто;
					КонецЕсли;
					
					Если Строка.Знак = "НЕЕНВД" Тогда
						СтрокаНомГрупп = "";
						Для Сч = 0 По НоменклатурныеГруппыЕНВД.Количество() - 1 Цикл
							СтрокаНомГрупп = СТрокаНомГрупп + НоменклатурныеГруппыЕНВД.Получить(Сч) + ", ";
						КонецЦикла;
						Если Не СтрокаНомГрупп = "" Тогда
							Заголовок = Заголовок + "
							|За исключением ном.групп: " +  СтрокаНомГрупп;
						КонецЕсли;
						
					КонецЕсли;
					
					Если Строка.Знак = "ЕНВД" Тогда
						СтрокаНомГрупп = "";
						Для Сч = 0 По НоменклатурныеГруппыЕНВД.Количество() - 1 Цикл
							СтрокаНомГрупп = СТрокаНомГрупп + НоменклатурныеГруппыЕНВД.Получить(Сч) + ", ";
						КонецЦикла;
						Если Не СтрокаНомГрупп = "" Тогда
							Заголовок = Заголовок + "
							|Ном.группы: " +  СтрокаНомГрупп;
						КонецЕсли;
						
					КонецЕсли;
					
					
					Возврат Заголовок;
					
				КонецФункции
				
Функция Округлить(Параметр, Погрешность = 0.05)
	Если (Параметр > - Погрешность И Параметр < Погрешность) Тогда		
		Возврат 0;
	Иначе
		Возврат Параметр
	КонецЕсли;
	
КонецФункции


НП = Новый НастройкаПериода;
НП.ВариантНастройки = ВариантНастройкиПериода.Период;

#КонецЕсли

