
Перем СохраненнаяНастройка Экспорт;        // Текущий вариант отчета

Перем ТаблицаВариантовОтчета Экспорт;      // Таблица вариантов доступных текущему пользователю

Перем ДанныеОФизЛицеОрганизации, ВыборкаНалогиНачисленныеИтоги, ВыборкаНалогиПоМесяцаПоРазделам, ВыборкаНалогиУдержанныеИтоги, ВыборкаНалогиВзысканиеИтоги;
Перем ВыборкаНалогиВозвращенныеИтоги, ВыборкаНалогиПомесяцамПоСтавкам, ВыборкаСальдоРасчетовНаНачалоГода, ДанныеОПредоставленныхСправках, ВыборкаВычетыИтоги, ВыборкаНалогиИтоги;
Перем ВыборкаВычетыПоМесяцамПоВидам, ВыборкаНалогиПеречисленныеИтоги, ДатаНачалаНП, ДатаКонцаНП, ДатаАктуальности, КодПоОКАТО, ДатаПодписи, Ответственный, ПервыйРаз, СводноПоКодамОКАТО;
Перем ВыборкаСтандартныеВычеты, ВыборкаСоциальныеВычеты, ВыборкаСправкиНДФЛ, ВыборкаУведомления, ВыборкаСтатусов, ВыборкаНалогНачисленныйПоСтавке13, ВыборкаВычетовПоСтавке13; 

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ВывестиГруппировку(ДокументРезультат, СтрокаДанных, Поле, Уровень)
	
	МакетГруппировки  = ПолучитьМакет("МакетГруппировки");
	ОбластьГрупировки = МакетГруппировки.ПолучитьОбласть("Группировка");
	
	ДоступноеПоле = ТиповыеОтчеты.ПолучитьДоступноеПоле(Новый ПолеКомпоновкиДанных(Поле), КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок);
	
	ОбластьГрупировки.Параметры.НазваниеПарметра = ДоступноеПоле.Заголовок;
	ОбластьГрупировки.Параметры.Значение = СтрокаДанных[СтрЗаменить(Поле, ".", "")];
	
	ДокументРезультат.Вывести(ОбластьГрупировки, Уровень+1);
	
КонецПроцедуры 

Процедура ВывестиКарточки(ДокументРезультат, СтрокиДеревоДанных, Уровень, Группировки, ЕстьОшибки)
	
	#Если Клиент Тогда
		
		//выбрать карточки
		Для каждого СтрокаДерева из СтрокиДеревоДанных Цикл
			Если (Группировки.Количество() - 1) >= Уровень тогда 
				//Нарисовать группировку
				ВывестиГруппировку(ДокументРезультат, СтрокаДерева, Группировки.Получить(Уровень).Значение, Уровень);
				Если Группировки.Количество()-1 >= Уровень+1 тогда
					ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				ВывестиКарточки(ДокументРезультат, СтрокаДерева.Строки, Уровень+1, Группировки, ЕстьОшибки);
				
			Иначе			//Нарисовать карточку физлица
				//СформироватьМакет(ДокументРезультат, СтрокаДерева.ФизЛицо, СтрокаДерева.Год, СтрокаДерева.Организация, СтрокаДерева.ГоловнаяОрганизация, Уровень);
				СформироватьМакет(ДокументРезультат, СтрокаДерева.ФизЛицо, СтрокаДерева.Год,  СтрокаДерева.ГоловнаяОрганизация, Уровень);
				
			КонецЕсли;
		КонецЦикла;
		
	#КонецЕсли
	
КонецПроцедуры

Процедура ПолучитьДанныеДляПостроенияОтчета(СписокФизЛицОрганизация)
	
	ДатаНачалаНП = ТиповыеОтчеты.ПолучитьПараметр(КомпоновщикНастроек, "НачалоПериода").Значение;
	ДатаКонцаНП  = ТиповыеОтчеты.ПолучитьПараметр(КомпоновщикНастроек, "КонецПериода").Значение;
	ДатаПодписи  = ТиповыеОтчеты.ПолучитьПараметр(КомпоновщикНастроек, "ДатаПодписи").Значение;
	Если ДатаПодписи = Неопределено или ДатаПодписи = '00010101' тогда
		ДатаПодписи = ОбщегоНазначения.ПолучитьРабочуюДату();
	КонецЕсли;

	СводноПоКодамОКАТО = ПустаяСтрока(КодПоОКАТО);
	
	// Массив кодов доходов, отражаемых в разделе 7: Доходы от продажи имущества
	МассивКодовДоходовРаздела7 = Новый Массив;
	МассивКодовДоходовРаздела7.Добавить(Справочники.ДоходыНДФЛ.Код1530);
	МассивКодовДоходовРаздела7.Добавить(Справочники.ДоходыНДФЛ.Код2210);
	
	ФизЛицоОтветственного = ?(Ответственный = Неопределено, Справочники.ФизическиеЛица.ПустаяСсылка(), Ответственный.ФизЛицо);
	
	// Создание запроса и установка всех необходимых параметров
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	Запрос.УстановитьПараметр("ФизлицоОтветственного", ФизЛицоОтветственного);
	Запрос.УстановитьПараметр("НачалоНП", ДатаНачалаНП);
	Запрос.УстановитьПараметр("КонецНП", ДатаКонцаНП);
	Запрос.УстановитьПараметр("ПоследнийМесяцНП", НачалоМесяца(ДатаКонцаНП));
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаПодписи);
	Запрос.УстановитьПараметр("МассивКодовДоходовРаздела7", МассивКодовДоходовРаздела7);
	Запрос.УстановитьПараметр("ПустойКодПоОКАТО","");
	Запрос.УстановитьПараметр("ПустойКПП","");
	Запрос.УстановитьПараметр("СписокФизЛицОрганизация", СписокФизЛицОрганизация);
	
	
	// Сформируем текст запроса с датами месяцев налогового периода
	// первый месяц
	КонецМесяца = КонецМесяца(ДатаНачалаНП);
	ПериодыТекст = "ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат (КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ") КАК Период";
	ПериодыТекст = ПериодыТекст + "
	|ПОМЕСТИТЬ ВТПериоды";
	// прибавим остальные месяцы
	Для Сч = 2 По 12 Цикл
		КонецМесяца = КонецМесяца(КонецМесяца+1);
    	ПериодыТекст = ПериодыТекст +" ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ ДАТАВРЕМЯ(" + Формат(КонецМесяца,"ДФ=гггг,М,д,Ч,м,с") + ")";
	КонецЦикла;
	ПериодыТекст = ПериодыТекст + "
	|ИНДЕКСИРОВАТЬ ПО Период";
	
	Запрос.Текст = ПериодыТекст;
	Запрос.Выполнить();

	//-----------------------------------------------------------------------------
	// ВЫБОРКА СВЕДЕНИЙ ОБ ОРГАНИЗАЦИИ И ФИЗЛИЦЕ (Данные разделов 1 и 2)
	// 	
	
	//ДанныеОбОрганизацииИФизлицеТекст
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизЛицаОганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ФизЛицаОганизация.Организация,
	|	ФизЛицаОганизация.ФизЛицо КАК ФизЛицо,
	|	ФизЛицаОганизация.Год КАК Год,
	|	ФизЛицаОганизация.НеОтбиратьПоОП
	|ПОМЕСТИТЬ ВТСписокФизЛицОрганизация
	|ИЗ
	|	&СписокФизЛицОрганизация КАК ФизЛицаОганизация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	ГоловнаяОрганизация,
	|	Год
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	ВТСписокФизЛицОрганизация.ФизЛицо,
	|	ВТСписокФизЛицОрганизация.Год,
	|	ВЫБОР
	|		КОГДА Организации.Ссылка ЕСТЬ NULL 
	|			ТОГДА ВТСписокФизЛицОрганизация.Организация
	|		ИНАЧЕ Организации.Ссылка
	|	КОНЕЦ КАК Организация
	|ПОМЕСТИТЬ ВТОбособленныеПодразделения
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ВТСписокФизЛицОрганизация.ГоловнаяОрганизация = Организации.ГоловнаяОрганизация
	|			И (ВТСписокФизЛицОрганизация.НеОтбиратьПоОП)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТСписокФизЛицОрганизация.ГоловнаяОрганизация,
	|	ВТСписокФизЛицОрганизация.ФизЛицо,
	|	ВТСписокФизЛицОрганизация.Год,
	|	ВТСписокФизЛицОрганизация.Организация
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГражданствоФизЛицаСрезПоследних.Год КАК Год,
	|	ГражданствоФизЛицаСрезПоследних.Физлицо КАК ФизЛицо,
	|	ГражданствоФизЛица.Страна
	|ПОМЕСТИТЬ ВТГражданствоФизЛиц
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Год КАК Год,
	|		Периоды.Физлицо КАК Физлицо,
	|		МАКСИМУМ(ГражданствоФизЛица.Период) КАК ПериодСреза
	|	ИЗ
	|		(ВЫБРАТЬ
	|			МАКСИМУМ(Периоды.Период) КАК КонецНалоговогоПериода,
	|			СписокФизЛицОрганизация.Год КАК Год,
	|			СписокФизЛицОрганизация.ФизЛицо КАК Физлицо
	|		ИЗ
	|			ВТПериоды КАК Периоды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|				ПО (ГОД(Периоды.Период) = СписокФизЛицОрганизация.Год)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СписокФизЛицОрганизация.Год,
	|			СписокФизЛицОрганизация.ФизЛицо) КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛица
	|			ПО Периоды.КонецНалоговогоПериода >= ГражданствоФизЛица.Период
	|				И Периоды.Физлицо = ГражданствоФизЛица.ФизЛицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Физлицо,
	|		Периоды.Год) КАК ГражданствоФизЛицаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛица
	|		ПО ГражданствоФизЛицаСрезПоследних.ПериодСреза = ГражданствоФизЛица.Период
	|			И ГражданствоФизЛицаСрезПоследних.Физлицо = ГражданствоФизЛица.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Год
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусФизЛицаСрезПоследних.Год КАК Год,
	|	СтатусФизЛицаСрезПоследних.Физлицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) <> ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЯвляетсяНалоговымРезидентомРФ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) <> ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИспользоватьИностранныйАдрес
	|ПОМЕСТИТЬ ВТСтатусыФизЛицНаКонецНалоговогоПериода
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Год КАК Год,
	|		Периоды.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СтатусФизЛица.Период) КАК ПериодСреза
	|	ИЗ
	|		(ВЫБРАТЬ
	|			МАКСИМУМ(Периоды.Период) КАК КонецНалоговогоПериода,
	|			СписокФизЛицОрганизация.Год КАК Год,
	|			СписокФизЛицОрганизация.ФизЛицо КАК Физлицо
	|		ИЗ
	|			ВТПериоды КАК Периоды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|				ПО (ГОД(Периоды.Период) = СписокФизЛицОрганизация.Год)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СписокФизЛицОрганизация.Год,
	|			СписокФизЛицОрганизация.ФизЛицо) КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизЛицКакНалогоплательщиковНДФЛ КАК СтатусФизЛица
	|			ПО Периоды.КонецНалоговогоПериода >= СтатусФизЛица.Период
	|				И Периоды.Физлицо = СтатусФизЛица.ФизЛицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Физлицо,
	|		Периоды.Год) КАК СтатусФизЛицаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизЛицКакНалогоплательщиковНДФЛ КАК СтатусФизЛица
	|		ПО СтатусФизЛицаСрезПоследних.ПериодСреза = СтатусФизЛица.Период
	|			И СтатусФизЛицаСрезПоследних.Физлицо = СтатусФизЛица.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Год
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусФизЛицаСрезПоследних.Месяц КАК Месяц,
	|	СтатусФизЛицаСрезПоследних.Физлицо КАК ФизЛицо,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|			ТОГДА 1
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|			ТОГДА 2
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.УчастникПрограммыПоПереселениюСоотечественников)
	|			ТОГДА 2
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.ВысококвалифицированныйИностранныйСпециалист)
	|			ТОГДА 3
	|	КОНЕЦ КАК Статус,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)
	|			ТОГДА ИСТИНА
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент)
	|			ТОГДА ЛОЖЬ
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.ВысококвалифицированныйИностранныйСпециалист)
	|			ТОГДА ИСТИНА
	|		КОГДА ЕСТЬNULL(СтатусФизЛица.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.Резидент)) = ЗНАЧЕНИЕ(Перечисление.СтатусыНалогоплательщиковПоНДФЛ.УчастникПрограммыПоПереселениюСоотечественников)
	|			ТОГДА ИСТИНА
	|	КОНЕЦ КАК ЯвляетсяРезидентомРФ
	|ПОМЕСТИТЬ ВТСтатусФизЛицНаКонецМесяца
	|ИЗ
	|	(ВЫБРАТЬ
	|		Периоды.Месяц КАК Месяц,
	|		Периоды.Физлицо КАК Физлицо,
	|		МАКСИМУМ(СтатусФизЛица.Период) КАК ПериодСреза
	|	ИЗ
	|		(ВЫБРАТЬ
	|			Периоды.Период КАК Месяц,
	|			СписокФизЛицОрганизация.ФизЛицо КАК Физлицо
	|		ИЗ
	|			ВТПериоды КАК Периоды
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|				ПО (ГОД(Периоды.Период) = СписокФизЛицОрганизация.Год)) КАК Периоды
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизЛицКакНалогоплательщиковНДФЛ КАК СтатусФизЛица
	|			ПО Периоды.Месяц >= СтатусФизЛица.Период
	|				И Периоды.Физлицо = СтатусФизЛица.ФизЛицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Периоды.Физлицо,
	|		Периоды.Месяц) КАК СтатусФизЛицаСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусФизЛицКакНалогоплательщиковНДФЛ КАК СтатусФизЛица
	|		ПО СтатусФизЛицаСрезПоследних.ПериодСреза = СтатусФизЛица.Период
	|			И СтатусФизЛицаСрезПоследних.Физлицо = СтатусФизЛица.ФизЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо,
	|	Месяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(СписокФизЛиц.Месяц, МЕСЯЦ) КАК Месяц,
	|	СписокФизЛиц.Физлицо,
	|	ВЫБОР
	|		КОГДА ВТСтатусФизЛицНаКонецНалоговогоПериода.ЯвляетсяНалоговымРезидентомРФ
	|			ТОГДА ВТСтатусФизЛицНаКонецМесяца.ЯвляетсяРезидентомРФ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЯвляетсяРезидентомРФ
	|ПОМЕСТИТЬ ВТСтатусыФизЛицПоМесяцам
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Периоды.Период КАК Месяц,
	|		СписокФизЛицОрганизация.ФизЛицо КАК Физлицо
	|	ИЗ
	|		ВТПериоды КАК Периоды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|			ПО (ГОД(Периоды.Период) = СписокФизЛицОрганизация.Год)) КАК СписокФизЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусФизЛицНаКонецМесяца КАК ВТСтатусФизЛицНаКонецМесяца
	|		ПО СписокФизЛиц.Месяц = ВТСтатусФизЛицНаКонецМесяца.Месяц
	|			И СписокФизЛиц.Физлицо = ВТСтатусФизЛицНаКонецМесяца.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК ВТСтатусФизЛицНаКонецНалоговогоПериода
	|		ПО СписокФизЛиц.Физлицо = ВТСтатусФизЛицНаКонецНалоговогоПериода.ФизЛицо
	|			И (ГОД(СписокФизЛиц.Месяц) = ВТСтатусФизЛицНаКонецНалоговогоПериода.Год)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СписокФизЛицОрганизация.ФизЛицо КАК ФизЛицо,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	СписокФизЛицОрганизация.Год КАК Год,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация.ИНН КАК Организация_ИНН,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация.КПП КАК Организация_КПП,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация.КодИМНС КАК Организация_КодИМНС,
	|	СписокФизЛицОрганизация.ГоловнаяОрганизация.КодПоОКАТО КАК Организация_КодПоОКАТО,
	|	ВЫБОР
	|		КОГДА СписокФизЛицОрганизация.ГоловнаяОрганизация.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			ТОГДА СписокФизЛицОрганизация.ГоловнаяОрганизация.НаименованиеПолное
	|		ИНАЧЕ ФИОПредпринимателя.Фамилия + "" "" + ФИОПредпринимателя.Имя + "" "" + ФИОПредпринимателя.Отчество
	|	КОНЕЦ КАК Организация_Наименование,
	|	ДанныеОФизЛице.ИНН КАК ФизЛицо_ИНН,
	|	ЕСТЬNULL(ФИОФизЛица.Фамилия + "" "" + ФИОФизЛица.Имя + "" "" + ФИОФизЛица.Отчество, ДанныеОФизЛице.Наименование) КАК ФизЛицо_ФИО,
	|	ЕСТЬNULL(ФИОФизлицаОтветственного.Фамилия + "" "" + ФИОФизлицаОтветственного.Имя + "" "" + ФИОФизлицаОтветственного.Отчество, ЕСТЬNULL(ДанныеОбОтветственном.ФизЛицо.Наименование, ДанныеОбОтветственном.Наименование)) КАК Ответственный_ФИО,
	|	ДолжностьОтветственного.Должность.Наименование КАК Ответственный_Должность,
	|	ПаспортныеДанныеФизЛица.ДокументВид.КодИМНС КАК ФизЛицо_КодДокументаУдЛичн,
	|	ПаспортныеДанныеФизЛица.ДокументСерия + "" "" + ПаспортныеДанныеФизЛица.ДокументНомер КАК ФизЛицо_СерияНомерДокументаУдЛичн,
	|	ДанныеОФизЛице.ДатаРождения КАК ФизЛицо_ДатаРождения,
	|	ЕСТЬNULL(ГражданствоФизЛица.Страна.Код, ""643"") КАК ФизЛицо_КодСтраны,
	|	НДФЛДоходыПредыдущегоМестаРаботы.Размер КАК ФизЛицо_ДоходыПредыдущегоМестаРаботы,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ИспользоватьИностранныйАдрес
	|			ТОГДА Страны.Код
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФизЛицо_АдресКодСтраны,
	|	АдресРегистрацииФизЛица.Поле1 КАК ФизЛицо_АдресИндекс,
	|	РегионРегистрацииФизЛица.Код КАК ФизЛицо_АдресРегион,
	|	АдресРегистрацииФизЛица.Поле3 КАК ФизЛицо_АдресРайон,
	|	АдресРегистрацииФизЛица.Поле4 КАК ФизЛицо_АдресГород,
	|	АдресРегистрацииФизЛица.Поле5 КАК ФизЛицо_АдресНаселенныйПункт,
	|	АдресРегистрацииФизЛица.Поле6 КАК ФизЛицо_АдресУлица,
	|	АдресРегистрацииФизЛица.Поле7 КАК ФизЛицо_АдресДом,
	|	АдресРегистрацииФизЛица.Поле8 КАК ФизЛицо_АдресКорпус,
	|	АдресРегистрацииФизЛица.Поле9 КАК ФизЛицо_АдресКвартира,
	|	ВЫБОР
	|		КОГДА СтатусыФизЛицНаКонецНалоговогоПериода.ИспользоватьИностранныйАдрес
	|			ТОГДА АдресаИностранцев.Представление
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ФизЛицо_ИностранныйАдрес
	|ИЗ
	|	ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|				&ДатаАктуальности,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						ФизЛица.ГоловнаяОрганизация.ИндивидуальныйПредприниматель
	|					ИЗ
	|						ВТСписокФизЛицОрганизация КАК ФизЛица)) КАК ФИОПредпринимателя
	|		ПО (ФИОПредпринимателя.ФизЛицо = СписокФизЛицОрганизация.ГоловнаяОрганизация.ИндивидуальныйПредприниматель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ДанныеОФизЛице
	|		ПО (ДанныеОФизЛице.Ссылка = СписокФизЛицОрганизация.ФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК ДанныеОбОтветственном
	|		ПО (ДанныеОбОтветственном.Ссылка = &Ответственный)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|				&ДатаАктуальности,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						ФизЛица.ФизЛицо
	|					ИЗ
	|						ВТСписокФизЛицОрганизация КАК ФизЛица)) КАК ФИОФизЛица
	|		ПО (ФИОФизЛица.ФизЛицо = СписокФизЛицОрганизация.ФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаАктуальности, ФизЛицо = &ФизЛицоОтветственного) КАК ФИОФизлицаОтветственного
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(
	|				&ДатаАктуальности,
	|				ФизЛицо В
	|					(ВЫБРАТЬ
	|						ФизЛица.ФизЛицо
	|					ИЗ
	|						ВТСписокФизЛицОрганизация КАК ФизЛица)) КАК ПаспортныеДанныеФизЛица
	|		ПО (ПаспортныеДанныеФизЛица.ФизЛицо = СписокФизЛицОрганизация.ФизЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданствоФизЛиц КАК ГражданствоФизЛица
	|		ПО СписокФизЛицОрганизация.ФизЛицо = ГражданствоФизЛица.ФизЛицо
	|			И СписокФизЛицОрганизация.Год = ГражданствоФизЛица.Год
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресРегистрацииФизЛица
	|		ПО (ДанныеОФизЛице.Ссылка = АдресРегистрацииФизЛица.Объект)
	|			И (АдресРегистрацииФизЛица.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресФизЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныйКлассификатор КАК РегионРегистрацииФизЛица
	|		ПО (РегионРегистрацииФизЛица.ТипАдресногоЭлемента = 1)
	|			И (РегионРегистрацииФизЛица.Наименование + "" "" + РегионРегистрацииФизЛица.Сокращение = АдресРегистрацииФизЛица.Поле2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресаИностранцев
	|		ПО (ДанныеОФизЛице.Ссылка = АдресаИностранцев.Объект)
	|			И (АдресаИностранцев.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ИнострАдресФизЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК Страны
	|		ПО (Страны.Наименование = АдресаИностранцев.Поле1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛДоходыПредыдущегоМестаРаботы КАК НДФЛДоходыПредыдущегоМестаРаботы
	|		ПО СписокФизЛицОрганизация.ФизЛицо = НДФЛДоходыПредыдущегоМестаРаботы.ФизЛицо
	|			И СписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛДоходыПредыдущегоМестаРаботы.Организация
	|			И (СписокФизЛицОрганизация.Год = ГОД(НДФЛДоходыПредыдущегоМестаРаботы.МесяцНалоговогоПериода))
	|			И (МЕСЯЦ(НДФЛДоходыПредыдущегоМестаРаботы.МесяцНалоговогоПериода) = 12)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&ДатаАктуальности,
	|				Сотрудник.ФизЛицо = &ФизЛицоОтветственного
	|					И Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство)) КАК ДолжностьОтветственного
	|		ПО (ДолжностьОтветственного.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение))
	|			И (ДолжностьОтветственного.Организация = СписокФизЛицОрганизация.ГоловнаяОрганизация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицНаКонецНалоговогоПериода КАК СтатусыФизЛицНаКонецНалоговогоПериода
	|		ПО СписокФизЛицОрганизация.ФизЛицо = СтатусыФизЛицНаКонецНалоговогоПериода.ФизЛицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГоловнаяОрганизация,
	|	ФизЛицо,
	|	Год";
	
	ДанныеОФизЛицеОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПримененияВычетовСрезПоследних.ФизЛицо КАК ФизЛицо,
	               |	ПримененияВычетовСрезПоследних.Месяц КАК Месяц,
	               |	ПримененияВычетовСрезПоследних.ЯвляетсяРезидентомРФ,
	               |	НДФЛПрименениеВычетов.Организация КАК Организация
	               |ПОМЕСТИТЬ ВТПрименениеВычетовВМесяцаРезидентства
	               |ИЗ
	               |	РегистрСведений.НДФЛПрименениеВычетов КАК НДФЛПрименениеВычетов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВТСтатусФизЛицНаКонецМесяца.ФизЛицо КАК ФизЛицо,
	               |			НАЧАЛОПЕРИОДА(ВТСтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ) КАК Месяц,
	               |			МАКСИМУМ(НДФЛПрименениеВычетов.Период) КАК Период,
	               |			ВТСтатусФизЛицНаКонецМесяца.ЯвляетсяРезидентомРФ КАК ЯвляетсяРезидентомРФ
	               |		ИЗ
	               |			ВТСтатусФизЛицНаКонецМесяца КАК ВТСтатусФизЛицНаКонецМесяца
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛПрименениеВычетов КАК НДФЛПрименениеВычетов
	               |				ПО ВТСтатусФизЛицНаКонецМесяца.ФизЛицо = НДФЛПрименениеВычетов.Физлицо
	               |					И ВТСтатусФизЛицНаКонецМесяца.Месяц >= НДФЛПрименениеВычетов.Период
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВТСтатусФизЛицНаКонецМесяца.ФизЛицо,
	               |			ВТСтатусФизЛицНаКонецМесяца.ЯвляетсяРезидентомРФ,
	               |			НАЧАЛОПЕРИОДА(ВТСтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ)) КАК ПримененияВычетовСрезПоследних
	               |		ПО НДФЛПрименениеВычетов.Физлицо = ПримененияВычетовСрезПоследних.ФизЛицо
	               |			И НДФЛПрименениеВычетов.Период = ПримененияВычетовСрезПоследних.Период
	               |ГДЕ
	               |	ПримененияВычетовСрезПоследних.ЯвляетсяРезидентомРФ
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ФизЛицо,
	               |	Месяц,
	               |	Организация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтандартныеВычетыСрезПоследних.ФизЛицо КАК ФизЛицо,
	               |	СтандартныеВычетыСрезПоследних.Месяц КАК Месяц,
	               |	НДФЛСтандартныеВычетыФизлиц.КодВычетаЛичный КАК КодВычетаЛичный,
	               |	NULL КАК КоличествоДетей,
	               |	НДФЛСтандартныеВычетыФизлиц.Основание
	               |ПОМЕСТИТЬ ВТСтандартныеВычетыПоМесяцамРезидениства
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТРезидентствоФизЛиц.ФизЛицо КАК ФизЛицо,
	               |		НАЧАЛОПЕРИОДА(ВТРезидентствоФизЛиц.Месяц, МЕСЯЦ) КАК Месяц,
	               |		МАКСИМУМ(НДФЛСтандартныеВычетыФизлиц.Период) КАК Период
	               |	ИЗ
	               |		ВТПрименениеВычетовВМесяцаРезидентства КАК ВТРезидентствоФизЛиц
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыФизлиц КАК НДФЛСтандартныеВычетыФизлиц
	               |			ПО ВТРезидентствоФизЛиц.ФизЛицо = НДФЛСтандартныеВычетыФизлиц.Физлицо
	               |				И (НАЧАЛОПЕРИОДА(ВТРезидентствоФизЛиц.Месяц, МЕСЯЦ) >= НДФЛСтандартныеВычетыФизлиц.Период)
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТРезидентствоФизЛиц.ФизЛицо,
	               |		НАЧАЛОПЕРИОДА(ВТРезидентствоФизЛиц.Месяц, МЕСЯЦ)) КАК СтандартныеВычетыСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыФизлиц КАК НДФЛСтандартныеВычетыФизлиц
	               |		ПО СтандартныеВычетыСрезПоследних.ФизЛицо = НДФЛСтандартныеВычетыФизлиц.Физлицо
	               |			И СтандартныеВычетыСрезПоследних.Период = НДФЛСтандартныеВычетыФизлиц.Период
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СтандартныеВычетыНаДетейСрезПоследних.ФизЛицо,
	               |	СтандартныеВычетыНаДетейСрезПоследних.Месяц,
	               |	НДФЛСтандартныеВычетыНаДетей.КодВычета,
	               |	ВЫБОР
	               |		КОГДА НДФЛСтандартныеВычетыНаДетей.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				И НДФЛСтандартныеВычетыНаДетей.ПериодЗавершения < НАЧАЛОПЕРИОДА(СтандартныеВычетыНаДетейСрезПоследних.Месяц, МЕСЯЦ)
	               |			ТОГДА НДФЛСтандартныеВычетыНаДетей.КоличествоДетейЗавершения
	               |		ИНАЧЕ НДФЛСтандартныеВычетыНаДетей.КоличествоДетей
	               |	КОНЕЦ,
	               |	НДФЛСтандартныеВычетыНаДетей.Основание
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТРезидентствоФизЛиц.ФизЛицо КАК ФизЛицо,
	               |		НАЧАЛОПЕРИОДА(ВТРезидентствоФизЛиц.Месяц, МЕСЯЦ) КАК Месяц,
	               |		МАКСИМУМ(НДФЛСтандартныеВычетыНаДетей.Период) КАК Период,
	               |		НДФЛСтандартныеВычетыНаДетей.КодВычета КАК КодВычета
	               |	ИЗ
	               |		ВТПрименениеВычетовВМесяцаРезидентства КАК ВТРезидентствоФизЛиц
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыНаДетей КАК НДФЛСтандартныеВычетыНаДетей
	               |			ПО ВТРезидентствоФизЛиц.ФизЛицо = НДФЛСтандартныеВычетыНаДетей.Физлицо
	               |				И (НАЧАЛОПЕРИОДА(ВТРезидентствоФизЛиц.Месяц, МЕСЯЦ) >= НДФЛСтандартныеВычетыНаДетей.Период)
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТРезидентствоФизЛиц.ФизЛицо,
	               |		НДФЛСтандартныеВычетыНаДетей.КодВычета,
	               |		НАЧАЛОПЕРИОДА(ВТРезидентствоФизЛиц.Месяц, МЕСЯЦ)) КАК СтандартныеВычетыНаДетейСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛСтандартныеВычетыНаДетей КАК НДФЛСтандартныеВычетыНаДетей
	               |		ПО СтандартныеВычетыНаДетейСрезПоследних.ФизЛицо = НДФЛСтандартныеВычетыНаДетей.Физлицо
	               |			И СтандартныеВычетыНаДетейСрезПоследних.КодВычета = НДФЛСтандартныеВычетыНаДетей.КодВычета
	               |			И СтандартныеВычетыНаДетейСрезПоследних.Период = НДФЛСтандартныеВычетыНаДетей.Период
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ФизЛицо,
	               |	Месяц,
	               |	КодВычетаЛичный
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТПрименениеВычетовВМесяцаРезидентства.ФизЛицо,
	               |	ВТПрименениеВычетовВМесяцаРезидентства.Месяц,
	               |	ВТПрименениеВычетовВМесяцаРезидентства.Организация,
	               |	ВТСтандартныеВычетыПоМесяцамРезидениства.КодВычетаЛичный КАК КодВычета,
	               |	ВТСтандартныеВычетыПоМесяцамРезидениства.КоличествоДетей,
	               |	ВТСтандартныеВычетыПоМесяцамРезидениства.Основание
	               |ПОМЕСТИТЬ ВТСтандартныеВычетыФизЛицОрганизации
	               |ИЗ
	               |	ВТПрименениеВычетовВМесяцаРезидентства КАК ВТПрименениеВычетовВМесяцаРезидентства
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСтандартныеВычетыПоМесяцамРезидениства КАК ВТСтандартныеВычетыПоМесяцамРезидениства
	               |		ПО ВТПрименениеВычетовВМесяцаРезидентства.ФизЛицо = ВТСтандартныеВычетыПоМесяцамРезидениства.ФизЛицо
	               |			И ВТПрименениеВычетовВМесяцаРезидентства.Месяц = ВТСтандартныеВычетыПоМесяцамРезидениства.Месяц
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТСписокФизЛицОрганизация.ФизЛицо,
	               |	ВТСписокФизЛицОрганизация.ГоловнаяОрганизация,
	               |	НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный КАК КодВычета,
	               |	СУММА(НДФЛИмущественныеВычетыФизлиц.Размер) КАК Размер,
	               |	НДФЛИмущественныеВычетыФизлиц.Период КАК Дата
	               |ПОМЕСТИТЬ ВТСоциальныеИИмущественныеВычеты
	               |ИЗ
	               |	РегистрНакопления.НДФЛИмущественныеВычетыФизлиц КАК НДФЛИмущественныеВычетыФизлиц
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	               |		ПО НДФЛИмущественныеВычетыФизлиц.ФизЛицо = ВТСписокФизЛицОрганизация.ФизЛицо
	               |			И НДФЛИмущественныеВычетыФизлиц.Организация = ВТСписокФизЛицОрганизация.ГоловнаяОрганизация
	               |			И (ВТСписокФизЛицОрганизация.НеОтбиратьПоОП
	               |				ИЛИ НДФЛИмущественныеВычетыФизлиц.ОбособленноеПодразделение = ВТСписокФизЛицОрганизация.Организация)
	               |			И (НДФЛИмущественныеВычетыФизлиц.Год = ГОД(&НачалоНП))
	               |			И (НДФЛИмущественныеВычетыФизлиц.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТСписокФизЛицОрганизация.ФизЛицо,
	               |	ВТСписокФизЛицОрганизация.ГоловнаяОрганизация,
	               |	НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный,
	               |	НДФЛИмущественныеВычетыФизлиц.Период
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТСписокФизЛицОрганизация.ФизЛицо,
	               |	ВТСписокФизЛицОрганизация.ГоловнаяОрганизация,
	               |	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	               |	СУММА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПримененныйВычет),
	               |	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Период
	               |ИЗ
	               |	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДФЛПредоставленныеСтандартныеВычетыФизЛиц КАК НДФЛПредоставленныеСтандартныеВычетыФизЛиц
	               |		ПО ВТСписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация
	               |			И ВТСписокФизЛицОрганизация.ФизЛицо = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизЛицо
	               |			И (ВТСписокФизЛицОрганизация.НеОтбиратьПоОП
	               |				ИЛИ ВТСписокФизЛицОрганизация.Организация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация)
	               |			И (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	               |			И (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета = ЗНАЧЕНИЕ(Справочник.ВычетыНДФЛ.Код319))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТСписокФизЛицОрганизация.ГоловнаяОрганизация,
	               |	ВТСписокФизЛицОрганизация.ФизЛицо,
	               |	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	               |	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НДФЛСведенияОДоходах.Организация КАК ГоловнаяОрганизация,
	               |	НДФЛСведенияОДоходах.ФизЛицо КАК ФизЛицо,
	               |	ГОД(НДФЛСведенияОДоходах.Период) КАК Год,
	               |	НДФЛСведенияОДоходах.КодДохода.КодДляОтчетности КАК КодДохода,
	               |	НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ) КАК Месяц,
	               |	СУММА(НДФЛСведенияОДоходах.СуммаДохода) КАК СуммаДохода,
	               |	СУММА(НДФЛСведенияОДоходах.СуммаВычета) КАК СуммаВычета,
	               |	НДФЛСведенияОДоходах.КодДохода.Код КАК КодДоходаКод,
	               |	ВЫБОР
	               |		КОГДА (НЕ СтатусыФизЛицПоМесяцам.ЯвляетсяРезидентомРФ)
	               |			ТОГДА ВЫБОР
	               |					КОГДА НДФЛСведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |				КОНЕЦ
	               |		КОГДА НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |		КОГДА НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |		КОГДА НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	               |	КОНЕЦ КАК Ставка,
	               |	ВЫБОР
	               |		КОГДА НДФЛСведенияОДоходах.КодПоОКАТО <> &ПустойКодПоОКАТО
	               |			ТОГДА НДФЛСведенияОДоходах.КодПоОКАТО
	               |		КОГДА ЕСТЬNULL(НДФЛСведенияОДоходах.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	               |			ТОГДА НДФЛСведенияОДоходах.ПодразделениеОрганизации.КодПоОКАТО
	               |		ИНАЧЕ ЕСТЬNULL(НДФЛСведенияОДоходах.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	               |	КОНЕЦ КАК КодПоОКАТО,
	               |	ВЫБОР
	               |		КОГДА НДФЛСведенияОДоходах.КПП <> &ПустойКПП
	               |			ТОГДА НДФЛСведенияОДоходах.КПП
	               |		КОГДА ЕСТЬNULL(НДФЛСведенияОДоходах.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	               |			ТОГДА НДФЛСведенияОДоходах.ПодразделениеОрганизации.КПП
	               |		ИНАЧЕ ЕСТЬNULL(НДФЛСведенияОДоходах.ОбособленноеПодразделение.КПП, &ПустойКПП)
	               |	КОНЕЦ КАК КПП,
	               |	ВЫБОР
	               |		КОГДА НДФЛСведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.КодДоходаПоУмолчанию)
	               |				ИЛИ НДФЛСведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код2012)
	               |			ТОГДА НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ)
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК МесяцНачисления,
	               |	ВЫБОР
	               |		КОГДА НДФЛСведенияОДоходах.КодДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.КодДоходаПоУмолчанию)
	               |				И НДФЛСведенияОДоходах.КодДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код2012)
	               |			ТОГДА НДФЛСведенияОДоходах.Период
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ КАК ДатаВыплаты,
	               |	НДФЛСведенияОДоходах.КодВычета,
	               |	НДФЛСведенияОДоходах.Период,
	               |	НДФЛСведенияОДоходах.КодДохода.КодДляОтчетности,
	               |	НДФЛСведенияОДоходах.КодВычета.КодДляОтчетности2010 КАК КодВычетаКодДляОтчетности
	               |ПОМЕСТИТЬ ВТДоходыПоСтавкам
	               |ИЗ
	               |	РегистрНакопления.НДФЛСведенияОДоходах КАК НДФЛСведенияОДоходах
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	               |		ПО НДФЛСведенияОДоходах.ФизЛицо = СписокФизЛицОрганизация.ФизЛицо
	               |			И НДФЛСведенияОДоходах.Организация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	               |			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	               |				ИЛИ НДФЛСведенияОДоходах.ОбособленноеПодразделение = СписокФизЛицОрганизация.Организация)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицПоМесяцам КАК СтатусыФизЛицПоМесяцам
	               |		ПО НДФЛСведенияОДоходах.ФизЛицо = СтатусыФизЛицПоМесяцам.ФизЛицо
	               |			И (НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ) = СтатусыФизЛицПоМесяцам.Месяц)
	               |ГДЕ
	               |	НДФЛСведенияОДоходах.Период МЕЖДУ &НачалоНП И &КонецНП
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫБОР
	               |		КОГДА (НЕ СтатусыФизЛицПоМесяцам.ЯвляетсяРезидентомРФ)
	               |			ТОГДА ВЫБОР
	               |					КОГДА НДФЛСведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |				КОНЕЦ
	               |		КОГДА НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |		КОГДА НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |		КОГДА НДФЛСведенияОДоходах.КодДохода.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	               |	КОНЕЦ,
	               |	НДФЛСведенияОДоходах.Организация,
	               |	ВЫБОР
	               |		КОГДА НДФЛСведенияОДоходах.КодПоОКАТО <> &ПустойКодПоОКАТО
	               |			ТОГДА НДФЛСведенияОДоходах.КодПоОКАТО
	               |		КОГДА ЕСТЬNULL(НДФЛСведенияОДоходах.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	               |			ТОГДА НДФЛСведенияОДоходах.ПодразделениеОрганизации.КодПоОКАТО
	               |		ИНАЧЕ ЕСТЬNULL(НДФЛСведенияОДоходах.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА НДФЛСведенияОДоходах.КПП <> &ПустойКПП
	               |			ТОГДА НДФЛСведенияОДоходах.КПП
	               |		КОГДА ЕСТЬNULL(НДФЛСведенияОДоходах.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	               |			ТОГДА НДФЛСведенияОДоходах.ПодразделениеОрганизации.КПП
	               |		ИНАЧЕ ЕСТЬNULL(НДФЛСведенияОДоходах.ОбособленноеПодразделение.КПП, &ПустойКПП)
	               |	КОНЕЦ,
	               |	НДФЛСведенияОДоходах.ФизЛицо,
	               |	ГОД(НДФЛСведенияОДоходах.Период),
	               |	НДФЛСведенияОДоходах.КодДохода.КодДляОтчетности,
	               |	НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ),
	               |	НДФЛСведенияОДоходах.КодДохода.Код,
	               |	НДФЛСведенияОДоходах.КодВычета,
	               |	НДФЛСведенияОДоходах.Период,
	               |	НДФЛСведенияОДоходах.КодВычета.КодДляОтчетности2010,
	               |	ВЫБОР
	               |		КОГДА НДФЛСведенияОДоходах.КодДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.КодДоходаПоУмолчанию)
	               |				И НДФЛСведенияОДоходах.КодДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код2012)
	               |			ТОГДА НДФЛСведенияОДоходах.Период
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА НДФЛСведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.КодДоходаПоУмолчанию)
	               |				ИЛИ НДФЛСведенияОДоходах.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код2012)
	               |			ТОГДА НАЧАЛОПЕРИОДА(НДФЛСведенияОДоходах.Период, МЕСЯЦ)
	               |		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	               |	КОНЕЦ,
	               |	НДФЛСведенияОДоходах.КодДохода.КодДляОтчетности
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НДФЛРасчетыСБюджетом.Организация КАК ГоловнаяОрганизация,
	               |	НДФЛРасчетыСБюджетом.ФизЛицо КАК ФизЛицо,
	               |	ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода) КАК ГОД,
	               |	ВЫБОР
	               |		КОГДА НДФЛРасчетыСБюджетом.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.НДФЛРасчетыСБюджетомВидСтроки.Начисление)
	               |			ТОГДА НДФЛРасчетыСБюджетом.Налог
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НалогНачислено,
	               |	ВЫБОР
	               |		КОГДА НДФЛРасчетыСБюджетом.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.НДФЛРасчетыСБюджетомВидСтроки.Удержание)
	               |			ТОГДА НДФЛРасчетыСБюджетом.Налог
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НалогУдержано,
	               |	ВЫБОР
	               |		КОГДА НДФЛРасчетыСБюджетом.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.НДФЛРасчетыСБюджетомВидСтроки.ПереданоНаВзыскание)
	               |			ТОГДА НДФЛРасчетыСБюджетом.Налог
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НалогПереданоНаВзыскание,
	               |	ВЫБОР
	               |		КОГДА НДФЛРасчетыСБюджетом.ВидСтроки = ЗНАЧЕНИЕ(Перечисление.НДФЛРасчетыСБюджетомВидСтроки.ВозвратНалога)
	               |			ТОГДА -НДФЛРасчетыСБюджетом.Налог
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НалогВозвращено,
	               |	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода КАК Месяц,
	               |	ВЫБОР
	               |		КОГДА (НЕ СтатусыФизЛицПоМесяцам.ЯвляетсяРезидентомРФ)
	               |			ТОГДА ВЫБОР
	               |					КОГДА НДФЛРасчетыСБюджетом.КодДохода = ЗНАЧЕНИЕ(Справочник.ДоходыНДФЛ.Код1010)
	               |						ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	               |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |				КОНЕЦ
	               |		КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка13)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |		КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка09)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |		КОГДА НДФЛРасчетыСБюджетом.СтавкаНалогообложенияРезидента = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавкиНалогообложенияРезидента.Ставка35)
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	               |	КОНЕЦ КАК Ставка,
	               |	НДФЛРасчетыСБюджетом.КодДохода,
	               |	ВЫБОР
	               |		КОГДА НДФЛРасчетыСБюджетом.КодПоОКАТО <> &ПустойКодПоОКАТО
	               |			ТОГДА НДФЛРасчетыСБюджетом.КодПоОКАТО
	               |		КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	               |			ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КодПоОКАТО
	               |		ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	               |	КОНЕЦ КАК КодПоОКАТО,
	               |	ВЫБОР
	               |		КОГДА НДФЛРасчетыСБюджетом.КПП <> &ПустойКПП
	               |			ТОГДА НДФЛРасчетыСБюджетом.КПП
	               |		КОГДА ЕСТЬNULL(НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	               |			ТОГДА НДФЛРасчетыСБюджетом.ПодразделениеОрганизации.КПП
	               |		ИНАЧЕ ЕСТЬNULL(НДФЛРасчетыСБюджетом.ОбособленноеПодразделение.КПП, &ПустойКПП)
	               |	КОНЕЦ КАК КПП,
	               |	НДФЛРасчетыСБюджетом.Период
	               |ПОМЕСТИТЬ ВТДанныеОНалогах
	               |ИЗ
	               |	РегистрНакопления.НДФЛРасчетыСБюджетом КАК НДФЛРасчетыСБюджетом
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	               |		ПО НДФЛРасчетыСБюджетом.ФизЛицо = СписокФизЛицОрганизация.ФизЛицо
	               |			И (ГОД(НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода) = СписокФизЛицОрганизация.Год)
	               |			И НДФЛРасчетыСБюджетом.Организация = СписокФизЛицОрганизация.ГоловнаяОрганизация
	               |			И (СписокФизЛицОрганизация.НеОтбиратьПоОП
	               |				ИЛИ НДФЛРасчетыСБюджетом.ОбособленноеПодразделение = СписокФизЛицОрганизация.Организация)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицПоМесяцам КАК СтатусыФизЛицПоМесяцам
	               |		ПО НДФЛРасчетыСБюджетом.ФизЛицо = СтатусыФизЛицПоМесяцам.ФизЛицо
	               |			И НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода = СтатусыФизЛицПоМесяцам.Месяц
	               |ГДЕ
	               |	НДФЛРасчетыСБюджетом.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ДанныеОНалогах.ФизЛицо КАК ФизЛицо,
	               |	ДанныеОНалогах.ГОД КАК ГОД,
	               |	ДанныеОНалогах.Месяц,
	               |	СУММА(ДанныеОНалогах.НалогНачислено) КАК НалогНачислено,
	               |	ДанныеОНалогах.КодПоОКАТО,
	               |	ДанныеОНалогах.КПП,
	               |	ДанныеОНалогах.Ставка
	               |ПОМЕСТИТЬ ВТНачисленныйНалогПоМесяцам
	               |ИЗ
	               |	ВТДанныеОНалогах КАК ДанныеОНалогах
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеОНалогах.Месяц,
	               |	ДанныеОНалогах.ГоловнаяОрганизация,
	               |	ДанныеОНалогах.ФизЛицо,
	               |	ДанныеОНалогах.ГОД,
	               |	ДанныеОНалогах.КодПоОКАТО,
	               |	ДанныеОНалогах.КПП,
	               |	ДанныеОНалогах.Ставка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НДФЛИмущественныеВычетыФизлиц.Организация КАК ГоловнаяОрганизация,
	               |	НДФЛИмущественныеВычетыФизлиц.ФизЛицо КАК ФизЛицо,
	               |	НАЧАЛОПЕРИОДА(НДФЛИмущественныеВычетыФизлиц.Период, МЕСЯЦ) КАК Месяц,
	               |	СУММА(НДФЛИмущественныеВычетыФизлиц.Размер) КАК СуммаВычета,
	               |	ВЫБОР
	               |		КОГДА ВТСтатусыФизЛицПоМесяцам.ЯвляетсяРезидентомРФ
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |	КОНЕЦ КАК Ставка,
	               |	ВЫБОР
	               |		КОГДА НДФЛИмущественныеВычетыФизлиц.КодПоОКАТО <> &ПустойКодПоОКАТО
	               |			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодПоОКАТО
	               |		КОГДА ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	               |			ТОГДА НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КодПоОКАТО
	               |		ИНАЧЕ ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	               |	КОНЕЦ КАК КодПоОКАТО,
	               |	ВЫБОР
	               |		КОГДА НДФЛИмущественныеВычетыФизлиц.КПП <> &ПустойКПП
	               |			ТОГДА НДФЛИмущественныеВычетыФизлиц.КПП
	               |		КОГДА ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	               |			ТОГДА НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КПП
	               |		ИНАЧЕ ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ОбособленноеПодразделение.КПП, &ПустойКПП)
	               |	КОНЕЦ КАК КПП,
	               |	НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный КАК КодВычета,
	               |	НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный.КодДляОтчетности2010 КАК КодВычетаКодДляОтчетности
	               |ПОМЕСТИТЬ ВТВычетыПоСтавкам
	               |ИЗ
	               |	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДФЛИмущественныеВычетыФизлиц КАК НДФЛИмущественныеВычетыФизлиц
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицПоМесяцам КАК ВТСтатусыФизЛицПоМесяцам
	               |			ПО НДФЛИмущественныеВычетыФизлиц.ФизЛицо = ВТСтатусыФизЛицПоМесяцам.ФизЛицо
	               |				И (НАЧАЛОПЕРИОДА(НДФЛИмущественныеВычетыФизлиц.Период, МЕСЯЦ) = ВТСтатусыФизЛицПоМесяцам.Месяц)
	               |		ПО ВТСписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛИмущественныеВычетыФизлиц.Организация
	               |			И ВТСписокФизЛицОрганизация.ФизЛицо = НДФЛИмущественныеВычетыФизлиц.ФизЛицо
	               |			И (НДФЛИмущественныеВычетыФизлиц.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	               |			И (НДФЛИмущественныеВычетыФизлиц.Период МЕЖДУ &НачалоНП И &КонецНП)
	               |			И (ВТСписокФизЛицОрганизация.НеОтбиратьПоОП
	               |				ИЛИ ВТСписокФизЛицОрганизация.Организация = НДФЛИмущественныеВычетыФизлиц.ОбособленноеПодразделение)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НДФЛИмущественныеВычетыФизлиц.Организация,
	               |	НДФЛИмущественныеВычетыФизлиц.ФизЛицо,
	               |	НАЧАЛОПЕРИОДА(НДФЛИмущественныеВычетыФизлиц.Период, МЕСЯЦ),
	               |	ВЫБОР
	               |		КОГДА ВТСтатусыФизЛицПоМесяцам.ЯвляетсяРезидентомРФ
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА НДФЛИмущественныеВычетыФизлиц.КодПоОКАТО <> &ПустойКодПоОКАТО
	               |			ТОГДА НДФЛИмущественныеВычетыФизлиц.КодПоОКАТО
	               |		КОГДА ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	               |			ТОГДА НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КодПоОКАТО
	               |		ИНАЧЕ ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА НДФЛИмущественныеВычетыФизлиц.КПП <> &ПустойКПП
	               |			ТОГДА НДФЛИмущественныеВычетыФизлиц.КПП
	               |		КОГДА ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	               |			ТОГДА НДФЛИмущественныеВычетыФизлиц.ПодразделениеОрганизации.КПП
	               |		ИНАЧЕ ЕСТЬNULL(НДФЛИмущественныеВычетыФизлиц.ОбособленноеПодразделение.КПП, &ПустойКПП)
	               |	КОНЕЦ,
	               |	НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный,
	               |	НДФЛИмущественныеВычетыФизлиц.КодВычетаИмущественный.КодДляОтчетности2010
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация,
	               |	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизЛицо,
	               |	НАЧАЛОПЕРИОДА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода, МЕСЯЦ),
	               |	СУММА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПримененныйВычет),
	               |	ВЫБОР
	               |		КОГДА ВТСтатусыФизЛицПоМесяцам.ЯвляетсяРезидентомРФ
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодПоОКАТО <> &ПустойКодПоОКАТО
	               |			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодПоОКАТО
	               |		КОГДА ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	               |			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КодПоОКАТО
	               |		ИНАЧЕ ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КПП <> &ПустойКПП
	               |			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КПП
	               |		КОГДА ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	               |			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КПП
	               |		ИНАЧЕ ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ОбособленноеПодразделение.КПП, &ПустойКПП)
	               |	КОНЕЦ,
	               |	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	               |	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодДляОтчетности2010
	               |ИЗ
	               |	ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.НДФЛПредоставленныеСтандартныеВычетыФизЛиц КАК НДФЛПредоставленныеСтандартныеВычетыФизЛиц
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатусыФизЛицПоМесяцам КАК ВТСтатусыФизЛицПоМесяцам
	               |			ПО НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизЛицо = ВТСтатусыФизЛицПоМесяцам.ФизЛицо
	               |				И (НАЧАЛОПЕРИОДА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода, МЕСЯЦ) = ВТСтатусыФизЛицПоМесяцам.Месяц)
	               |		ПО ВТСписокФизЛицОрганизация.ГоловнаяОрганизация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация
	               |			И ВТСписокФизЛицОрганизация.ФизЛицо = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизЛицо
	               |			И (НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	               |			И (ВТСписокФизЛицОрганизация.НеОтбиратьПоОП
	               |				ИЛИ ВТСписокФизЛицОрганизация.Организация = НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ОбособленноеПодразделение)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.Организация,
	               |	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ФизЛицо,
	               |	НАЧАЛОПЕРИОДА(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.МесяцНалоговогоПериода, МЕСЯЦ),
	               |	ВЫБОР
	               |		КОГДА ВТСтатусыФизЛицПоМесяцам.ЯвляетсяРезидентомРФ
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодПоОКАТО <> &ПустойКодПоОКАТО
	               |			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодПоОКАТО
	               |		КОГДА ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КодПоОКАТО, &ПустойКодПоОКАТО) <> &ПустойКодПоОКАТО
	               |			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КодПоОКАТО
	               |		ИНАЧЕ ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ОбособленноеПодразделение.КодПоОКАТО, &ПустойКодПоОКАТО)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КПП <> &ПустойКПП
	               |			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КПП
	               |		КОГДА ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КПП, &ПустойКПП) <> &ПустойКПП
	               |			ТОГДА НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ПодразделениеОрганизации.КПП
	               |		ИНАЧЕ ЕСТЬNULL(НДФЛПредоставленныеСтандартныеВычетыФизЛиц.ОбособленноеПодразделение.КПП, &ПустойКПП)
	               |	КОНЕЦ,
	               |	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета,
	               |	НДФЛПредоставленныеСтандартныеВычетыФизЛиц.КодВычета.КодДляОтчетности2010
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВычетыПоСтавкам.ГоловнаяОрганизация,
	               |	ВычетыПоСтавкам.ФизЛицо,
	               |	ВычетыПоСтавкам.Месяц,
	               |	СУММА(ВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета,
	               |	ВычетыПоСтавкам.Ставка,
	               |	ВычетыПоСтавкам.КодПоОКАТО,
	               |	ВычетыПоСтавкам.КПП
	               |ПОМЕСТИТЬ ВТВычетыСгруппированныеДанные
	               |ИЗ
	               |	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВычетыПоСтавкам.ГоловнаяОрганизация,
	               |	ВычетыПоСтавкам.ФизЛицо,
	               |	ВычетыПоСтавкам.Месяц,
	               |	ВычетыПоСтавкам.Ставка,
	               |	ВычетыПоСтавкам.КодПоОКАТО,
	               |	ВычетыПоСтавкам.КПП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТСведенияОДоходахПоРазделам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ВТСведенияОДоходахПоРазделам.ФизЛицо КАК ФизЛицо,
	               |	ВТСведенияОДоходахПоРазделам.Месяц КАК Месяц,
	               |	СУММА(ВТСведенияОДоходахПоРазделам.СуммаДохода) КАК СуммаДохода,
	               |	ВТСведенияОДоходахПоРазделам.КодПоОКАТО,
	               |	ВТСведенияОДоходахПоРазделам.КПП
	               |ПОМЕСТИТЬ ВТДоходыПоМесяцамПоСтавке13Итог
	               |ИЗ
	               |	ВТДоходыПоСтавкам КАК ВТСведенияОДоходахПоРазделам
	               |ГДЕ
	               |	ВТСведенияОДоходахПоРазделам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТСведенияОДоходахПоРазделам.ГоловнаяОрганизация,
	               |	ВТСведенияОДоходахПоРазделам.ФизЛицо,
	               |	ВТСведенияОДоходахПоРазделам.Месяц,
	               |	ВТСведенияОДоходахПоРазделам.КодПоОКАТО,
	               |	ВТСведенияОДоходахПоРазделам.КПП
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВычетыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ВычетыПоСтавкам.ФизЛицо КАК ФизЛицо,
	               |	ВычетыПоСтавкам.КодПоОКАТО КАК КодПоОКАТО,
	               |	ВычетыПоСтавкам.КПП КАК КПП,
	               |	ВычетыПоСтавкам.Месяц КАК Месяц,
	               |	СУММА(ВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета
	               |ИЗ
	               |	ВТВычетыПоСтавкам КАК ВычетыПоСтавкам
	               |ГДЕ
	               |	ВычетыПоСтавкам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВычетыПоСтавкам.ФизЛицо,
	               |	ВычетыПоСтавкам.ГоловнаяОрганизация,
	               |	ВычетыПоСтавкам.КодПоОКАТО,
	               |	ВычетыПоСтавкам.Месяц,
	               |	ВычетыПоСтавкам.КПП
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП,
	               |	Месяц
	               |ИТОГИ
	               |	СУММА(СуммаВычета)
	               |ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ВТДанныеОНалогах.ФизЛицо КАК ФизЛицо,
	               |	ВТДанныеОНалогах.КодПоОКАТО КАК КодПоОКАТО,
	               |	ВТДанныеОНалогах.КПП КАК КПП,
	               |	ВТДанныеОНалогах.Месяц КАК Месяц,
	               |	СУММА(ВТДанныеОНалогах.НалогНачислено) КАК НалогНачислено
	               |ИЗ
	               |	ВТДанныеОНалогах КАК ВТДанныеОНалогах
	               |ГДЕ
	               |	ВТДанныеОНалогах.НалогНачислено <> 0
	               |	И ВТДанныеОНалогах.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТДанныеОНалогах.ГоловнаяОрганизация,
	               |	ВТДанныеОНалогах.ФизЛицо,
	               |	ВТДанныеОНалогах.КодПоОКАТО,
	               |	ВТДанныеОНалогах.КПП,
	               |	ВТДанныеОНалогах.Месяц
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП,
	               |	Месяц
	               |ИТОГИ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтатусФизЛицНаКонецМесяца.ФизЛицо КАК ФизЛицо,
	               |	СтатусФизЛицНаКонецМесяца.Месяц КАК Месяц,
	               |	СтатусФизЛицНаКонецМесяца.Статус
	               |ИЗ
	               |	ВТСтатусФизЛицНаКонецМесяца КАК СтатусФизЛицНаКонецМесяца
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ФизЛицо,
	               |	Месяц
	               |ИТОГИ ПО
	               |	ФизЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДокументыПодтверждения.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ДокументыПодтверждения.ФизЛицо КАК ФизЛицо,
	               |	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.ДатаУведомления) КАК ДатаУведомления,
	               |	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.НомерВходящегоДокумента) КАК Номер,
	               |	МАКСИМУМ(НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.КодНалоговогоОргана) КАК КодОрганаУведомление
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТСписокФизЛицОрганизация.ФизЛицо КАК ФизЛицо,
	               |		ВТСписокФизЛицОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |		МАКСИМУМ(НДФЛИмущественныеВычетыФизлиц.Регистратор) КАК Регистратор
	               |	ИЗ
	               |		РегистрНакопления.НДФЛИмущественныеВычетыФизлиц КАК НДФЛИмущественныеВычетыФизлиц
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	               |			ПО НДФЛИмущественныеВычетыФизлиц.ФизЛицо = ВТСписокФизЛицОрганизация.ФизЛицо
	               |				И НДФЛИмущественныеВычетыФизлиц.Организация = ВТСписокФизЛицОрганизация.ГоловнаяОрганизация
	               |				И (ВТСписокФизЛицОрганизация.НеОтбиратьПоОП
	               |					ИЛИ НДФЛИмущественныеВычетыФизлиц.ОбособленноеПодразделение = ВТСписокФизЛицОрганизация.Организация)
	               |				И (НДФЛИмущественныеВычетыФизлиц.Год = ГОД(&НачалоНП))
	               |				И (НДФЛИмущественныеВычетыФизлиц.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТСписокФизЛицОрганизация.ФизЛицо,
	               |		ВТСписокФизЛицОрганизация.ГоловнаяОрганизация) КАК ДокументыПодтверждения
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НДФЛПодтверждениеПраваНаИмущественныйВычет.РаботникиОрганизации КАК НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации
	               |		ПО ДокументыПодтверждения.Регистратор = НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.Ссылка
	               |			И ДокументыПодтверждения.ФизЛицо = НДФЛПодтверждениеПраваНаИмущественныйВычетРаботникиОрганизации.ФизЛицо
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДокументыПодтверждения.ГоловнаяОрганизация,
	               |	ДокументыПодтверждения.ФизЛицо
	               |ИТОГИ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МаксимальныеДатыСправок.Дата КАК ДатаСправки,
	               |	МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.НомерСправки) КАК НомерСправки,
	               |	МаксимальныеДатыСправок.Сотрудник КАК ФизЛицо,
	               |	1 КАК ТипСправки
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник КАК Сотрудник,
	               |		МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата) КАК Дата
	               |	ИЗ
	               |		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛВНалоговыйОрган.СотрудникиОрганизации КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	               |			ПО СписокФизЛицОрганизация.ФизЛицо = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	               |				И СписокФизЛицОрганизация.ГоловнаяОрганизация = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Организация
	               |				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.НалоговыйПериод = ГОД(&НачалоНП))
	               |				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.ОснованиеДляПредставленияСправок = ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ЕжегоднаяОтчетность))
	               |				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Проведен)
	               |				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.ПринятоНалоговымОрганом)
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник) КАК МаксимальныеДатыСправок
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛВНалоговыйОрган.СотрудникиОрганизации КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	               |		ПО МаксимальныеДатыСправок.Сотрудник = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	               |			И МаксимальныеДатыСправок.Дата = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	МаксимальныеДатыСправок.Сотрудник,
	               |	МаксимальныеДатыСправок.Дата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	МаксимальныеДатыСправок.Дата,
	               |	МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.НомерСправки),
	               |	МаксимальныеДатыСправок.Сотрудник,
	               |	3
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник КАК Сотрудник,
	               |		МАКСИМУМ(СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата) КАК Дата
	               |	ИЗ
	               |		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛВНалоговыйОрган.СотрудникиОрганизации КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	               |			ПО СписокФизЛицОрганизация.ФизЛицо = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	               |				И СписокФизЛицОрганизация.ГоловнаяОрганизация = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Организация
	               |				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.НалоговыйПериод = ГОД(&НачалоНП))
	               |				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.ОснованиеДляПредставленияСправок = ЗНАЧЕНИЕ(Перечисление.ОснованияДляПредставленияСправок2НДФЛ.ОНевозможностиУдержанияНДФЛ))
	               |				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Проведен)
	               |				И (СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.ПринятоНалоговымОрганом)
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник) КАК МаксимальныеДатыСправок
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛВНалоговыйОрган.СотрудникиОрганизации КАК СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации
	               |		ПО МаксимальныеДатыСправок.Сотрудник = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Сотрудник
	               |			И МаксимальныеДатыСправок.Дата = СправкаПоНДФЛВНалоговыйОрганСотрудникиОрганизации.Ссылка.Дата
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	МаксимальныеДатыСправок.Сотрудник,
	               |	МаксимальныеДатыСправок.Дата
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СправкаПоНДФЛСотруднику.Дата,
	               |	МАКСИМУМ(СправкаПоНДФЛСотруднику.Номер),
	               |	СправкаПоНДФЛСотруднику.Сотрудник,
	               |	2
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СписокФизЛицОрганизация.ФизЛицо КАК ФизЛицо,
	               |		МАКСИМУМ(СправкаПоНДФЛСотруднику.Дата) КАК Дата
	               |	ИЗ
	               |		ВТСписокФизЛицОрганизация КАК СписокФизЛицОрганизация
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛСотруднику КАК СправкаПоНДФЛСотруднику
	               |			ПО СписокФизЛицОрганизация.ФизЛицо = СправкаПоНДФЛСотруднику.Сотрудник
	               |				И СписокФизЛицОрганизация.ГоловнаяОрганизация = СправкаПоНДФЛСотруднику.Организация
	               |				И (СправкаПоНДФЛСотруднику.НалоговыйПериод = ГОД(&НачалоНП))
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		СписокФизЛицОрганизация.ФизЛицо) КАК ПоследниеДатыСправок
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СправкаПоНДФЛСотруднику КАК СправкаПоНДФЛСотруднику
	               |		ПО ПоследниеДатыСправок.Дата = СправкаПоНДФЛСотруднику.Дата
	               |			И ПоследниеДатыСправок.ФизЛицо = СправкаПоНДФЛСотруднику.Сотрудник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СправкаПоНДФЛСотруднику.Сотрудник,
	               |	СправкаПоНДФЛСотруднику.Дата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ФизЛицо,
	               |	ТипСправки
	               |ИТОГИ ПО
	               |	ФизЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтандартныеВычетыФизЛицОрганизации.ФизЛицо КАК ФизЛицо,
	               |	СтандартныеВычетыФизЛицОрганизации.Месяц КАК Месяц,
	               |	СтандартныеВычетыФизЛицОрганизации.КодВычета.КодДляОтчетности2010 КАК КодВычета,
	               |	СтандартныеВычетыФизЛицОрганизации.КоличествоДетей,
	               |	ВТСписокФизЛицОрганизация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ЕСТЬNULL(СтандартныеВычетыФизЛицОрганизации.КоличествоДетей, 1) * ЕСТЬNULL(НДФЛРазмерВычетовСрезПоследних.Размер, 0) КАК Размер,
	               |	СтандартныеВычетыФизЛицОрганизации.Основание
	               |ИЗ
	               |	ВТСтандартныеВычетыФизЛицОрганизации КАК СтандартныеВычетыФизЛицОрганизации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НДФЛРазмерВычетов.СрезПоследних(
	               |				&КонецНП,
	               |				КодВычета В
	               |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |						ВТСтандартныеВычетыПоМесяцамРезидениства.КодВычетаЛичный
	               |					ИЗ
	               |						ВТСтандартныеВычетыПоМесяцамРезидениства КАК ВТСтандартныеВычетыПоМесяцамРезидениства)) КАК НДФЛРазмерВычетовСрезПоследних
	               |		ПО СтандартныеВычетыФизЛицОрганизации.КодВычета = НДФЛРазмерВычетовСрезПоследних.КодВычета
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокФизЛицОрганизация КАК ВТСписокФизЛицОрганизация
	               |		ПО СтандартныеВычетыФизЛицОрганизации.ФизЛицо = ВТСписокФизЛицОрганизация.ФизЛицо
	               |			И СтандартныеВычетыФизЛицОрганизации.Организация = ВТСписокФизЛицОрганизация.ГоловнаяОрганизация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодВычета,
	               |	Месяц
	               |ИТОГИ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТСоциальныеИИмущественныеВычеты.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ВТСоциальныеИИмущественныеВычеты.ФизЛицо КАК ФизЛицо,
	               |	ВТСоциальныеИИмущественныеВычеты.КодВычета.КодДляОтчетности2010 КАК КодВычетаКод,
	               |	ВТСоциальныеИИмущественныеВычеты.Размер,
	               |	МИНИМУМ(ВЫБОР
	               |			КОГДА НАЧАЛОПЕРИОДА(ВТСоциальныеИИмущественныеВычеты.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(ВТСтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ)
	               |				ТОГДА ВТСоциальныеИИмущественныеВычеты.Дата
	               |			ИНАЧЕ НАЧАЛОПЕРИОДА(ВТСтатусФизЛицНаКонецМесяца.Месяц, МЕСЯЦ)
	               |		КОНЕЦ) КАК Дата
	               |ИЗ
	               |	ВТСтатусФизЛицНаКонецМесяца КАК ВТСтатусФизЛицНаКонецМесяца
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСоциальныеИИмущественныеВычеты КАК ВТСоциальныеИИмущественныеВычеты
	               |		ПО ВТСтатусФизЛицНаКонецМесяца.ФизЛицо = ВТСоциальныеИИмущественныеВычеты.ФизЛицо
	               |			И ВТСтатусФизЛицНаКонецМесяца.Месяц >= ВТСоциальныеИИмущественныеВычеты.Дата
	               |ГДЕ
	               |	ВТСтатусФизЛицНаКонецМесяца.ЯвляетсяРезидентомРФ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТСоциальныеИИмущественныеВычеты.ФизЛицо,
	               |	ВТСоциальныеИИмущественныеВычеты.КодВычета.КодДляОтчетности2010,
	               |	ВТСоциальныеИИмущественныеВычеты.Размер,
	               |	ВТСоциальныеИИмущественныеВычеты.Дата,
	               |	ВТСоциальныеИИмущественныеВычеты.ГоловнаяОрганизация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодВычетаКод,
	               |	Дата
	               |ИТОГИ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДоходыПоМесяцам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ДоходыПоМесяцам.ФизЛицо КАК ФизЛицо,
	               |	ДоходыПоМесяцам.Месяц КАК МесяцНалоговогоПериода,
	               |	ДоходыПоМесяцам.МесяцНачисления КАК МесяцНачисления,
	               |	ДоходыПоМесяцам.ДатаВыплаты КАК ДатаВыплаты,
	               |	ДоходыПоМесяцам.КодДохода КАК КодДоходаСсылка,
	               |	СУММА(ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0)) КАК СуммаДохода,
	               |	ДоходыПоМесяцам.КодВычета КАК КодВычетаСсылка,
	               |	СУММА(ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) КАК СуммаВычета,
	               |	СУММА(ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) КАК ОблагаемаяСуммаДохода,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |				ТОГДА (ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * 0.09
	               |			КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	               |				ТОГДА (ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * 0.15
	               |			КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |				ТОГДА (ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * 0.3
	               |			КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	               |				ТОГДА (ЕСТЬNULL(ДоходыПоМесяцам.СуммаДохода, 0) - ЕСТЬNULL(ДоходыПоМесяцам.СуммаВычета, 0)) * 0.35
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК НалогНачислено,
	               |	ДоходыПоМесяцам.Период КАК ДатаНачисления,
	               |	ДоходыПоМесяцам.КодДоходаКодДляОтчетности КАК КодДохода,
	               |	ДоходыПоМесяцам.КодВычетаКодДляОтчетности КАК КодВычета,
	               |	ДоходыПоМесяцам.Ставка,
	               |	ВЫБОР
	               |		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	               |				ИЛИ ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |				ИЛИ ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	               |			ТОГДА ""Раздел4_Ставка35_15_9""
	               |		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |			ТОГДА ""Раздел4_Ставка30""
	               |		ИНАЧЕ ""Раздел4_Ставка13""
	               |	КОНЕЦ КАК Раздел,
	               |	ДоходыПоМесяцам.КодПоОКАТО КАК КодПоОКАТО,
	               |	ДоходыПоМесяцам.КПП КАК КПП
	               |ИЗ
	               |	ВТДоходыПоСтавкам КАК ДоходыПоМесяцам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДоходыПоМесяцам.ФизЛицо,
	               |	ДоходыПоМесяцам.Месяц,
	               |	ДоходыПоМесяцам.МесяцНачисления,
	               |	ДоходыПоМесяцам.ДатаВыплаты,
	               |	ДоходыПоМесяцам.КодДохода,
	               |	ДоходыПоМесяцам.КодВычета,
	               |	ДоходыПоМесяцам.ГоловнаяОрганизация,
	               |	ДоходыПоМесяцам.Период,
	               |	ДоходыПоМесяцам.КодДоходаКодДляОтчетности,
	               |	ДоходыПоМесяцам.КодВычетаКодДляОтчетности,
	               |	ДоходыПоМесяцам.Ставка,
	               |	ВЫБОР
	               |		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка15)
	               |				ИЛИ ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка09)
	               |				ИЛИ ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка35)
	               |			ТОГДА ""Раздел4_Ставка35_15_9""
	               |		КОГДА ДоходыПоМесяцам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка30)
	               |			ТОГДА ""Раздел4_Ставка30""
	               |		ИНАЧЕ ""Раздел4_Ставка13""
	               |	КОНЕЦ,
	               |	ДоходыПоМесяцам.КодПоОКАТО,
	               |	ДоходыПоМесяцам.КПП
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП,
	               |	Раздел,
	               |	МесяцНалоговогоПериода,
	               |	МесяцНачисления,
	               |	ДатаНачисления,
	               |	ДатаВыплаты,
	               |	КодДохода,
	               |	КодВычета
	               |ИТОГИ
	               |	СУММА(СуммаДохода),
	               |	СУММА(СуммаВычета),
	               |	СУММА(ОблагаемаяСуммаДохода),
	               |	МАКСИМУМ(НалогНачислено)
	               |ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП,
	               |	Раздел,
	               |	МесяцНалоговогоПериода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТВычетыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ВТВычетыПоСтавкам.ФизЛицо КАК ФизЛицо,
	               |	ВТВычетыПоСтавкам.Месяц КАК Месяц,
	               |	ВТВычетыПоСтавкам.КодВычета КАК КодВычетаСсылка,
	               |	СУММА(ВТВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета,
	               |	МАКСИМУМ(ЕСТЬNULL(ВТДоходыПоМесяцамПоСтавке13Итог.СуммаДохода, 0)) КАК СуммаДохода,
	               |	ВТВычетыПоСтавкам.КодВычетаКодДляОтчетности КАК КодВычета,
	               |	ВТВычетыПоСтавкам.КодПоОКАТО КАК КодПоОКАТО,
	               |	ВТВычетыПоСтавкам.КПП КАК КПП
	               |ИЗ
	               |	ВТВычетыПоСтавкам КАК ВТВычетыПоСтавкам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоМесяцамПоСтавке13Итог КАК ВТДоходыПоМесяцамПоСтавке13Итог
	               |		ПО (ВТДоходыПоМесяцамПоСтавке13Итог.ГоловнаяОрганизация = ВТВычетыПоСтавкам.ГоловнаяОрганизация)
	               |			И (ВТДоходыПоМесяцамПоСтавке13Итог.ФизЛицо = ВТВычетыПоСтавкам.ФизЛицо)
	               |			И (ВТДоходыПоМесяцамПоСтавке13Итог.Месяц = ВТВычетыПоСтавкам.Месяц)
	               |			И (ВТДоходыПоМесяцамПоСтавке13Итог.КодПоОКАТО = ВТВычетыПоСтавкам.КодПоОКАТО)
	               |			И (ВТДоходыПоМесяцамПоСтавке13Итог.КПП = ВТВычетыПоСтавкам.КПП)
	               |			И (ВТВычетыПоСтавкам.Ставка = ЗНАЧЕНИЕ(Перечисление.НДФЛСтавки.Ставка13))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТВычетыПоСтавкам.КодВычета,
	               |	ВТВычетыПоСтавкам.КодВычетаКодДляОтчетности,
	               |	ВТВычетыПоСтавкам.ГоловнаяОрганизация,
	               |	ВТВычетыПоСтавкам.ФизЛицо,
	               |	ВТВычетыПоСтавкам.Месяц,
	               |	ВТВычетыПоСтавкам.КодПоОКАТО,
	               |	ВТВычетыПоСтавкам.КПП
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП,
	               |	Месяц,
	               |	КодВычета
	               |ИТОГИ
	               |	СУММА(СуммаВычета),
	               |	МАКСИМУМ(СуммаДохода)
	               |ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП,
	               |	Месяц
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ВТДанныеОНалогах.ФизЛицо КАК ФизЛицо,
	               |	ВТДанныеОНалогах.Месяц КАК Месяц,
	               |	ВТДанныеОНалогах.Период КАК Дата,
	               |	ВТДанныеОНалогах.Ставка КАК Ставка,
	               |	СУММА(ВТДанныеОНалогах.НалогНачислено) КАК НалогНачислено,
	               |	ВТДанныеОНалогах.КодПоОКАТО КАК КодПоОКАТО,
	               |	ВТДанныеОНалогах.КПП КАК КПП
	               |ИЗ
	               |	ВТДанныеОНалогах КАК ВТДанныеОНалогах
	               |ГДЕ
	               |	ВТДанныеОНалогах.НалогНачислено <> 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТДанныеОНалогах.ФизЛицо,
	               |	ВТДанныеОНалогах.Месяц,
	               |	ВТДанныеОНалогах.Период,
	               |	ВТДанныеОНалогах.Ставка,
	               |	ВТДанныеОНалогах.ГоловнаяОрганизация,
	               |	ВТДанныеОНалогах.КодПоОКАТО,
	               |	ВТДанныеОНалогах.КПП
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП,
	               |	Месяц,
	               |	Дата,
	               |	Ставка
	               |ИТОГИ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ВТДанныеОНалогах.ФизЛицо КАК ФизЛицо,
	               |	ВТДанныеОНалогах.Месяц КАК Месяц,
	               |	ВТДанныеОНалогах.Период КАК Дата,
	               |	ВТДанныеОНалогах.Ставка КАК Ставка,
	               |	СУММА(ВТДанныеОНалогах.НалогУдержано) КАК НалогУдержано,
	               |	ВТДанныеОНалогах.КодПоОКАТО КАК КодПоОКАТО,
	               |	ВТДанныеОНалогах.КПП КАК КПП
	               |ИЗ
	               |	ВТДанныеОНалогах КАК ВТДанныеОНалогах
	               |ГДЕ
	               |	ВТДанныеОНалогах.НалогУдержано <> 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТДанныеОНалогах.ГоловнаяОрганизация,
	               |	ВТДанныеОНалогах.ФизЛицо,
	               |	ВТДанныеОНалогах.Месяц,
	               |	ВТДанныеОНалогах.Период,
	               |	ВТДанныеОНалогах.Ставка,
	               |	ВТДанныеОНалогах.КодПоОКАТО,
	               |	ВТДанныеОНалогах.КПП
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП,
	               |	Месяц,
	               |	Дата,
	               |	Ставка
	               |ИТОГИ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ВТДанныеОНалогах.ФизЛицо КАК ФизЛицо,
	               |	ВТДанныеОНалогах.Месяц КАК Месяц,
	               |	ВТДанныеОНалогах.Период КАК Дата,
	               |	ВТДанныеОНалогах.Ставка КАК Ставка,
	               |	ВТДанныеОНалогах.НалогВозвращено,
	               |	ВТДанныеОНалогах.КодПоОКАТО КАК КодПоОКАТО,
	               |	ВТДанныеОНалогах.КПП КАК КПП
	               |ИЗ
	               |	ВТДанныеОНалогах КАК ВТДанныеОНалогах
	               |ГДЕ
	               |	ВТДанныеОНалогах.НалогВозвращено <> 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП,
	               |	Месяц,
	               |	Дата,
	               |	Ставка
	               |ИТОГИ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТДанныеОНалогах.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ВТДанныеОНалогах.ФизЛицо КАК ФизЛицо,
	               |	ВТДанныеОНалогах.Месяц КАК Месяц,
	               |	ВТДанныеОНалогах.Период КАК Дата,
	               |	ВТДанныеОНалогах.Ставка КАК Ставка,
	               |	ВТДанныеОНалогах.НалогПереданоНаВзыскание,
	               |	ВТДанныеОНалогах.КодПоОКАТО КАК КодПоОКАТО,
	               |	ВТДанныеОНалогах.КПП КАК КПП
	               |ИЗ
	               |	ВТДанныеОНалогах КАК ВТДанныеОНалогах
	               |ГДЕ
	               |	ВТДанныеОНалогах.НалогПереданоНаВзыскание <> 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП,
	               |	Месяц,
	               |	Дата,
	               |	Ставка
	               |ИТОГИ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизЛицо КАК ФизЛицо,
	               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода КАК Месяц,
	               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Период КАК Дата,
	               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка КАК Ставка,
	               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма,
	               |	ЕСТЬNULL(ПеречислениеНДФЛвБюджет.ПлатежноеПоручениеНомер, """") КАК НомерПП,
	               |	ЕСТЬNULL(ПеречислениеНДФЛвБюджет.ПлатежноеПоручениеДата, """") КАК ДатаПП,
	               |	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ОКАТО_КПП КАК ОКАТО_КПП
	               |ИЗ
	               |	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОбособленныеПодразделения КАК ВТСписокФизЛицОрганизация
	               |		ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизЛицо = ВТСписокФизЛицОрганизация.ФизЛицо
	               |			И (РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода МЕЖДУ &НачалоНП И &КонецНП)
	               |			И (РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
	               |			И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Организация = ВТСписокФизЛицОрганизация.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеречислениеНДФЛвБюджет КАК ПеречислениеНДФЛвБюджет
	               |		ПО РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор = ПеречислениеНДФЛвБюджет.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ФизЛицо,
	               |	ОКАТО_КПП,
	               |	Месяц,
	               |	Дата,
	               |	Ставка
	               |ИТОГИ ПО
	               |	ФизЛицо,
	               |	ОКАТО_КПП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТВычетыПоСтавкам.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	               |	ВТВычетыПоСтавкам.ФизЛицо КАК ФизЛицо,
	               |	ВТВычетыПоСтавкам.КодВычета.КодДляОтчетности2010 КАК КодВычета,
	               |	СУММА(ВТВычетыПоСтавкам.СуммаВычета) КАК СуммаВычета,
	               |	ВТВычетыПоСтавкам.КодПоОКАТО КАК КодПоОКАТО,
	               |	ВТВычетыПоСтавкам.КПП КАК КПП
	               |ИЗ
	               |	ВТВычетыПоСтавкам КАК ВТВычетыПоСтавкам
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТВычетыПоСтавкам.ГоловнаяОрганизация,
	               |	ВТВычетыПоСтавкам.ФизЛицо,
	               |	ВТВычетыПоСтавкам.КодВычета.КодДляОтчетности2010,
	               |	ВТВычетыПоСтавкам.КодПоОКАТО,
	               |	ВТВычетыПоСтавкам.КПП
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо,
	               |	КодПоОКАТО,
	               |	КПП,
	               |	КодВычета
	               |ИТОГИ ПО
	               |	ГоловнаяОрганизация,
	               |	ФизЛицо";
		
		Результат = Запрос.ВыполнитьПакет();
		КоличествоРезультатов = Результат.Количество();
		
		ВыборкаВычетовПоСтавке13 = Результат[КоличествоРезультатов - 15].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		ВыборкаНалогНачисленныйПоСтавке13 = Результат[КоличествоРезультатов - 14].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		ВыборкаСтатусов = Результат[КоличествоРезультатов - 13].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаУведомления = Результат[КоличествоРезультатов - 12].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		ВыборкаСправкиНДФЛ = Результат[КоличествоРезультатов - 11].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		ВыборкаСтандартныеВычеты = Результат[КоличествоРезультатов - 10].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаСоциальныеВычеты = Результат[КоличествоРезультатов - 9].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
        ВыборкаНалогиПоМесяцаПоРазделам = Результат[КоличествоРезультатов - 8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаВычетыПоМесяцамПоВидам   = Результат[КоличествоРезультатов - 7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаНалогиНачисленныеИтоги   = Результат[КоличествоРезультатов - 6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаНалогиУдержанныеИтоги    = Результат[КоличествоРезультатов - 5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаНалогиВозвращенныеИтоги  = Результат[КоличествоРезультатов - 4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаНалогиВзысканиеИтоги     = Результат[КоличествоРезультатов - 3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаНалогиПеречисленныеИтоги = Результат[КоличествоРезультатов - 2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаВычетыИтоги = Результат[КоличествоРезультатов - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		
КонецПроцедуры

Процедура ПолучитьСпискиФизЛицИСотрудников(СтрокиДеревоДанных, СписокФизЛиц)
	
	Для Каждого СтрокаДанных из СтрокиДеревоДанных Цикл
		Если СтрокаДанных.ФизЛицо <> Неопределено  //СтрокаДанных.Организация <> Неопределено тогда
			                                                                                       Тогда
			СтрокаСписка = СписокФизЛиц.Добавить();
			СтрокаСписка.ФизЛицо     = СтрокаДанных.ФизЛицо;
			СтрокаСписка.Организация = СтрокаДанных.Организация;
			СтрокаСписка.ГоловнаяОрганизация = СтрокаДанных.ГоловнаяОрганизация;
			СтрокаСписка.Год = Год(СтрокаДанных.Год);
			СтрокаСписка.НЕОтбиратьПоОП = (СтрокаДанных.ГоловнаяОрганизация = СтрокаДанных.Организация)
			
		ИначеЕсли СтрокаДанных.Строки.Количество() > 0 Тогда
			
			ПолучитьСпискиФизЛицИСотрудников(СтрокаДанных.Строки, СписокФизЛиц);
			
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Функция СформироватьОтчет(ДокументРезультат, ЕстьОшибки = Неопределено, ВнешниеНаборыДанных = Неопределено) Экспорт
	
	ЗначениеПанелипользователя = ТиповыеОтчеты.ПолучитьЗначенияНастроекПанелиПользователяОбъекта(ЭтотОбъект);
	НастрокаПоУмолчанию        = КомпоновщикНастроек.ПолучитьНастройки();
	ТиповыеОтчеты.ПолучитьПримененуюНастройку(ЭтотОбъект);
	
	Группировка = ТиповыеОтчеты.ДобавитьГруппировку(КомпоновщикНастроек, "");
	Группировка.ПоляГруппировки.Элементы.Очистить();
	
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "ГоловнаяОрганизация");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "Организация");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "ГОД");
	ТиповыеОтчеты.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "ФизЛицо");
	
	ЭлементСортировки = КомпоновщикНастроек.Настройки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементСортировки.Использование = Истина;
	ЭлементСортировки.Поле = Новый ПолеКомпоновкиДанных("ФизЛицо");
	
	ОтборПоОрганизации = Ложь;
	Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		ЭлементОрганизация = Новый ПолеКомпоновкиДанных("Организация");
		Если ЭлементОтбора.Использование = Истина И ЭлементОтбора.ЛевоеЗначение = ЭлементОрганизация Тогда
			ОтборПоОрганизации = Истина;
		КонецЕсли;	
	КонецЦикла;	
	
	ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("ОтборПоОрганизации");
	ПараметрОтборПоОрганизации = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки); 
	ПараметрОтборПоОрганизации.Значение = ОтборПоОрганизации;
	ПараметрОтборПоОрганизации.Использование = Истина;
	
	ДокументРезультат.Очистить();
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
		
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	Если ЗначениеПараметра <> Неопределено тогда
		Если ЗначениеПараметра.Значение <> '00010101' тогда
			ДатаАктуальности = ЗначениеПараметра.Значение;
		Иначе
			ДатаАктуальности           = ОбщегоНазначения.ПолучитьРабочуюДату();
			ЗначениеПараметра.Значение = ОбщегоНазначения.ПолучитьРабочуюДату();
		КонецЕсли;
	Иначе
		ДатаАктуальности = ОбщегоНазначения.ПолучитьРабочуюДату();
	КонецЕсли;
	
	КодПоОКАТО    = ТиповыеОтчеты.ПолучитьПараметр(КомпоновщикНастроек, "КодПоОКАТО").Значение;
	Ответственный = ТиповыеОтчеты.ПолучитьПараметр(КомпоновщикНастроек, "Ответственный").Значение;
	ПервыйРаз     = истина;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	
	ДеревоДанных =  Новый ДеревоЗначений;
	
	ПроцессорВывода.УстановитьОбъект(ДеревоДанных);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	МассивТипов = Новый Массив(2);
	МассивТипов[0]= Тип("Null");
	СписокФизЛицОрганизация = Новый ТаблицаЗначений;
	МассивТипов[1]= Тип("СправочникСсылка.ФизическиеЛица");
	СписокФизЛицОрганизация.Колонки.Добавить("ФизЛицо", Новый ОписаниеТипов(МассивТипов));
	МассивТипов[1]= Тип("СправочникСсылка.Организации");
	СписокФизЛицОрганизация.Колонки.Добавить("ГоловнаяОрганизация", Новый ОписаниеТипов(МассивТипов));
	СписокФизЛицОрганизация.Колонки.Добавить("Организация", Новый ОписаниеТипов(МассивТипов));
	МассивТипов[1]= Тип("Число");
	СписокФизЛицОрганизация.Колонки.Добавить("Год", Новый ОписаниеТипов(МассивТипов));
	МассивТипов[1]= Тип("Булево");
	СписокФизЛицОрганизация.Колонки.Добавить("НеОтбиратьПоОП", Новый ОписаниеТипов(МассивТипов));

	ПолучитьСпискиФизЛицИСотрудников(ДеревоДанных.Строки, СписокФизЛицОрганизация);
	Группировки = ТиповыеОтчеты.ПолучитьПоляГруппировок(КомпоновщикНастроек);
	Уровень = 0;
	
	ПолучитьДанныеДляПостроенияОтчета(СписокФизЛицОрганизация);
	
	ВывестиКарточки(ДокументРезультат, ДеревоДанных.Строки, Уровень, Группировки, ЕстьОшибки);
	
	КомпоновщикНастроек.ЗагрузитьНастройки(НастрокаПоУмолчанию);
	
	//Параметры документа
	ДокументРезультат.Автомасштаб 			= 	Истина;
	ДокументРезультат.ОриентацияСтраницы 	= 	ОриентацияСтраницы.Ландшафт;
	ДокументРезультат.ТолькоПросмотр		= 	Истина;
	
	Возврат ДокументРезультат;
	
КонецФункции
	
#Если Клиент Тогда

// Заполняет табличный документ
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//
Процедура СформироватьМакет(ДокументРезультат, ФизЛицо, Год, ГоловнаяОрганизация, Уровень) Экспорт
    Ответственный = Справочники.Пользователи.ПустаяСсылка();

	Если НЕ ПервыйРаз тогда
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	Иначе
		ПервыйРаз = ложь;
	КонецЕсли;
	
	Макет =	ПолучитьМакет("ФормаРегистрНалоговогоУчетаПоНДФЛ");
		
	// Области-разделы
    Раздел1 = Макет.ПолучитьОбласть("Раздел1");									    
	Раздел2 = Макет.ПолучитьОбласть("Раздел2");	
	Раздел3 = Макет.ПолучитьОбласть("Раздел3");
	Раздел4 = Макет.ПолучитьОбласть("Раздел4");
	Раздел7 = Макет.ПолучитьОбласть("Раздел7");
	РасчетыНалогаПоСтавке13Заголовок = Макет.ПолучитьОбласть("РасчетыНалогаПоСтавке13Заголовок");
	РасчетыНалогаПоСтавке13Шапка = Макет.ПолучитьОбласть("РасчетыНалогаПоСтавке13Шапка");
	РасчетыНалогаПоСтавке13Строка = Макет.ПолучитьОбласть("РасчетыНалогаПоСтавке13Строка");
	РасчетыНалогаПоСтавке13МесяцГруппа = Макет.ПолучитьОбласть("РасчетыНалогаПоСтавке13МесяцГруппа");
	РасчетыНалогаПоСтавке13Итог = Макет.ПолучитьОбласть("РасчетыНалогаПоСтавке13ИтогМесяц");
	ПредоставленныеВычетыШапка = Макет.ПолучитьОбласть("ПредоставленныеВычетыШапка");
	ПредоставленныеВычетыЗаголовок = Макет.ПолучитьОбласть("ПредоставленныеВычетыЗаголовок");
	ПредоставленныеВычетыШапкаМесяцГруппа = Макет.ПолучитьОбласть("ПредоставленныеВычетыШапкаМесяцГруппа");
	ПредоставленныеВычетыСтрока = Макет.ПолучитьОбласть("ПредоставленныеВычетыСтрока");
	ПредоставленныеВычетыИтог = Макет.ПолучитьОбласть("ПредоставленныеВычетыИтог");
	НалогПоСтавке30Заголовок = Макет.ПолучитьОбласть("НалогПоСтавке30Заголовок");
	НалогПоСтавке30Шапка = Макет.ПолучитьОбласть("НалогПоСтавке30Шапка");
	НалогПоСтавке30Строка = Макет.ПолучитьОбласть("НалогПоСтавке30Строка");
	НалогПоСтавке30Итог = Макет.ПолучитьОбласть("НалогПоСтавке30Итог");
	НалогПоСтавке9Заголовок = Макет.ПолучитьОбласть("НалогПоСтавке9Заголовок");
	НалогПоСтавке9Шапка = Макет.ПолучитьОбласть("НалогПоСтавке9Шапка");
	НалогПоСтавке9Строка = Макет.ПолучитьОбласть("НалогПоСтавке9Строка");
	НалогПоСтавке9Итог = Макет.ПолучитьОбласть("НалогПоСтавке9Итог");
	ИсчисленоЗаголовок = Макет.ПолучитьОбласть("ИсчисленоЗаголовок");
	ИсчисленоШапка = Макет.ПолучитьОбласть("ИсчисленоШапка");
	ИсчисленоСтрока = Макет.ПолучитьОбласть("ИсчисленоСтрока");
	УдержаноЗаголовок = Макет.ПолучитьОбласть("УдержаноЗаголовок");
	УдержаноШапка = Макет.ПолучитьОбласть("УдержаноШапка");
	УдержаноСтрока = Макет.ПолучитьОбласть("УдержаноСтрока");
	ВозвращеноЗаголовок = Макет.ПолучитьОбласть("ВозвращеноЗаголовок");
	ВозвращеноШапка = Макет.ПолучитьОбласть("ВозвращеноШапка");
	ВозвращеноСтрока = Макет.ПолучитьОбласть("ВозвращеноСтрока");
	ПереданоНаВзысканиеЗаголовок = Макет.ПолучитьОбласть("ПереданоНаВзысканиеЗаголовок");
	ПереданоНаВзысканиеШапка = Макет.ПолучитьОбласть("ПереданоНаВзысканиеШапка");
	ПереданоНаВзысканиеСтрока = Макет.ПолучитьОбласть("ПереданоНаВзысканиеСтрока");
	НалогПеречисленныйЗаголовок = Макет.ПолучитьОбласть("НалогПеречисленныйЗаголовок");
	НалогПеречисленныйШапка = Макет.ПолучитьОбласть("НалогПеречисленныйШапка");
	НалогПеречисленныйСтрока = Макет.ПолучитьОбласть("НалогПеречисленныйСтрока");
	ПредоставленныеВычетыИтогиЗаголовок = Макет.ПолучитьОбласть("ПредоставленныеВычетыИтогиЗаголовок");
	ПредоставленныеВычетыИтогиШапка = Макет.ПолучитьОбласть("ПредоставленныеВычетыИтогиШапка");
	ПредоставленныеВычетыИтогиСтрока = Макет.ПолучитьОбласть("ПредоставленныеВычетыИтогиСтрока");
	ПредоставленныеВычетыИтогиИтог = Макет.ПолучитьОбласть("ПредоставленныеВычетыИтогиИтог");
	ОбщиеСуммыИтогЗаголовок = Макет.ПолучитьОбласть("ОбщиеСуммыИтогЗаголовок");
	ОбщиеСуммыИтогШапка = Макет.ПолучитьОбласть("ОбщиеСуммыИтогШапка");
	ОбщиеСуммыСтроки = Макет.ПолучитьОбласть("ОбщиеСуммыСтроки");
	СтандартныеВычетыЗаголовок = Макет.ПолучитьОбласть("СтандартныеВычетыЗаголовок");
	СтандартныеВычетыШапка = Макет.ПолучитьОбласть("СтандартныеВычетыШапка");
	СтандартныеВычетыСтрока = Макет.ПолучитьОбласть("СтандартныеВычетыСтрока");
	СоциальныеВычетыЗаголовок = Макет.ПолучитьОбласть("СоциальныеВычетыЗаголовок");
	СоциальныеВычетыШапка = Макет.ПолучитьОбласть("СоциальныеВычетыШапка");
	СоциальныеВычетыСтрока = Макет.ПолучитьОбласть("СоциальныеВычетыСтрока");
	ИмущественныйВычетУведомление = Макет.ПолучитьОбласть("ИмущественныйВычетУведомление");
	Подписи = Макет.ПолучитьОбласть("Подписи");
	ОбластьПустыеВычеты = Макет.ПолучитьОбласть("ОбластьПустыеВычеты");
	
	//-----------------------------------------------------------------------------                                 
	// РАЗДЕЛ 1 и 2
	
	ТаблицаПоНалогамИтоги = СоздатьПустуюТаблицуИтогов();
	
	НалоговыйПериод = Год(Год);
	
	СтруктураОтбора = Новый Структура("ФизЛицо, Год, ГоловнаяОрганизация", ФизЛицо, НалоговыйПериод, ГоловнаяОрганизация);
	
	ДанныеОФизЛицеОрганизации.Сбросить();
	
	Если ДанныеОФизЛицеОрганизации.НайтиСледующий(СтруктураОтбора) тогда
		
		// Заполнение данных раздела 1
		Раздел1.Параметры.ГодНП = "" + Формат(Год, "ЧГ=0; ДФ=yyyy");
		Раздел1.Параметры.ИНН = "" + ДанныеОФизЛицеОрганизации.Организация_ИНН +"\" + ДанныеОФизЛицеОрганизации.Организация_КПП;
		Раздел1.Параметры.КодИМНС = ДанныеОФизЛицеОрганизации.Организация_КодИМНС;
		Раздел1.Параметры.НазваниеОрганизации = ДанныеОФизЛицеОрганизации.Организация_Наименование;
		
		// Заполнение данных раздела 2
		Раздел2.Параметры.ИНН = ДанныеОФизЛицеОрганизации.ФизЛицо_ИНН;
		Раздел2.Параметры.ФИО = ДанныеОФизЛицеОрганизации.ФизЛицо_ФИО;
		Раздел2.Параметры.КодДокумента = ДанныеОФизЛицеОрганизации.ФизЛицо_КодДокументаУдЛичн;
		Раздел2.Параметры.СерияНомерДокумента = ДанныеОФизЛицеОрганизации.ФизЛицо_СерияНомерДокументаУдЛичн;
		Раздел2.Параметры.ДатаРождения = Формат(ДанныеОФизЛицеОрганизации.ФизЛицо_ДатаРождения, "ДФ=dd.MM.yyyy");
		Раздел2.Параметры.КодСтраны = ДанныеОФизЛицеОрганизации.ФизЛицо_КодСтраны;
		Раздел2.Параметры.СтранаПроживания = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресКодСтраны;
		Раздел2.Параметры.Индекс = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресИндекс;
		Раздел2.Параметры.Регион = ПроцедурыУправленияПерсоналом.ПолучитьКодРегионаРФИзКодаАдресногоЭлемента(ДанныеОФизЛицеОрганизации.ФизЛицо_АдресРегион);
		Раздел2.Параметры.Район = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресРайон;
		Раздел2.Параметры.Город = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресГород;
		Раздел2.Параметры.НаселенныйПункт = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресНаселенныйПункт;
		Раздел2.Параметры.Улица = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресУлица;
		Раздел2.Параметры.Дом = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресДом;
		Раздел2.Параметры.Корпус = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресКорпус;
		Раздел2.Параметры.Квартира = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресКвартира;
		Раздел2.Параметры.СтранаПроживания = ДанныеОФизЛицеОрганизации.ФизЛицо_АдресКодСтраны;
		Раздел2.Параметры.Адрес = ДанныеОФизЛицеОрганизации.ФизЛицо_ИностранныйАдрес;
		
	КонецЕсли;
	
	ДокументРезультат.Вывести(Раздел1);
	
	ВыборкаСтатусов.Сбросить();
	
	СтатусНаКонецПериода = Перечисления.СтатусыНалогоплательщиковПоНДФЛ.Резидент;
	Если ВыборкаСтатусов.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
		ВыборкаДетали = ВыборкаСтатусов.Выбрать();
		Пока ВыборкаДетали.Следующий() Цикл
			Раздел2.Параметры["Статус" + Строка(Месяц(ВыборкаДетали.Месяц))] = ВыборкаДетали.Статус;	
			СтатусНаКонецПериода = ?(ВыборкаДетали.Статус = 2, Перечисления.СтатусыНалогоплательщиковПоНДФЛ.НеРезидент, Перечисления.СтатусыНалогоплательщиковПоНДФЛ.Резидент);
		КонецЦикла;	
	КонецЕсли;	
	
	
	ДокументРезультат.Вывести(Раздел2);
	
	ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	
	Раздел3.Параметры.Доход = ДанныеОФизЛицеОрганизации.ФизЛицо_ДоходыПредыдущегоМестаРаботы;
	ДокументРезультат.Вывести(Раздел3);

	ВыводимыеОбласти = Новый Массив;
	
	ВыборкаСтандартныеВычеты.Сбросить();
	
	ТаблицаСтандартныхВычетов = Новый ТаблицаЗначений();
	ТаблицаСтандартныхВычетов.Колонки.Добавить("КодВычета");
	ТаблицаСтандартныхВычетов.Колонки.Добавить("СтандартныеВычетыРазмер");
	ТаблицаСтандартныхВычетов.Колонки.Добавить("СтандартныеВычетыПериодС");
	ТаблицаСтандартныхВычетов.Колонки.Добавить("СтандартныеВычетыПериодПо");
	ТаблицаСтандартныхВычетов.Колонки.Добавить("СтандартныеВычетыОснование");
	
	ПредыдущийВычет = Неопределено;
	ПредыдущийПериод = '00010101';
	ПредыдущийРазмер = Неопределено;
	ПредыдущаяСтрока = Неопределено;
	СтрокаТаблицы = Неопределено;
		
	ВыборкаСтандартныеВычеты.Сбросить();
	
		
	Если ВыборкаСтандартныеВычеты.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
	
		ВыборкаСтандартныеВычетыПоФизЛицу = ВыборкаСтандартныеВычеты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Если ВыборкаСтандартныеВычетыПоФизЛицу.НайтиСледующий(ФизЛицо, "Физлицо") Тогда
			ВыборкаДетали = ВыборкаСтандартныеВычетыПоФизЛицу.Выбрать();
			
			ВыводимыеОбласти.Добавить(СтандартныеВычетыЗаголовок);
			ВыводимыеОбласти.Добавить(СтандартныеВычетыШапка);
			ВыводимыеОбласти.Добавить(СтандартныеВычетыСтрока);

			
			Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда 
	       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;	
			
			ДокументРезультат.Вывести(СтандартныеВычетыШапка);
			
			Пока ВыборкаДетали.Следующий() Цикл
				Если ВыборкаДетали.КодВычета = ПредыдущийВычет И (КонецМесяца(ПредыдущийПериод) + 1) = ВыборкаДетали.Месяц И ПредыдущийРазмер = ВыборкаДетали.Размер Тогда
					ДатаЗавершения = КонецМесяца(ВыборкаДетали.Месяц);
				Иначе
					Если ПредыдущаяСтрока <> Неопределено Тогда 
						ПредыдущаяСтрока.СтандартныеВычетыПериодПо = ДатаЗавершения;
					КонецЕсли;	
					СтрокаТаблицы = ТаблицаСтандартныхВычетов.Добавить();
					СтрокаТаблицы.КодВычета = ВыборкаДетали.КодВычета;
					СтрокаТаблицы.СтандартныеВычетыПериодС = ВыборкаДетали.Месяц; 
				    СтрокаТаблицы.СтандартныеВычетыРазмер = ВыборкаДетали.Размер;
					СтрокаТаблицы.СтандартныеВычетыОснование = ВыборкаДетали.Основание;
					
					ДатаЗавершения = КонецМесяца(ВыборкаДетали.Месяц);
				КонецЕсли;	
				
				ПредыдущаяСтрока = СтрокаТаблицы;
				
				ПредыдущийВычет  = ВыборкаДетали.КодВычета;
				ПредыдущийПериод = ВыборкаДетали.Месяц;
				ПредыдущийРазмер = ВыборкаДетали.Размер;
			КонецЦикла;	
			Если СтрокаТаблицы <> Неопределено Тогда
				СтрокаТаблицы.СтандартныеВычетыПериодПо = ДатаЗавершения;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	

	ЕстьПравоНавычеты = Ложь;
	Для Каждого Вычет Из ТаблицаСтандартныхВычетов Цикл
		ВыводимыеОбласти.Очистить();
		СтандартныеВычетыСтрока.Параметры.КодВычета = Вычет.КодВычета;
		СтандартныеВычетыСтрока.Параметры.СтандартныеВычетыРазмер = Вычет.СтандартныеВычетыРазмер;
		СтандартныеВычетыСтрока.Параметры.СтандартныеВычетыПериодС = Формат(Вычет.СтандартныеВычетыПериодС, "ДФ=дд.ММ.гггг");
		СтандартныеВычетыСтрока.Параметры.СтандартныеВычетыПериодПо = Формат(Вычет.СтандартныеВычетыПериодПо, "ДФ=дд.ММ.гггг");
		СтандартныеВычетыСтрока.Параметры.СтандартныеВычетыОснование = Вычет.СтандартныеВычетыОснование;
		
		ВыводимыеОбласти.Добавить(СтандартныеВычетыСтрока);
		
		Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			ДокументРезультат.Вывести(СтандартныеВычетыШапка);
		КонецЕсли;
		
		ДокументРезультат.Вывести(СтандартныеВычетыСтрока);
		ЕстьПравоНавычеты = Истина;
	КонецЦикла;	
	
	ВыборкаСоциальныеВычеты.Сбросить();
	
	ВыводимыеОбласти.Очистить();
	Если ВыборкаСоциальныеВычеты.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
		
		ВыборкаПоФизЛицу = ВыборкаСоциальныеВычеты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ВыборкаПоФизЛицу.НайтиСледующий(ФизЛицо, "Физлицо") Тогда
			ВыборкаДетали = ВыборкаПоФизЛицу.Выбрать();
			
			ВыводимыеОбласти.Добавить(СоциальныеВычетыЗаголовок);
			ВыводимыеОбласти.Добавить(СоциальныеВычетыШапка);
			ВыводимыеОбласти.Добавить(СоциальныеВычетыСтрока);
			
			Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;	
			
			ДокументРезультат.Вывести(СоциальныеВычетыЗаголовок);
			ДокументРезультат.Вывести(СоциальныеВычетыШапка);
			
			Пока ВыборкаДетали.Следующий() Цикл
				ВыводимыеОбласти.Очистить();
				СоциальныеВычетыСтрока.Параметры.СоцВычетыКод = ВыборкаДетали.КодВычетаКод;
				СоциальныеВычетыСтрока.Параметры.СоцВычетыРазмер = ВыборкаДетали.Размер;
				СоциальныеВычетыСтрока.Параметры.СоцВычетыДата = Формат(ВыборкаДетали.Дата, "ДФ=дд.ММ.ггг");
				
				ВыводимыеОбласти.Добавить(СоциальныеВычетыСтрока);
				
				Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
		       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					ДокументРезультат.Вывести(СоциальныеВычетыШапка);
				КонецЕсли;
				
				ДокументРезультат.Вывести(СоциальныеВычетыСтрока);
				ЕстьПравоНавычеты = Истина;
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;	
	
	Если Не ЕстьПравоНавычеты Тогда
		ДокументРезультат.Вывести(ОбластьПустыеВычеты);
	КонецЕсли;	
	
	Если ВыборкаУведомления.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
		
		ВыводимыеОбласти.Очистить();
		
		ВыводимыеОбласти.Добавить(ИмущественныйВычетУведомление);
		
		Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ВыборкаПоФизЛицу = ВыборкаУведомления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ВыборкаПоФизЛицу.НайтиСледующий(ФизЛицо, "Физлицо") Тогда
			ВыборкаДетали = ВыборкаПоФизЛицу.Выбрать();
			
			Если ВыборкаДетали.Следующий() Тогда
				ИмущественныйВычетУведомление.Параметры.Заполнить(ВыборкаДетали);
				ИмущественныйВычетУведомление.Параметры.ДатаУведомления = Формат(ВыборкаДетали.ДатаУведомления, "ДФ=дд.ММ.гггг");
				ДокументРезультат.Вывести(ИмущественныйВычетУведомление);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	

	
	ВыборкаНалогиПоМесяцаПоРазделам.Сбросить();
	
	ЕстьДанныеПоДоходам = Ложь;
	Если ВыборкаНалогиПоМесяцаПоРазделам.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") тогда
		ВыборкаФизЛиц  = ВыборкаНалогиПоМесяцаПоРазделам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаФизЛиц.НайтиСледующий(ФизЛицо, "Физлицо") Тогда
			
			ЕстьДанныеПоДоходам = Истина;
			ТаблицаПоНалогамИтоги.Очистить();

			ДанныеОНалогахНачисленныхПоОКАТО = Новый Соответствие;
			ДанныеОНалогахУдержанныхПоОКАТО = Новый Соответствие;
			ДанныеОНалогахВозвращенныхПоОКАТО = Новый Соответствие;
			ДанныеОНалогахПереданныхНаВзысканиеПоОКАТО = Новый Соответствие;
			ДанныеОНалогахПеречисленныхПоОКАТО = Новый Соответствие;
			
			
			ВыборкаОКАТО = ВыборкаФизЛиц.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаОКАТО.Следующий() Цикл
				
				ВыборкаКПП = ВыборкаОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаКПП.Следующий() Цикл					
					
					ОКАТО_КПП = СправкиПоНДФЛ.СуммаОКАТОиКПП(ВыборкаКПП.КодПоОКАТО, ВыборкаКПП.КПП);
					Раздел4.Параметры.ОКАТО_КПП = ОКАТО_КПП;
					
					ВыводимыеОбласти.Очистить();
					
					ВыводимыеОбласти.Добавить(Раздел4);
					ВыводимыеОбласти.Добавить(РасчетыНалогаПоСтавке13Заголовок);				

					Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
			       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					КонецЕсли;

					ДокументРезультат.Вывести(Раздел4);
					
					ВыборкаПоРазделам = ВыборкаКПП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Если ВыборкаПоРазделам.НайтиСледующий("Раздел4_Ставка13", "Раздел") Тогда
						
						НалогиПоСтавке13 = Новый Соответствие;
						ВыборкаНалогНачисленныйПоСтавке13.Сбросить();
						Если ВыборкаНалогНачисленныйПоСтавке13.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
							ВыборкаНалогНачисленныйПоСтавке13ПоФизЛицам = ВыборкаНалогНачисленныйПоСтавке13.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Если ВыборкаНалогНачисленныйПоСтавке13ПоФизЛицам.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
								ВыборкаНалогНачисленныйПоСтавке13ОКАТО = ВыборкаНалогНачисленныйПоСтавке13ПоФизЛицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Если ВыборкаНалогНачисленныйПоСтавке13ОКАТО.НайтиСледующий(ВыборкаКПП.КодПоОКАТО, "КодПоОКАТО") Тогда
									ВыборкаНалогНачисленныйПоСтавке13КПП = ВыборкаНалогНачисленныйПоСтавке13ОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									Если ВыборкаНалогНачисленныйПоСтавке13КПП.НайтиСледующий(ВыборкаКПП.КПП, "КПП") Тогда
										ВыборкаДетали = ВыборкаНалогНачисленныйПоСтавке13КПП.Выбрать();
										
										НачисленоИтог = 0;
										Пока ВыборкаДетали.Следующий() Цикл 
											НачисленоИтог = ВыборкаДетали.НалогНачислено + НачисленоИтог;
											НалогиПоСтавке13.Вставить(ВыборкаДетали.Месяц, НачисленоИтог);		
										КонецЦикла;	
									КонецЕсли;	
								КонецЕсли;
							КонецЕсли;	
						КонецЕсли;	
												
						ВычетыПоСтавке13 = Новый Соответствие;
						ВыборкаВычетовПоСтавке13.Сбросить();
						Если ВыборкаВычетовПоСтавке13.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
							ВыборкаВычетовПоСтавке13ПоФизЛицам = ВыборкаВычетовПоСтавке13.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Если ВыборкаВычетовПоСтавке13ПоФизЛицам.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
								ВыборкаВычетовПоСтавке13ОКАТО = ВыборкаВычетовПоСтавке13ПоФизЛицам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Если ВыборкаВычетовПоСтавке13ОКАТО.НайтиСледующий(ВыборкаКПП.КодПоОКАТО, "КодПоОКАТО") Тогда
									ВыборкаВычетовПоСтавке13КПП =ВыборкаВычетовПоСтавке13ОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									Если ВыборкаВычетовПоСтавке13КПП.НайтиСледующий(ВыборкаКПП.КПП, "КПП") Тогда
										ВыборкаДетали = ВыборкаВычетовПоСтавке13КПП.Выбрать();
										
										СуммаВычетаИтог = 0;
										Пока ВыборкаДетали.Следующий() Цикл 
											СуммаВычетаИтог = ВыборкаДетали.СуммаВычета + СуммаВычетаИтог;
											ВычетыПоСтавке13.Вставить(ВыборкаДетали.Месяц, СуммаВычетаИтог);		
										КонецЦикла;	
									КонецЕсли;	
								КонецЕсли;
							КонецЕсли;	
						КонецЕсли;	

						
						ДокументРезультат.Вывести(РасчетыНалогаПоСтавке13Заголовок);
						ДокументРезультат.Вывести(РасчетыНалогаПоСтавке13Шапка);
						
						ВыборкаПоМесяцамНалоговогоПериода = ВыборкаПоРазделам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						СуммаДоходаНарастающийИтог = 0;
						СуммаВычетовНарастающийИтог = 0;
						ОблагаемаяСуммаДоходаНарастающийИтог = 0;
						НалоговаяБаза = 0;
						НалогНачислено = 0;
						СуммаВычетовСНачалаПериода = 0;
						
						Пока ВыборкаПоМесяцамНалоговогоПериода.Следующий() Цикл
							ВыводимыеОбласти.Очистить();
							
							СуммаДоходаНарастающийИтог = СуммаДоходаНарастающийИтог + ВыборкаПоМесяцамНалоговогоПериода.СуммаДохода;
							СуммаВычетовНарастающийИтог = СуммаВычетовНарастающийИтог + ВыборкаПоМесяцамНалоговогоПериода.СуммаВычета;
							ОблагаемаяСуммаДоходаНарастающийИтог = ОблагаемаяСуммаДоходаНарастающийИтог + ВыборкаПоМесяцамНалоговогоПериода.ОблагаемаяСуммаДохода;
							
							НалогСНачалаПериода = НалогиПоСтавке13.Получить(ВыборкаПоМесяцамНалоговогоПериода.МесяцНалоговогоПериода);
							
							НалогНачислено = ?(НалогСНачалаПериода = Неопределено, НалогНачислено, НалогСНачалаПериода);
							
							СуммаВычетовСНачалаПериода = ?(ВычетыПоСтавке13.Получить(ВыборкаПоМесяцамНалоговогоПериода.МесяцНалоговогоПериода) = Неопределено, СуммаВычетовСНачалаПериода, ВычетыПоСтавке13.Получить(ВыборкаПоМесяцамНалоговогоПериода.МесяцНалоговогоПериода));
							
							НалоговаяБаза = ОблагаемаяСуммаДоходаНарастающийИтог -  СуммаВычетовСНачалаПериода;
							
							РасчетыНалогаПоСтавке13МесяцГруппа.Параметры.Месяц = Формат(ВыборкаПоМесяцамНалоговогоПериода.МесяцНалоговогоПериода, "ДФ=ММММ");
							
							ОбластьНалогПоСтавке13Группа = Новый ТабличныйДокумент;
							ОбластьНалогПоСтавке13Группа.Вывести(РасчетыНалогаПоСтавке13МесяцГруппа);
							
							ВыводимыеОбласти.Добавить(ОбластьНалогПоСтавке13Группа);
							
							ВыборкаПоДатамПолученияДохода = ВыборкаПоМесяцамНалоговогоПериода.Выбрать();
							
							Пока ВыборкаПоДатамПолученияДохода.Следующий() Цикл
								РасчетыНалогаПоСтавке13Строка.Параметры.Заполнить(ВыборкаПоДатамПолученияДохода);
								РасчетыНалогаПоСтавке13Строка.Параметры.ДатаНачисления = Формат(ВыборкаПоДатамПолученияДохода.ДатаНачисления, "ДФ=дд.ММ.гггг");
								РасчетыНалогаПоСтавке13Строка.Параметры.МесяцНачисления = Формат(ВыборкаПоДатамПолученияДохода.МесяцНачисления, "ДФ=ММММ");
								РасчетыНалогаПоСтавке13Строка.Параметры.ДатаВыплаты = Формат(ВыборкаПоДатамПолученияДохода.ДатаВыплаты, "ДФ=дд.ММ.гггг");
								
								ОбластьДоходыПоСтавке13 = Новый ТабличныйДокумент;
								ОбластьДоходыПоСтавке13.Вывести(РасчетыНалогаПоСтавке13Строка);
								
								ВыводимыеОбласти.Добавить(ОбластьДоходыПоСтавке13);		
								
							КонецЦикла;	
							
							РасчетыНалогаПоСтавке13Итог.Параметры.Заполнить(ВыборкаПоМесяцамНалоговогоПериода);
							РасчетыНалогаПоСтавке13Итог.Параметры.СуммаДоходаНарастающийИтог = СуммаДоходаНарастающийИтог;
							РасчетыНалогаПоСтавке13Итог.Параметры.СуммаВычетаНарастающийИтог = СуммаВычетовНарастающийИтог;
							РасчетыНалогаПоСтавке13Итог.Параметры.ОблагаемаяСуммаДоходаИтог = ОблагаемаяСуммаДоходаНарастающийИтог;
							РасчетыНалогаПоСтавке13Итог.Параметры.НалоговаяБаза = НалоговаяБаза;
							РасчетыНалогаПоСтавке13Итог.Параметры.НалогНачислено = НалогНачислено;
							
							ВыводимыеОбласти.Добавить(РасчетыНалогаПоСтавке13Итог);
							
							Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
					       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
								ДокументРезультат.Вывести(РасчетыНалогаПоСтавке13Шапка);
							КонецЕсли;

							Для Каждого Область Из ВыводимыеОбласти Цикл
								ДокументРезультат.Вывести(Область);
							КонецЦикла;	
							
						КонецЦикла;
						
						СтрокаТаблицыИтогов = ТаблицаПоНалогамИтоги.Добавить();
						СтрокаТаблицыИтогов.ОКАТО_КПП = ОКАТО_КПП;
						СтрокаТаблицыИтогов.Ставка = Перечисления.НДФЛСтавки.Ставка13;
						СтрокаТаблицыИтогов.ОбщаяСуммаДохода = ВыборкаПоРазделам.СуммаДохода;
						СтрокаТаблицыИтогов.НалоговаяБаза = НалоговаяБаза;
						
						ВыборкаВычетыПоМесяцамПоВидам.Сбросить();
						
						ВыводимыеОбласти.Очистить();
						Если ВыборкаВычетыПоМесяцамПоВидам.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
							ВыборкаВычетыПоФизЛицу = ВыборкаВычетыПоМесяцамПоВидам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Если ВыборкаВычетыПоФизЛицу.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
								ВыборкаВычетыПоОКАТО = ВыборкаВычетыПоФизЛицу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Если ВыборкаВычетыПоОКАТО.НайтиСледующий(ВыборкаОКАТО.КодПоОкато, "КодПоОкато") Тогда 
									ВыборкаВычетыПоКПП = ВыборкаВычетыПоОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									
									Если ВыборкаВычетыПоКПП.НайтиСледующий(ВыборкаКПП.КПП, "КПП") Тогда 
									
										ВыборкаВычетыПоМесяцам = ВыборкаВычетыПоКПП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
										
										ВыводимыеОбласти.Добавить(ПредоставленныеВычетыЗаголовок);
										ВыводимыеОбласти.Добавить(ПредоставленныеВычетыШапка);
										
										Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
								       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
										КонецЕсли;

										
										ДокументРезультат.Вывести(ПредоставленныеВычетыЗаголовок);
										ДокументРезультат.Вывести(ПредоставленныеВычетыШапка);
										
										ДоходИтог = 0;
										СуммаВычетаНарастающийИтог = 0;
										Пока ВыборкаВычетыПоМесяцам.Следующий() Цикл
											ВыводимыеОбласти.Очистить();
											
											ДоходИтог = ДоходИтог + ВыборкаВычетыПоМесяцам.СуммаДохода;
																				
											ПредоставленныеВычетыШапкаМесяцГруппа.Параметры.Месяц = Формат(ВыборкаВычетыПоМесяцам.Месяц, "ДФ=ММММ");	
											ПредоставленныеВычетыШапкаМесяцГруппа.Параметры.Доход = Формат(ДоходИтог, "ЧДЦ=2");
											
											ВыводимыеОбласти.Добавить(ПредоставленныеВычетыШапкаМесяцГруппа);
											
											ВыборкаВычетыДетали = ВыборкаВычетыПоМесяцам.Выбрать();
											
											Пока ВыборкаВычетыДетали.Следующий() Цикл
												ПредоставленныеВычетыСтрока.Параметры.КодВычета = ВыборкаВычетыДетали.КодВычета;
												ПредоставленныеВычетыСтрока.Параметры.СуммаВычета = ВыборкаВычетыДетали.СуммаВычета;
												
												ОбластьПредоставленныеВычеты = Новый ТабличныйДокумент;
												ОбластьПредоставленныеВычеты.Вывести(ПредоставленныеВычетыСтрока);
												
												ВыводимыеОбласти.Добавить(ОбластьПредоставленныеВычеты);	
												
												СуммаВычетаНарастающийИтог = СуммаВычетаНарастающийИтог + ВыборкаВычетыДетали.СуммаВычета;
											КонецЦикла;	
											
											ПредоставленныеВычетыИтог.Параметры.СуммаВычета = ВыборкаВычетыПоМесяцам.СуммаВычета;
											ПредоставленныеВычетыИтог.Параметры.СуммаВычетаНарастающийИтог = СуммаВычетаНарастающийИтог;
											
											ВыводимыеОбласти.Добавить(ПредоставленныеВычетыИтог);
											
											Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
									       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
												ДокументРезультат.Вывести(ПредоставленныеВычетыШапка);
											КонецЕсли;
											
											Для Каждого Область Из ВыводимыеОбласти Цикл
												ДокументРезультат.Вывести(Область);
											КонецЦикла;	
										КонецЦикла;	
									КонецЕсли;	
								КонецЕсли;
							КонецЕсли;		
						КонецЕсли;	
					
					
					КонецЕсли;	
					
					ВыборкаПоРазделам.Сбросить();
					
					ВыводимыеОбласти.Очистить();
					Если ВыборкаПоРазделам.НайтиСледующий("Раздел4_Ставка30", "Раздел") Тогда
						
						ВыводимыеОбласти.Добавить(НалогПоСтавке30Заголовок);
						ВыводимыеОбласти.Добавить(НалогПоСтавке30Шапка);
						ВыводимыеОбласти.Добавить(НалогПоСтавке30Строка);
						
						Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
				       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						КонецЕсли;
	 
						ДокументРезультат.Вывести(НалогПоСтавке30Заголовок);
						ДокументРезультат.Вывести(НалогПоСтавке30Шапка);
						
						ВыборкаПоМесяцамНалоговогоПериода = ВыборкаПоРазделам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						СуммаДоходаИтог = 0;
						СуммаВычетовИтог = 0;
						ОблагаемаяСуммаДоходаИтог = 0;
						НалогНачисленоИтог = 0;
						
						Пока ВыборкаПоМесяцамНалоговогоПериода.Следующий() Цикл
										
							ВыборкаПоДатамПолученияДохода = ВыборкаПоМесяцамНалоговогоПериода.Выбрать();
							
							Пока ВыборкаПоДатамПолученияДохода.Следующий() Цикл
								ВыводимыеОбласти.Очистить();
								
								НалогПоСтавке30Строка.Параметры.Заполнить(ВыборкаПоДатамПолученияДохода);
								НалогПоСтавке30Строка.Параметры.Месяц = Формат(ВыборкаПоДатамПолученияДохода.МесяцНалоговогоПериода, "ДФ=ММММ");
								НалогПоСтавке30Строка.Параметры.ДатаНачисления = Формат(ВыборкаПоДатамПолученияДохода.ДатаНачисления, "ДФ=дд.ММ.гггг");
								НалогПоСтавке30Строка.Параметры.МесяцНачисления = Формат(ВыборкаПоДатамПолученияДохода.МесяцНачисления, "ДФ=ММММ");
								НалогПоСтавке30Строка.Параметры.ДатаВыплаты = Формат(ВыборкаПоДатамПолученияДохода.ДатаВыплаты, "ДФ=дд.ММ.гггг");
								
								НалогНачислено = Окр(ВыборкаПоДатамПолученияДохода.НалогНачислено); 
								НалогПоСтавке30Строка.Параметры.НалогНачислено = НалогНачислено;
								
								ВыводимыеОбласти.Добавить(НалогПоСтавке30Строка);
								
								Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
						       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
									ВыводимыеОбласти.Добавить(НалогПоСтавке30Шапка);
								КонецЕсли;

								ДокументРезультат.Вывести(НалогПоСтавке30Строка);	
								
								СуммаДоходаИтог = СуммаДоходаИтог + ВыборкаПоДатамПолученияДохода.СуммаДохода;
								СуммаВычетовИтог = СуммаВычетовИтог + ВыборкаПоДатамПолученияДохода.СуммаВычета;
								ОблагаемаяСуммаДоходаИтог = ОблагаемаяСуммаДоходаИтог + ВыборкаПоДатамПолученияДохода.ОблагаемаяСуммаДохода;
								НалогНачисленоИтог = НалогНачисленоИтог + НалогНачислено;
								
							КонецЦикла;	
						КонецЦикла;
						НалогПоСтавке30Итог.Параметры.СуммаДохода = СуммаДоходаИтог;
						НалогПоСтавке30Итог.Параметры.СуммаВычета = СуммаВычетовИтог;
						НалогПоСтавке30Итог.Параметры.ОблагаемаяСуммаДохода = ОблагаемаяСуммаДоходаИтог;
						НалогПоСтавке30Итог.Параметры.НалогНачислено = НалогНачисленоИтог;
						
						ВыводимыеОбласти.Очистить();
						ВыводимыеОбласти.Добавить(НалогПоСтавке30Итог);
						
						Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
				       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							ВыводимыеОбласти.Добавить(НалогПоСтавке30Шапка);
						КонецЕсли;

						ДокументРезультат.Вывести(НалогПоСтавке30Итог);
						
						СтрокаТаблицыИтогов = ТаблицаПоНалогамИтоги.Добавить();
						СтрокаТаблицыИтогов.ОКАТО_КПП = ОКАТО_КПП;
						СтрокаТаблицыИтогов.Ставка = Перечисления.НДФЛСтавки.Ставка30;
						СтрокаТаблицыИтогов.ОбщаяСуммаДохода = ВыборкаПоРазделам.СуммаДохода;
						СтрокаТаблицыИтогов.НалоговаяБаза = ОблагаемаяСуммаДоходаИтог;
					КонецЕсли;	
					
					ВыборкаПоРазделам.Сбросить();
					
					ВыводимыеОбласти.Очистить();
					Если ВыборкаПоРазделам.НайтиСледующий("Раздел4_Ставка35_15_9", "Раздел") Тогда
						ВыводимыеОбласти.Добавить(НалогПоСтавке9Заголовок);
						ВыводимыеОбласти.Добавить(НалогПоСтавке9Шапка);
						ВыводимыеОбласти.Добавить(НалогПоСтавке9Строка);
						
						Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
				       		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
						КонецЕсли;

						ДокументРезультат.Вывести(НалогПоСтавке9Заголовок);
						ДокументРезультат.Вывести(НалогПоСтавке9Шапка);
						
						ВыборкаПоМесяцамНалоговогоПериода = ВыборкаПоРазделам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						СуммаДоходаИтог = 0;
						СуммаВычетовИтог = 0;
						ОблагаемаяСуммаДоходаИтог = 0;
						НалогНачисленоИтог = 0;
						
						Пока ВыборкаПоМесяцамНалоговогоПериода.Следующий() Цикл
										
							ВыборкаПоДатамПолученияДохода = ВыборкаПоМесяцамНалоговогоПериода.Выбрать();
							
							Пока ВыборкаПоДатамПолученияДохода.Следующий() Цикл
								ВыводимыеОбласти.Очистить();
								НалогПоСтавке9Строка.Параметры.Заполнить(ВыборкаПоДатамПолученияДохода);
								НалогПоСтавке9Строка.Параметры.Месяц = Формат(ВыборкаПоДатамПолученияДохода.МесяцНалоговогоПериода, "ДФ=ММММ");
								НалогПоСтавке9Строка.Параметры.ДатаНачисления = Формат(ВыборкаПоДатамПолученияДохода.ДатаНачисления, "ДФ=дд.ММ.гггг");
								НалогПоСтавке9Строка.Параметры.ДатаВыплаты = Формат(ВыборкаПоДатамПолученияДохода.ДатаВыплаты, "ДФ=дд.ММ.гггг");
								
								НалогНачислено = Окр(ВыборкаПоДатамПолученияДохода.НалогНачислено); 
								НалогПоСтавке9Строка.Параметры.НалогНачислено = НалогНачислено;
								
								ВыводимыеОбласти.Добавить(НалогПоСтавке9Строка);
								Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
					       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
									ВыводимыеОбласти.Добавить(НалогПоСтавке9Шапка);
								КонецЕсли;
								
								ДокументРезультат.Вывести(НалогПоСтавке9Строка);	
								
								СуммаДоходаИтог = СуммаДоходаИтог + ВыборкаПоДатамПолученияДохода.СуммаДохода;
								СуммаВычетовИтог = СуммаВычетовИтог + ВыборкаПоДатамПолученияДохода.СуммаВычета;
								ОблагаемаяСуммаДоходаИтог = ОблагаемаяСуммаДоходаИтог + ВыборкаПоДатамПолученияДохода.ОблагаемаяСуммаДохода;
								НалогНачисленоИтог = НалогНачисленоИтог + НалогНачислено;
								
								СтрокаТаблицыИтогов = ТаблицаПоНалогамИтоги.Добавить();
								СтрокаТаблицыИтогов.ОКАТО_КПП = ОКАТО_КПП;
								СтрокаТаблицыИтогов.Ставка = ВыборкаПоДатамПолученияДохода.Ставка;
								СтрокаТаблицыИтогов.ОбщаяСуммаДохода = ВыборкаПоДатамПолученияДохода.СуммаДохода;
								СтрокаТаблицыИтогов.НалоговаяБаза = ВыборкаПоДатамПолученияДохода.ОблагаемаяСуммаДохода;

							КонецЦикла;	
						КонецЦикла;
						НалогПоСтавке9Итог.Параметры.СуммаДохода = СуммаДоходаИтог;
						НалогПоСтавке9Итог.Параметры.СуммаВычета = СуммаВычетовИтог;
						НалогПоСтавке9Итог.Параметры.ОблагаемаяСуммаДохода = ОблагаемаяСуммаДоходаИтог;
						НалогПоСтавке9Итог.Параметры.НалогНачислено = НалогНачисленоИтог;
						
						Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, НалогПоСтавке9Итог) Тогда
			       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							ВыводимыеОбласти.Добавить(НалогПоСтавке9Шапка);
						КонецЕсли;

						ДокументРезультат.Вывести(НалогПоСтавке9Итог);
						
					КонецЕсли;	

					ВыборкаНалогиНачисленныеИтоги.Сбросить();
					
					ДанныеОНалогахНачисленныхПоСтавкам = Новый Соответствие;
					
					ВыводимыеОбласти.Очистить();
					Если ВыборкаНалогиНачисленныеИтоги.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
						ВыборкаНалогиНачисленныеИтогиПоФизЛицу = ВыборкаНалогиНачисленныеИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Если ВыборкаНалогиНачисленныеИтогиПоФизЛицу.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
							ВыборкаНалогиНачисленныеИтогиПоОКАТО = ВыборкаНалогиНачисленныеИтогиПоФизЛицу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Если ВыборкаНалогиНачисленныеИтогиПоОКАТО.НайтиСледующий(ВыборкаОКАТО.КодПоОКАТО, "КодПоОКАТО") Тогда
								ВыборкаНалогиНачисленныеИтогиПоКПП = ВыборкаНалогиНачисленныеИтогиПоОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Если ВыборкаНалогиНачисленныеИтогиПоКПП.НайтиСледующий(ВыборкаКПП.КПП, "КПП") Тогда
									ВыборкаНалогиНачисленныеДетали = ВыборкаНалогиНачисленныеИтогиПоКПП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									
									ВыводимыеОбласти.Добавить(ИсчисленоЗаголовок);
									ВыводимыеОбласти.Добавить(ИсчисленоШапка);
									ВыводимыеОбласти.Добавить(ИсчисленоСтрока);
									
									Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
						       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
									КонецЕсли;

									ДокументРезультат.Вывести(ИсчисленоЗаголовок);
									ДокументРезультат.Вывести(ИсчисленоШапка);
									Пока ВыборкаНалогиНачисленныеДетали.Следующий() Цикл
										ИсчисленоСтрока.Параметры.Месяц = Формат(ВыборкаНалогиНачисленныеДетали.Месяц, "ДФ=ММММ");
										ИсчисленоСтрока.Параметры.Дата = Формат(ВыборкаНалогиНачисленныеДетали.Дата, "ДФ=дд.ММ.гггг");
										ИсчисленоСтрока.Параметры.Ставка = ВыборкаНалогиНачисленныеДетали.Ставка;
										ИсчисленоСтрока.Параметры.Сумма =  ВыборкаНалогиНачисленныеДетали.НалогНачислено;
										
										Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ИсчисленоСтрока) Тогда
							       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
											ДокументРезультат.Вывести(ИсчисленоШапка);
										КонецЕсли;

										ДокументРезультат.Вывести(ИсчисленоСтрока);
										
										Если ДанныеОНалогахНачисленныхПоСтавкам.Получить(ВыборкаНалогиНачисленныеДетали.Ставка) = Неопределено Тогда
											ДанныеОНалогахНачисленныхПоСтавкам.Вставить(ВыборкаНалогиНачисленныеДетали.Ставка, ВыборкаНалогиНачисленныеДетали.НалогНачислено);
										Иначе
											ДанныеОНалогахНачисленныхПоСтавкам[ВыборкаНалогиНачисленныеДетали.Ставка] = ДанныеОНалогахНачисленныхПоСтавкам[ВыборкаНалогиНачисленныеДетали.Ставка] + ВыборкаНалогиНачисленныеДетали.НалогНачислено;
										КонецЕсли;	
									КонецЦикла;
								КонецЕсли;	
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;	
					
					ДанныеОНалогахНачисленныхПоОКАТО.Вставить(ОКАТО_КПП, ДанныеОНалогахНачисленныхПоСтавкам); 
					
					ВыборкаНалогиУдержанныеИтоги.Сбросить();
					
					ДанныеОналогахУдержанныхПоСтавкам = Новый Соответствие;
					
					ВыводимыеОбласти.Очистить();
					Если ВыборкаНалогиУдержанныеИтоги.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
						ВыборкаНалогиУдержанныеИтогиПоФизЛицу = ВыборкаНалогиУдержанныеИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Если ВыборкаНалогиУдержанныеИтогиПоФизЛицу.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
							ВыборкаНалогиУдержанныеИтогиПоОКАТО = ВыборкаНалогиУдержанныеИтогиПоФизЛицу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Если ВыборкаНалогиУдержанныеИтогиПоОКАТО.НайтиСледующий(ВыборкаОКАТО.КодПоОкато, "КодПоОкато") Тогда
								ВыборкаНалогиУдержанныеИтогиПоКПП = ВыборкаНалогиУдержанныеИтогиПоОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Если ВыборкаНалогиУдержанныеИтогиПоКПП.НайтиСледующий(ВыборкаКПП.КПП, "КПП") Тогда

									ВыборкаНалогиУдержанныеДетали = ВыборкаНалогиУдержанныеИтогиПоКПП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									
									ВыводимыеОбласти.Добавить(УдержаноЗаголовок);
									ВыводимыеОбласти.Добавить(УдержаноШапка);
									ВыводимыеОбласти.Добавить(УдержаноСтрока);
									
									Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
						       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
									КонецЕсли;

									ДокументРезультат.Вывести(УдержаноЗаголовок);
									ДокументРезультат.Вывести(УдержаноШапка);
									Пока ВыборкаНалогиУдержанныеДетали.Следующий() Цикл
										УдержаноСтрока.Параметры.Месяц = Формат(ВыборкаНалогиУдержанныеДетали.Месяц, "ДФ=ММММ");
										УдержаноСтрока.Параметры.Дата = Формат(ВыборкаНалогиУдержанныеДетали.Дата, "ДФ=дд.ММ.гггг");
										УдержаноСтрока.Параметры.Ставка = ВыборкаНалогиУдержанныеДетали.Ставка;
										УдержаноСтрока.Параметры.Сумма =  ВыборкаНалогиУдержанныеДетали.НалогУдержано;
										
										Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, УдержаноСтрока) Тогда
							       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
											ДокументРезультат.Вывести(УдержаноШапка);
										КонецЕсли;

										ДокументРезультат.Вывести(УдержаноСтрока);
										
										Если ДанныеОналогахУдержанныхПоСтавкам.Получить(ВыборкаНалогиУдержанныеДетали.Ставка) = Неопределено Тогда
											ДанныеОналогахУдержанныхПоСтавкам.Вставить(ВыборкаНалогиУдержанныеДетали.Ставка, ВыборкаНалогиУдержанныеДетали.НалогУдержано);
										Иначе
											ДанныеОналогахУдержанныхПоСтавкам[ВыборкаНалогиУдержанныеДетали.Ставка] = ДанныеОналогахУдержанныхПоСтавкам[ВыборкаНалогиУдержанныеДетали.Ставка] + ВыборкаНалогиУдержанныеДетали.НалогУдержано;
										КонецЕсли;	

									КонецЦикла;
								КонецЕсли;	
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;		
					
									
					ДанныеОНалогахУдержанныхПоОКАТО.Вставить(ОКАТО_КПП, ДанныеОналогахУдержанныхПоСтавкам);
					
					ВыборкаНалогиВозвращенныеИтоги.Сбросить();
					
					ДанныеОНалогахВозвращенныхПоСтавкам = Новый Соответствие;
					
					ВыводимыеОбласти.Очистить();
					Если ВыборкаНалогиВозвращенныеИтоги.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
						ВыборкаНалогиВозвращенныеИтогиПоФизЛицу = ВыборкаНалогиВозвращенныеИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Если ВыборкаНалогиВозвращенныеИтогиПоФизЛицу.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
							ВыборкаНалогиВозвращенныеИтогиПоОКАТО = ВыборкаНалогиВозвращенныеИтогиПоФизЛицу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Если ВыборкаНалогиВозвращенныеИтогиПоОКАТО.НайтиСледующий(ВыборкаОКАТО.КодПоОкато, "КодПоОкато") Тогда
								ВыборкаНалогиВозвращенныеИтогиПоКПП = ВыборкаНалогиВозвращенныеИтогиПоОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Если ВыборкаНалогиВозвращенныеИтогиПоКПП.НайтиСледующий(ВыборкаКПП.КПП, "КПП") Тогда

									ВыборкаНалогиВозвращенныеДетали = ВыборкаНалогиВозвращенныеИтогиПоКПП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									
									ВыводимыеОбласти.Добавить(ВозвращеноЗаголовок);
									ВыводимыеОбласти.Добавить(УдержаноШапка);
									ВыводимыеОбласти.Добавить(ВозвращеноСтрока);
									
									Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
						       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
									КонецЕсли;

									ДокументРезультат.Вывести(ВозвращеноЗаголовок);
									ДокументРезультат.Вывести(ВозвращеноШапка);
									Пока ВыборкаНалогиВозвращенныеДетали.Следующий() Цикл
										ВозвращеноСтрока.Параметры.Месяц = Формат(ВыборкаНалогиВозвращенныеДетали.Месяц, "ДФ=ММММ");
										ВозвращеноСтрока.Параметры.Дата = Формат(ВыборкаНалогиВозвращенныеДетали.Дата, "ДФ=дд.ММ.гггг");
										ВозвращеноСтрока.Параметры.Ставка = ВыборкаНалогиВозвращенныеДетали.Ставка;
										ВозвращеноСтрока.Параметры.Сумма =  ВыборкаНалогиВозвращенныеДетали.НалогВозвращено;
										
										Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВозвращеноСтрока) Тогда
							       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
											ДокументРезультат.Вывести(ВозвращеноШапка);
										КонецЕсли;

										ДокументРезультат.Вывести(ВозвращеноСтрока);
										
										Если ДанныеОНалогахВозвращенныхПоСтавкам.Получить(ВыборкаНалогиВозвращенныеДетали.Ставка) = Неопределено Тогда
											ДанныеОНалогахВозвращенныхПоСтавкам.Вставить(ВыборкаНалогиВозвращенныеДетали.Ставка, ВыборкаНалогиВозвращенныеДетали.НалогВозвращено);
										Иначе
											ДанныеОНалогахВозвращенныхПоСтавкам[ВыборкаНалогиВозвращенныеДетали.Ставка] = ДанныеОНалогахВозвращенныхПоСтавкам[ВыборкаНалогиВозвращенныеДетали.Ставка] + ВыборкаНалогиВозвращенныеДетали.НалогВозвращено;
										КонецЕсли;	
										
									КонецЦикла;
								КонецЕсли;	
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					//
					
					ДанныеОНалогахВозвращенныхПоОКАТО.Вставить(ОКАТО_КПП, ДанныеОНалогахВозвращенныхПоСтавкам);
		
					ВыборкаНалогиВзысканиеИтоги.Сбросить();
					
					ДанныеОНалогахПереданныхНаВзысканиеПоСтавкам = Новый Соответствие;
					
					ВыводимыеОбласти.Очистить();
					Если ВыборкаНалогиВзысканиеИтоги.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") Тогда
						ВыборкаНалогиВзысканиеИтогиПоФизЛицу = ВыборкаНалогиВзысканиеИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Если ВыборкаНалогиВзысканиеИтогиПоФизЛицу.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
							ВыборкаНалогиВзысканиеИтогиПоОКАТО = ВыборкаНалогиВзысканиеИтогиПоФизЛицу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Если ВыборкаНалогиВзысканиеИтогиПоОКАТО.НайтиСледующий(ВыборкаОКАТО.КодПоОкато, "КодПоОкато") Тогда
								ВыборкаНалогиВзысканиеИтогиПоКПП = ВыборкаНалогиВзысканиеИтогиПоОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Если ВыборкаНалогиВзысканиеИтогиПоКПП.НайтиСледующий(ВыборкаКПП.КПП, "КПП") Тогда

									ВыборкаНалогиВзысканиеДетали = ВыборкаНалогиВзысканиеИтогиПоКПП.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									
									ВыводимыеОбласти.Добавить(ПереданоНаВзысканиеЗаголовок);
									ВыводимыеОбласти.Добавить(ПереданоНаВзысканиеШапка);
									ВыводимыеОбласти.Добавить(ПереданоНаВзысканиеСтрока);
									
									Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
						       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
									КонецЕсли;

									ДокументРезультат.Вывести(ПереданоНаВзысканиеЗаголовок);
									ДокументРезультат.Вывести(ПереданоНаВзысканиеШапка);
									Пока ВыборкаНалогиВзысканиеДетали.Следующий() Цикл
										ПереданоНаВзысканиеСтрока.Параметры.Месяц = Формат(ВыборкаНалогиВзысканиеДетали.Месяц, "ДФ=ММММ");
										ПереданоНаВзысканиеСтрока.Параметры.Дата = Формат(ВыборкаНалогиВзысканиеДетали.Дата, "ДФ=дд.ММ.гггг");
										ПереданоНаВзысканиеСтрока.Параметры.Ставка = ВыборкаНалогиВзысканиеДетали.Ставка;
										ПереданоНаВзысканиеСтрока.Параметры.Сумма =  ВыборкаНалогиВзысканиеДетали.НалогПереданоНаВзыскание;
										
										Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ПереданоНаВзысканиеСтрока) Тогда
							       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
											ДокументРезультат.Вывести(ПереданоНаВзысканиеШапка);
										КонецЕсли;

										ДокументРезультат.Вывести(ПереданоНаВзысканиеСтрока);
										
										Если ДанныеОНалогахПереданныхНаВзысканиеПоСтавкам.Получить(ВыборкаНалогиВзысканиеДетали.Ставка) = Неопределено Тогда
											ДанныеОНалогахПереданныхНаВзысканиеПоСтавкам.Вставить(ВыборкаНалогиВзысканиеДетали.Ставка, ВыборкаНалогиВзысканиеДетали.НалогПереданоНаВзыскание);
										Иначе
											ДанныеОНалогахПереданныхНаВзысканиеПоСтавкам[ВыборкаНалогиВзысканиеДетали.Ставка] = ДанныеОНалогахПереданныхНаВзысканиеПоСтавкам[ВыборкаНалогиВзысканиеДетали.Ставка] + ВыборкаНалогиВзысканиеДетали.НалогПереданоНаВзыскание;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;	
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					ДанныеОНалогахПереданныхНаВзысканиеПоОКАТО.Вставить(ОКАТО_КПП, ДанныеОНалогахПереданныхНаВзысканиеПоСтавкам);
					
					ВыборкаНалогиПеречисленныеИтоги.Сбросить();
					
					ДанныеОНалогахПеречисленныхПоСтавкам = Новый Соответствие;
					
					ВыводимыеОбласти.Очистить();
					Если ВыборкаНалогиПеречисленныеИтоги.НайтиСледующий(ФизЛицо, "ФизЛицо") Тогда
						ВыборкаНалогиПеречисленныеИтогиПоОКАТО = ВыборкаНалогиПеречисленныеИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Если ВыборкаНалогиПеречисленныеИтогиПоОКАТО.НайтиСледующий(ОКАТО_КПП, "ОКАТО_КПП") Тогда
							ВыборкаНалогиПеречисленныеДетали = ВыборкаНалогиПеречисленныеИтогиПоОКАТО.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							ВыводимыеОбласти.Добавить(НалогПеречисленныйЗаголовок);
							ВыводимыеОбласти.Добавить(НалогПеречисленныйШапка);
							ВыводимыеОбласти.Добавить(НалогПеречисленныйСтрока);
							
							Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
								   ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
							КонецЕсли;

							ДокументРезультат.Вывести(НалогПеречисленныйЗаголовок);
							ДокументРезультат.Вывести(НалогПеречисленныйШапка);
							Пока ВыборкаНалогиПеречисленныеДетали.Следующий() Цикл
								НалогПеречисленныйСтрока.Параметры.Месяц = Формат(ВыборкаНалогиПеречисленныеДетали.Месяц, "ДФ=ММММ");
								НалогПеречисленныйСтрока.Параметры.Дата = Формат(ВыборкаНалогиПеречисленныеДетали.Дата, "ДФ=дд.ММ.гггг");
								НалогПеречисленныйСтрока.Параметры.Ставка = ВыборкаНалогиПеречисленныеДетали.Ставка;
								НалогПеречисленныйСтрока.Параметры.Сумма =  ВыборкаНалогиПеречисленныеДетали.Сумма;
								НалогПеречисленныйСтрока.Параметры.РеквизитыПП = ВыборкаНалогиПеречисленныеДетали.НомерПП + " " + Формат(ВыборкаНалогиПеречисленныеДетали.ДатаПП, "ДФ=дд.ММ.гггг");
								
								Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, НалогПеречисленныйСтрока) Тогда
									   ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
									ДокументРезультат.Вывести(НалогПеречисленныйШапка);
								КонецЕсли;

								ДокументРезультат.Вывести(НалогПеречисленныйСтрока);
								
								Если ДанныеОНалогахПеречисленныхПоСтавкам.Получить(ВыборкаНалогиПеречисленныеДетали.Ставка) = Неопределено Тогда
									ДанныеОНалогахПеречисленныхПоСтавкам.Вставить(ВыборкаНалогиПеречисленныеДетали.Ставка, ВыборкаНалогиПеречисленныеДетали.Сумма);
								Иначе
									ДанныеОНалогахПеречисленныхПоСтавкам[ВыборкаНалогиПеречисленныеДетали.Ставка] = ДанныеОНалогахПеречисленныхПоСтавкам[ВыборкаНалогиПеречисленныеДетали.Ставка] + ВыборкаНалогиПеречисленныеДетали.Сумма;
								КонецЕсли;

							КонецЦикла;	
						КонецЕсли;
					КонецЕсли;
					
					ДанныеОНалогахПеречисленныхПоОКАТО.Вставить(ОКАТО_КПП, ДанныеОНалогахПеречисленныхПоСтавкам);
				КонецЦикла;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЕстьДанныеПоДоходам Тогда
		ВыводимыеОбласти.Очистить();
		ВыводимыеОбласти.Добавить(Раздел4);
		
		Если СтатусНаКонецПериода = Перечисления.СтатусыНалогоплательщиковПоНДФЛ.Резидент Тогда
			ВыводимыеОбласти.Добавить(РасчетыНалогаПоСтавке13Заголовок);
		Иначе
			ВыводимыеОбласти.Добавить(НалогПоСтавке30Заголовок);
		КонецЕсли;	
		
		Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, УдержаноСтрока) Тогда
			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Для Каждого Область Из ВыводимыеОбласти Цикл
			ДокументРезультат.Вывести(Область);
		КонецЦикла;	
	КонецЕсли;	

	//ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	
	ВыборкаВычетыИтоги.Сбросить();
	
	ВыводимыеОбласти.Очистить();
	
	ВыводимыеОбласти.Добавить(ПредоставленныеВычетыИтогиЗаголовок);
	ВыводимыеОбласти.Добавить(ПредоставленныеВычетыИтогиШапка);
	ВыводимыеОбласти.Добавить(ПредоставленныеВычетыИтогиСтрока);
	
	Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
   		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;

	ДокументРезультат.Вывести(ПредоставленныеВычетыИтогиЗаголовок);
	ДокументРезультат.Вывести(ПредоставленныеВычетыИтогиШапка);
	
	Если ВыборкаВычетыИтоги.НайтиСледующий(ГоловнаяОрганизация, "ГоловнаяОрганизация") тогда
		ВыборкаФизЛиц  = ВыборкаВычетыИтоги.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаФизЛиц.НайтиСледующий(ФизЛицо, "Физлицо") Тогда
			ВыборкаДетали = ВыборкаФизЛиц.Выбрать();
			СуммаВычетаИтог = 0; 
			Пока ВыборкаДетали.Следующий() Цикл
				ПредоставленныеВычетыИтогиСтрока.Параметры.Заполнить(ВыборкаДетали);	
				ПредоставленныеВычетыИтогиСтрока.Параметры.ОКАТО_КПП = СправкиПоНДФЛ.СуммаОКАТОиКПП(ВыборкаДетали.КодПоОкато, ВыборкаДетали.КПП);
				
				Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ПредоставленныеВычетыИтогиСтрока) Тогда
	       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
					ДокументРезультат.Вывести(ПредоставленныеВычетыИтогиШапка);
				КонецЕсли;

				ДокументРезультат.Вывести(ПредоставленныеВычетыИтогиСтрока);
				СуммаВычетаИтог = СуммаВычетаИтог + ВыборкаДетали.СуммаВычета;
			КонецЦикла;
			ПредоставленныеВычетыИтогиИтог.Параметры.СуммаВычета = СуммаВычетаИтог;
			Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ПредоставленныеВычетыИтогиИтог) Тогда
       			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
				ДокументРезультат.Вывести(ПредоставленныеВычетыИтогиШапка);
			КонецЕсли;

			ДокументРезультат.Вывести(ПредоставленныеВычетыИтогиИтог);
		Иначе
			ДокументРезультат.Вывести(ПредоставленныеВычетыИтогиСтрока);
		КонецЕсли;
	Иначе 
		ДокументРезультат.Вывести(ПредоставленныеВычетыИтогиСтрока);	
	КонецЕсли;	
	
	
	ВыводимыеОбласти.Очистить();
	
	ВыводимыеОбласти.Добавить(ОбщиеСуммыИтогЗаголовок);
	ВыводимыеОбласти.Добавить(ОбщиеСуммыИтогШапка);
	ВыводимыеОбласти.Добавить(ОбщиеСуммыСтроки);
	
	Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
   		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;

	ДокументРезультат.Вывести(ОбщиеСуммыИтогЗаголовок);
	ДокументРезультат.Вывести(ОбщиеСуммыИтогШапка);
	
	ТаблицаПоНалогамИтоги.Свернуть("ОКАТО_КПП, Ставка", "ОбщаяСуммаДохода, НалоговаяБаза");
	ТаблицаПоНалогамИтоги.Сортировать("ОКАТО_КПП, Ставка");
	
	Для Каждого НалогиИтоги Из ТаблицаПоНалогамИтоги Цикл
		ОбщиеСуммыСтроки.Параметры.Заполнить(НалогиИтоги);
		
		НалогиИсчисленныеПоОКАТО = ДанныеОНалогахНачисленныхПоОКАТО.Получить(НалогиИтоги.ОКАТО_КПП);
		
		Если НалогиИсчисленныеПоОКАТО = Неопределено Тогда
			СуммаНалогаИсчисленная = 0;
		Иначе
			НалогиИсчисленныеПоСтавкам = НалогиИсчисленныеПоОКАТО.Получить(НалогиИтоги.Ставка);
			СуммаНалогаИсчисленная = ?(НалогиИсчисленныеПоСтавкам = Неопределено, 0, НалогиИсчисленныеПоСтавкам);
		КонецЕсли;	
		
		НалогиУдержанныеПоОКАТО = ДанныеОНалогахУдержанныхПоОКАТО.Получить(НалогиИтоги.ОКАТО_КПП);
		
		Если НалогиУдержанныеПоОКАТО = Неопределено Тогда
			СуммаНалогаУдержанная = 0;
		Иначе
			НалогиУдержанныеПоСтавкам = НалогиУдержанныеПоОКАТО.Получить(НалогиИтоги.Ставка);
			СуммаНалогаУдержанная = ?(НалогиУдержанныеПоСтавкам = Неопределено, 0, НалогиУдержанныеПоСтавкам);
		КонецЕсли;
		
		НалогиВозвращенныеПоОКАТО = ДанныеОНалогахВозвращенныхПоОКАТО.Получить(НалогиИтоги.ОКАТО_КПП);
		
		Если НалогиВозвращенныеПоОКАТО = Неопределено Тогда
			СуммаНалогаВозвращенная = 0;
		Иначе
			НалогиВозвращенныеПоСтавкам = НалогиВозвращенныеПоОКАТО.Получить(НалогиИтоги.Ставка);
			СуммаНалогаВозвращенная = ?(НалогиВозвращенныеПоСтавкам = Неопределено, 0, НалогиВозвращенныеПоСтавкам);
		КонецЕсли;
		
		СуммаНалогаУдержанная = СуммаНалогаУдержанная - СуммаНалогаВозвращенная;
		
		НалогиВзысканиеПоОКАТО = ДанныеОНалогахПереданныхНаВзысканиеПоОКАТО.Получить(НалогиИтоги.ОКАТО_КПП);
		
		Если НалогиВзысканиеПоОКАТО = Неопределено Тогда
			СуммаНалогаВзыскание = 0;
		Иначе
			НалогиВзысканиеПоСтавкам = НалогиВзысканиеПоОКАТО.Получить(НалогиИтоги.Ставка);
			СуммаНалогаВзыскание = ?(НалогиВзысканиеПоСтавкам = Неопределено, 0, НалогиВзысканиеПоСтавкам);
		КонецЕсли;
		
		НалогиПеречисленныеПоОКАТО = ДанныеОНалогахПеречисленныхПоОКАТО.Получить(НалогиИтоги.ОКАТО_КПП);
		
		Если НалогиПеречисленныеПоОКАТО = Неопределено Тогда
			СуммаНалогаПеречисленная = 0;
		Иначе
			НалогиПеречисленныеПоСтавкам = НалогиПеречисленныеПоОКАТО.Получить(НалогиИтоги.Ставка);
			СуммаНалогаПеречисленная = ?(НалогиПеречисленныеПоСтавкам = Неопределено, 0, НалогиПеречисленныеПоСтавкам);
		КонецЕсли;
		
		ОбщиеСуммыСтроки.Параметры.СуммаНалогаИсчичсленная = СуммаНалогаИсчисленная;
		ОбщиеСуммыСтроки.Параметры.СуммаНалогаУдержанная = СуммаНалогаУдержанная;
	    ОбщиеСуммыСтроки.Параметры.СуммаНалогаПеречисленная = СуммаНалогаПеречисленная;
		
		СальдоПоНалогам = СуммаНалогаИсчисленная - СуммаНалогаУдержанная + СуммаНалогаВозвращенная - СуммаНалогаВзыскание;
		
		Если СальдоПоНалогам > 0 Тогда 
			ОбщиеСуммыСтроки.Параметры.СуммаНалогаНеУдержанная = СальдоПоНалогам;	
			ОбщиеСуммыСтроки.Параметры.СуммаНалогаИзлишнеУдержанная = 0;
		Иначе	
			ОбщиеСуммыСтроки.Параметры.СуммаНалогаИзлишнеУдержанная = -СальдоПоНалогам;
			ОбщиеСуммыСтроки.Параметры.СуммаНалогаНеУдержанная = 0;
		КонецЕсли;	
		Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ОбщиеСуммыСтроки) Тогда
   			ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
			ДокументРезультат.Вывести(ОбщиеСуммыИтогШапка);
		КонецЕсли;

		ДокументРезультат.Вывести(ОбщиеСуммыСтроки);
	КонецЦикла;	
		
	ВыборкаСправкиНДФЛ.Сбросить();
	
	ВыводимыеОбласти.Очистить();
	ВыводимыеОбласти.Добавить(Раздел7);
	ВыводимыеОбласти.Добавить(Подписи);
	
	Если Не ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ДокументРезультат, ВыводимыеОбласти) Тогда
   		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;

	Если ВыборкаСправкиНДФЛ.НайтиСледующий(ФизЛицо, "Физлицо") Тогда
		ВыборкаПоСправкам = ВыборкаСправкиНДФЛ.Выбрать();
		
		Пока ВыборкаПоСправкам.Следующий() Цикл
			Раздел7.Параметры["НомерСправки" + Строка(ВыборкаПоСправкам.ТипСправки)] = ВыборкаПоСправкам.НомерСправки;
			Раздел7.Параметры["ДатаСправки" + Строка(ВыборкаПоСправкам.ТипСправки)] = Формат(ВыборкаПоСправкам.ДатаСправки, "ДФ=дд.ММ.гггг");
		КонецЦикла;
	КонецЕсли;	
	
	ДокументРезультат.Вывести(Раздел7);
	
	
	Подписи.Параметры.ДатаПодписи = Формат(ДатаПодписи, "ДФ=dd.MM.yyyy");
	Подписи.Параметры.ФИООтветственного = ДанныеОФизЛицеОрганизации.Ответственный_ФИО;
	Подписи.Параметры.ДолжностьОтветственного = ДанныеОФизЛицеОрганизации.Ответственный_Должность;
	
	ДокументРезультат.Вывести(Подписи);
КонецПроцедуры

#КонецЕсли

// Настройка отчета при отработки расшифровки
Процедура Настроить(Отбор) Экспорт
	
	// Настройка отбора
	Для каждого ЭлементОтбора Из Отбор Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ПолеОтбора = ЭлементОтбора.ЛевоеЗначение;
		Иначе
			ПолеОтбора = Новый ПолеКомпоновкиДанных(ЭлементОтбора.Поле);
		КонецЕсли;
		
		Если КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(ПолеОтбора) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлементОтбора, ЭлементОтбора);
		Иначе
			НовыйЭлементОтбора.Использование  = Истина;
			НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
			Если ЭлементОтбора.Иерархия Тогда
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
				КонецЕсли;
			Иначе
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				КонецЕсли;
			КонецЕсли;
			
			НовыйЭлементОтбора.ПравоеЗначение = ЭлементОтбора.Значение;
			
		КонецЕсли;
				
	КонецЦикла;
	
	ТиповыеОтчеты.УдалитьДублиОтбора(КомпоновщикНастроек);
	
КонецПроцедуры

Процедура СохранитьНастройку() Экспорт

	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры

Процедура ПрименитьНастройку() Экспорт
	
	Схема = ТиповыеОтчеты.ПолучитьСхемуКомпоновкиОбъекта(ЭтотОбъект);

	// Считываение структуры настроек отчета
 	Если Не СохраненнаяНастройка.Пустая() Тогда
		
		СтруктураНастроек = СохраненнаяНастройка.ХранилищеНастроек.Получить();
		Если Не СтруктураНастроек = Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураНастроек.НастройкиКомпоновщика);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураНастроек);
		Иначе
			КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
		КонецЕсли;
		
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	КонецЕсли;

КонецПроцедуры

Функция СоздатьПустуюТаблицуИтогов()
	ТаблицаИтогов = Новый ТаблицаЗначений();	
	ТаблицаИтогов.Колонки.Добавить("ОКАТО_КПП");
	ТаблицаИтогов.Колонки.Добавить("Ставка");
	ТаблицаИтогов.Колонки.Добавить("ОбщаяСуммаДохода");
    ТаблицаИтогов.Колонки.Добавить("НалоговаяБаза");
		
	Возврат ТаблицаИтогов;
КонецФункции	

Процедура ПередВыводомЭлементРезультата(МакетКомпоновки, ПроцессорКомпоновки, ЭлементРезультата) Экспорт
	
КонецПроцедуры

Процедура ПередВыводомОтчета(МакетКомпоновки, ПроцессорКомпоновки) Экспорт
	
	
КонецПроцедуры

Процедура ПриВыводеЗаголовкаОтчета(ОбластьЗаголовок) Экспорт
КонецПроцедуры

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	СписокПолейПодстановкиОтборовПоУмолчанию = Новый Соответствие;
	СписокПолейПодстановкиОтборовПоУмолчанию.Вставить("Организация", "ОсновнаяОрганизация");
	
	Возврат Новый Структура("ИспользоватьСобытияПриФормированииОтчета,
	|ПриВыводеЗаголовкаОтчета,
	|ПослеВыводаПанелиПользователя,
	|ПослеВыводаПериода,
	|ПослеВыводаПараметра,
	|ПослеВыводаГруппировки,
	|ПослеВыводаОтбора,
	|ДействияПанелиИзменениеФлажкаДопНастроек,
	|ПриПолучениеНастроекПользователя, 
	|ЗаполнитьОтборыПоУмолчанию, 
	|СписокПолейПодстановкиОтборовПоУмолчанию,
	|СписокДоступныхПредопределенныхНастроек,
	|МинимальныйПериодОтчета", 
	ложь, ложь, ложь, ложь, ложь, ложь, ложь, ложь, ложь, истина, СписокПолейПодстановкиОтборовПоУмолчанию,, "Год");

КонецФункции


Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

Если СохраненнаяНастройка = Неопределено Тогда
	СохраненнаяНастройка =  Справочники.СохраненныеНастройки.ПустаяСсылка();
КонецЕсли;

Если КомпоновщикНастроек = Неопределено Тогда
	КомпоновщикНастроек =  Новый КомпоновщикНастроекКомпоновкиДанных;
КонецЕсли;

УправлениеОтчетами.ЗаменитьНазваниеПолейСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
