
///////////////////////////////////////////////////////////////////////////////
// ИНФОРМАЦИОННЫЕ БАЗЫ ДЛЯ ОБМЕНА
//////////////////////////////////////////////////////////////////////////////

Функция ПрефиксИнформационнойБазыПоУмолчанию() Экспорт
	
	Возврат "БП";
	
КонецФункции

// {ОбменДаннымиСУправлениемТорговлей

Функция ПолучитьТаблицуВозможныхОбменов() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ИмяКонфигурации");
	Таблица.Колонки.Добавить("ИмяПланаОбмена");
	Таблица.Колонки.Добавить("НаименованиеКонфигурации");
	Таблица.Колонки.Добавить("ПредставлениеКонфигурации");
	Таблица.Колонки.Добавить("ПрефиксПоУмолчанию");
	
	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.ИмяКонфигурации = "УТ"; // определяет макет с правилами обмена
	СтрокаТаблицы.ИмяПланаОбмена = "ОбменУправлениеТорговлейБухгалтерияКОРП"; // определяет имя плана обмена откуда брать данные
	СтрокаТаблицы.НаименованиеКонфигурации = "Управление торговлей, редакция 10.3";
	СтрокаТаблицы.ПредставлениеКонфигурации = "1С:Управление торговлей 8 (начиная с версии 10.3)"; // представление для пользователя
	СтрокаТаблицы.ПрефиксПоУмолчанию = "УТ"; // Префикс по умолчанию
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьИнформациюОТекущейИнформационнойБазе() Экспорт
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ИмяКонфигурации", "БП");
	СтруктураДанных.Вставить("ИмяПланаОбмена", "ОбменУправлениеТорговлейБухгалтерияКОРП");
	СтруктураДанных.Вставить("НаименованиеКонфигурации", Метаданные.Синоним);
	СтруктураДанных.Вставить("ПредставлениеКонфигурации", "Бухгалтерия предприятия, редакция 2.0");
	СтруктураДанных.Вставить("ПрефиксПоУмолчанию", "БП");
	
	Возврат СтруктураДанных;
	
КонецФункции

Процедура ОткрытьФормуВыполненияОбменаСУправлениеТорговлей() Экспорт
	
	ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
	ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияКОРП.ПустаяСсылка();
	
	ФормаВыполненияОбмена.Открыть();
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаСТорговлей() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.ТипДанныхДляПоказа = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияКОРП.ПустаяСсылка();
	ФормаМонитора.Открыть();
	
КонецПроцедуры

// }ОбменДаннымиСУправлениемТорговлей

Процедура ОткрытьФормуВыполненияОбменаРИБ() Экспорт
	
	ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
	ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.Полный.ПустаяСсылка();
		
	ФормаВыполненияОбмена.Открыть();
	
КонецПроцедуры

Процедура ОткрытьФормуВыполненияОбменаРИБПоОрганизации() Экспорт
	
	ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
	ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.ПоОрганизации.ПустаяСсылка();
		
	ФормаВыполненияОбмена.Открыть();
	
КонецПроцедуры
	
Процедура ОткрытьМониторОбменовДляОбменаРИБ() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.ТипДанныхДляПоказа = ПланыОбмена.Полный.ПустаяСсылка();
	ФормаМонитора.Открыть();	
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаРИБПоОрганизации() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.ТипДанныхДляПоказа = ПланыОбмена.ПоОрганизации.ПустаяСсылка();
	ФормаМонитора.Открыть();	
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаВсе() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.Открыть();	
	
КонецПроцедуры

Процедура ОткрытьФормуНастроекОбменаРИБ() Экспорт
	
	ФормаCписка = ПолучитьОбщуюФорму("ФормаСпискаНастроекОбмена",, "НастройкиОбменаРИБ");
	ФормаCписка.ТипОбменаПоУмолчанию = ПланыОбмена.Полный.ПустаяСсылка();
	ФормаCписка.Открыть();
	
КонецПроцедуры

Процедура ОткрытьФормуНастроекОбменаРИБПоОрганизации() Экспорт
	
	ФормаCписка = ПолучитьОбщуюФорму("ФормаСпискаНастроекОбмена",, "НастройкиОбменаРИБ");
	ФормаCписка.ТипОбменаПоУмолчанию = ПланыОбмена.ПоОрганизации.ПустаяСсылка();
	ФормаCписка.Открыть();
	
КонецПроцедуры

// {ОбменДаннымиСРозницей

/////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДДЕРЖКИ ОБМЕНА С РОЗНИЦЕЙ

Функция ПолучитьТаблицуВозможныхОбменовСБухгалтерией2() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ИмяКонфигурации");
	Таблица.Колонки.Добавить("ИмяПланаОбмена");
	Таблица.Колонки.Добавить("НаименованиеКонфигурации");
	Таблица.Колонки.Добавить("ПредставлениеКонфигурации");
	Таблица.Колонки.Добавить("ПрефиксПоУмолчанию");

	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.ИмяКонфигурации           = "РТ"; 
	СтрокаТаблицы.ИмяПланаОбмена            = "ОбменРозницаБухгалтерия20";
	СтрокаТаблицы.НаименованиеКонфигурации  = "Розница, редакция 1.0";
	СтрокаТаблицы.ПредставлениеКонфигурации = "Розница, редакция 1.0";
	СтрокаТаблицы.ПрефиксПоУмолчанию        = "РТ";                   
	
	Возврат Таблица;                               
	
КонецФункции

// Функция получает структуру информации о текущей базе для обмена с УТ
//
Функция ПолучитьИнформациюОТекущейИнформационнойБазеРТБП2() Экспорт
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ИмяКонфигурации", "БП2");
	СтруктураДанных.Вставить("ИмяПланаОбмена", "ОбменРозницаБухгалтерия20");
	СтруктураДанных.Вставить("НаименованиеКонфигурации", Метаданные.Синоним);
	СтруктураДанных.Вставить("ПредставлениеКонфигурации", "Бухгалтерия предприятия, редакция 2.0");
	СтруктураДанных.Вставить("ПрефиксПоУмолчанию", "БП");
	
	Возврат СтруктураДанных;
	
КонецФункции

Процедура ОткрытьФормуВыполненияОбменаСРозницей() Экспорт
	
	ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
	ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.ОбменРозницаБухгалтерия20.ПустаяСсылка();
	
	ФормаВыполненияОбмена.Открыть();
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаСРозницей() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.ТипДанныхДляПоказа = ПланыОбмена.ОбменРозницаБухгалтерия20.ПустаяСсылка();
	ФормаМонитора.Открыть();
	
КонецПроцедуры
	
// }ОбменДаннымиСРозницей

// {ОбменДаннымиБСП

/////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДДЕРЖКИ ОБМЕНА БСП

Процедура ОткрытьФормуУправленияОбменамиДанных() Экспорт
	
	#Если Клиент Тогда
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОбменДанными") <> Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупрежденияИспользованияОбменаДанными82());
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.УправлениеОбменамиДанных");
	#КонецЕсли
	
КонецПроцедуры

Процедура ОткрытьФормуСценариевОбменовДанными() Экспорт
	
	#Если Клиент Тогда
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОбменДанными") <> Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупрежденияИспользованияОбменаДанными82());
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.СценарииОбменовДанными.Форма.НастройкаРасписанияОбменовДанными");
	#КонецЕсли
	
КонецПроцедуры

Функция ТекстПредупрежденияИспользованияОбменаДанными82()
	
	Возврат НСтр("ru = 'Данная возможность недоступна. Обратитесь к системному администратору.'");
	
КонецФункции

// }ОбменДаннымиБСП
