
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

Процедура ПодготовитьТаблицыДокумента(ТаблицаВыручки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("СчетФактура", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВводНачальныхОстатковДанныеПоСФНДС.СчетУчета КАК СчетУчетаНДС,
	               |	ВводНачальныхОстатковДанныеПоСФНДС.СтавкаНДС,
	               |	ВводНачальныхОстатковДанныеПоСФНДС.НДС,
	               |	ВводНачальныхОстатковДанныеПоСФНДС.СуммаБезНДС,
	               |	ВводНачальныхОстатковДанныеПоСФНДС.ВидЦенности
	               |ИЗ
	               |	Документ.ВводНачальныхОстатков.ДанныеПоСФНДС КАК ВводНачальныхОстатковДанныеПоСФНДС
	               |ГДЕ
	               |	ВводНачальныхОстатковДанныеПоСФНДС.Ссылка.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаДляВводаОстатков.НДСПоПриобретеннымЦенностям)
	               |	И ВводНачальныхОстатковДанныеПоСФНДС.СчетФактура = &СчетФактура";
				   
	ТаблицаВыручки = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДокументОснование = Неопределено;
	СуммаДокумента = 0;
КонецПроцедуры
