
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ, ВЫЗЫВАЕМЫЕ ИЗ ЭЛЕМЕНТОВ ФОРМЫ

// Обработчик события "Нажатие" кнопки "ОК" командной панели формы "ОсновныеДействияФормы"
// 
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	Перем HTTP;
	
	Если ЗапомнитьИмяИПароль Тогда
		СохранитьЗначение("ЗапомнитьИмяИПароль", Истина);
		СохранитьЗначение("ИмяПользователя", ИмяПользователя);
		СохранитьЗначение("ПарольПользователя", ПарольПользователя);
	Иначе
		СохранитьЗначение("ЗапомнитьИмяИПароль", Ложь);
		СохранитьЗначение("ИмяПользователя", "");
		СохранитьЗначение("ПарольПользователя", "");
	КонецЕсли; 
	
	Попытка
		ПроксиСервер = Новый ИнтернетПрокси();
		ПроксиСервер.Пользователь = ИмяПользователя;
		ПроксиСервер.Пароль       = ПарольПользователя;
		HTTP = Новый HTTPСоединение(СерверИсточник,,,, ПроксиСервер);
	Исключение
		Сообщить("" + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	ЭтаФорма.Закрыть(HTTP);
	
КонецПроцедуры

// Обработчик события "Нажатие" кнопки "Отмена" командной панели формы "ОсновныеДействияФормы"
// 
Процедура ОсновныеДействияФормыОтмена(Кнопка)
	
	ЭтаФорма.Закрыть(Неопределено);
	
КонецПроцедуры


