Перем ТекущийМакет Экспорт;   										//	Содержит идентификатор текущего макета отчета
Перем КоллекцияНастроек Экспорт;									//	Содержит коллекцию настроек системы компоновки данных
Перем СтруктураВнешнихНаборов Экспорт;								//	Структура, хранит таблицы выборок, которые служат внешними наборами данных для макетов СКД
Перем ИдентификаторКонфигурации Экспорт;							//	Содержит идентификатор конфигурации
Перем РедакцияКонфигурации Экспорт;                                 //	Содержит редакцию конфигурации
Перем УчетОбособленныхПодразделений Экспорт;   						//	Признак учета в программе обособленных подразделений
Перем ЗначениеВключатьОбособленныеПодразделения, ЗначениеОрганизация, ЗначениеПериод;  //	Параметры отчета, действовавшие на момент формирования
Перем СписокРасшифровокСДетализацией Экспорт;						//	Хранит список расшифровок имеющих детализацию ошибок
Перем ДанныеРасшифровкиТабличногоДокумента Экспорт;

#Если Клиент Тогда
	
//  Создает запрос, устанавливает параметры запроса 
//
//
// Возвращаемое значение:
//   Запрос   - заготовка запроса, с установленными параметрами
//
Функция ПолучитьПараметрыЗапроса()
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	НеОтражаютсяВРазделеНачислениеПоРеализации = Новый СписокЗначений;
	НеОтражаютсяВРазделеНачислениеПоРеализации.Добавить(Перечисления.НДСВидНачисления.НДСсАвансов);
	НеОтражаютсяВРазделеНачислениеПоРеализации.Добавить(Перечисления.НДСВидНачисления.НДСВосстановлен);
	НеОтражаютсяВРазделеНачислениеПоРеализации.Добавить(Перечисления.НДСВидНачисления.НДСНачисленКУплате);
	НеОтражаютсяВРазделеНачислениеПоРеализации.Добавить(Перечисления.НДСВидНачисления.РеализацияЕНВД);
	НеОтражаютсяВРазделеНачислениеПоРеализации.Добавить(Перечисления.НДСВидНачисления.Реализация0);
	
	НеОтражаютсяВРазделеНачислениеПоРеализацииСложныйУчет = Новый СписокЗначений;
	НеОтражаютсяВРазделеНачислениеПоРеализацииСложныйУчет.Добавить(Перечисления.НДСВидНачисления.НДСсАвансов);
	НеОтражаютсяВРазделеНачислениеПоРеализацииСложныйУчет.Добавить(Перечисления.НДСВидНачисления.НДСНачисленКУплате);
	НеОтражаютсяВРазделеНачислениеПоРеализацииСложныйУчет.Добавить(Перечисления.НДСВидНачисления.РеализацияЕНВД);
	НеОтражаютсяВРазделеНачислениеПоРеализацииСложныйУчет.Добавить(Перечисления.НДСВидНачисления.Реализация0);
	
	ВидыЦенностейАвансыВсе = Новый СписокЗначений;
	ВидыЦенностейАвансыВсе.Добавить(Перечисления.ВидыЦенностей.АвансыВыданные);
	ВидыЦенностейАвансыВсе.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные);
	ВидыЦенностейАвансыВсе.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные0);
	
	ВидыЦенностейАвансыПолученные = Новый СписокЗначений;
	ВидыЦенностейАвансыПолученные.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные);
	ВидыЦенностейАвансыПолученные.Добавить(Перечисления.ВидыЦенностей.АвансыПолученные0);
	
	ВидыЦенностейНалоговыйАгент = Новый СписокЗначений;
	ВидыЦенностейНалоговыйАгент.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентАренда);
	ВидыЦенностейНалоговыйАгент.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентИностранцы);
	ВидыЦенностейНалоговыйАгент.Добавить(Перечисления.ВидыЦенностей.НалоговыйАгентРеализацияИмущества);
	
	СписокСчетовАвансовПолученных = Новый СписокЗначений;
	СписокСчетовАвансовПолученных.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным); 
	СписокСчетовАвансовПолученных.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученнымВал);
	СписокСчетовАвансовПолученных.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученнымУЕ);
	
	СписокСчетовАвансовВыданных = Новый СписокЗначений;
	СписокСчетовАвансовВыданных.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);
	СписокСчетовАвансовВыданных.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданнымВал);
	СписокСчетовАвансовВыданных.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданнымУЕ);
	
	СписокВидовСубконто = Новый СписокЗначений;
	СписокВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	СписокВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	
	Если ИдентификаторКонфигурации = "БП" Тогда
		СписокВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
		СчетВыручкиЕНВД = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД;
	Иначе
		СчетВыручкиЕНВД = ПланыСчетов.Хозрасчетный.ВыручкаОблагаемаяЕНВД;
	КонецЕсли;	
		
	Если УчетОбособленныхПодразделений И ВключатьОбособленныеПодразделения Тогда
		СписокОрганизаций = ОбщегоНазначения.ПолучитьСписокОбособленныхПодразделений(Организация);
	Иначе
		СписокОрганизаций = Новый СписокЗначений;
		СписокОрганизаций.Добавить(Организация);
	КонецЕсли;	
	
	//	Установка параметров запроса
	
	//	Необходимо проверить остатки по регистру НДС начисленный после регламентных документов
	Запрос.УстановитьПараметр("НачалоСледующегоПериода", 							КонецДня(КонецПериода) + 1);
	Запрос.УстановитьПараметр("НачалоПериода",										НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериодаГраница", 								Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода", 										КонецДня(КонецПериода));	
	Запрос.УстановитьПараметр("Организация",										СписокОрганизаций);
	Запрос.УстановитьПараметр("НеОтражаютсяВРазделеНачислениеПоРеализации",			НеОтражаютсяВРазделеНачислениеПоРеализации);
	Запрос.УстановитьПараметр("ПустаяСсылкаНаСчетФактуруВыданный", 					Документы.СчетФактураВыданный.ПустаяСсылка());
	Запрос.УстановитьПараметр("НДСсАвансов", 										Перечисления.НДСВидНачисления.НДСсАвансов);
	Запрос.УстановитьПараметр("СписокСчетовАвансовПолученных",						СписокСчетовАвансовПолученных);
	Запрос.УстановитьПараметр("СписокСчетовАвансовВыданных", 						СписокСчетовАвансовВыданных);
	
	Запрос.УстановитьПараметр("ВидыСубконто", 										СписокВидовСубконто);
    Запрос.УстановитьПараметр("ВидыЦенностейНалоговыйАгент",						ВидыЦенностейНалоговыйАгент); 
	Запрос.УстановитьПараметр("ВидыЦенностейАвансыВсе", 							ВидыЦенностейАвансыВсе);
	Запрос.УстановитьПараметр("ВидыЦенностейАвансыПолученные",						ВидыЦенностейАвансыПолученные);
	Запрос.УстановитьПараметр("ВыручкаЕНВД",										СчетВыручкиЕНВД);
	Запрос.УстановитьПараметр("ПустаяНоменклатура", 								Справочники.Номенклатура.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("НеОтражаютсяВРазделеНачислениеПоРеализацииСложныйУчет", НеОтражаютсяВРазделеНачислениеПоРеализацииСложныйУчет);
	
	//	Тексты ошибок
	
	Запрос.УстановитьПараметр("ТекстОтраженыВКнигеПродаж", 		НСтр("ru='Отражены в книге продаж'"));
	Запрос.УстановитьПараметр("ТекстНеОтраженыВКнигеПродаж", 	НСтр("ru='Не отражены в книге продаж'"));	
	Запрос.УстановитьПараметр("ТекстОтраженыВКнигеПокупок", 	НСтр("ru='Отражены в книге покупок'"));	
	Запрос.УстановитьПараметр("ТекстНеОтраженыВКнигеПокупок", 	НСтр("ru='Не отражены в книге покупок'"));	
	
	Запрос.УстановитьПараметр("ТекстБезОшибок", 	НСтр("ru='Без ошибок'"));
	
	Запрос.УстановитьПараметр("ТекстОшибкаПоступлениеПоРазнымСтавкам", 
		НСтр("ru='Ошибка: Поступление одной номенклатуры по разным ставкам'"));
	
	Запрос.УстановитьПараметр("ТекстОшибкаРеализацияПоРазнымСтавкам", 
		НСтр("ru='Ошибка: Реализация одной номенклатуры по разным ставкам'"));
		
	Запрос.УстановитьПараметр("ТекстОшибкаРеализацияЕНВДСНДС", 
		НСтр("ru='Ошибка: Начислен НДС при реализации по деятельности, облагаемой ЕНВД'"));
		
	Запрос.УстановитьПараметр("ТекстОшибкаРеализацияЭкспортСНДС", 
		НСтр("ru='Ошибка: Реализация по экспортному договору по ставке, отличной от 0%'"));
		
	Запрос.УстановитьПараметр("ТекстОшибкаРеализацияБезСФ", 
		НСтр("ru='Ошибка: Не выписан счет-фактура при реализации'"));	
	
	Запрос.УстановитьПараметр("ТекстНДСНеУчитывается", 
		НСтр("ru='Не установлен флажок ""Учитывать НДС""'"));
	
	Запрос.УстановитьПараметр("ТекстНДСВключенВСтоимость", 
		НСтр("ru='НДС включен в стоимость'"));
	
	Запрос.УстановитьПараметр("ТекстНачислениеНеОтраженоВКнигеПродаж", 
		НСтр("ru='Начисление не отражено в книге продаж'"));
		
	Запрос.УстановитьПараметр("ТекстКорректировкаКнигиПродаж", 
		НСтр("ru='Произведена корректировка документов, уже отраженных в книге продаж'"));
	
	Запрос.УстановитьПараметр("ТекстПолученныйАвансБезСФ", 
		НСтр("ru='Не выписан счет-фактура на полученный аванс'"));
	
	Запрос.УстановитьПараметр("ТекстСФНаАвансПоНепроведенномуПоручению", 
		НСтр("ru='Ошибка: Счет-фактура на аванс выписан по непроведенному платежному поручению'"));	
		
	Запрос.УстановитьПараметр("ТекстСФНаПолученныйАвансНеПроведен", 
		НСтр("ru='Счет-фактура на полученный аванс выписан, но не проведен'"));
		
	Запрос.УстановитьПараметр("ТекстСФНалоговогоАгентаНеВыписан", 
		НСтр("ru='Счет-фактура налогового агента не выписан'"));
			
	Запрос.УстановитьПараметр("ТекстСФНалоговогоАгентаНеПроведен", 
		НСтр("ru='Счет-фактура налогового агента выписан, но не проведен'"));	
		
	Запрос.УстановитьПараметр("ТекстВыданныйАвансНеОтраженВКнигеПокупок", 
		НСтр("ru='НДС с выданного аванса не отражен в книге покупок'"));	
		
	Запрос.УстановитьПараметр("ТекстОплаченныеЦенностиНеПоступили", 
		НСтр("ru='Оплаченные ценности пока не поступили'"));	
		
	Запрос.УстановитьПараметр("ТекстНДСПолностьюВосстановлен", 
		НСтр("ru='НДС полностью восстановлен'"));	
		
	Запрос.УстановитьПараметр("ТекстНДСВосстановленЧастично", 
		НСтр("ru='НДС восстановлен частично'"));	
		          		
	Запрос.УстановитьПараметр("ТекстОбъектНеПринятКУчету", 
		НСтр("ru='Объект ОС или НМА пока не принят к учету'"));	
		
	Запрос.УстановитьПараметр("ТекстНеПодтвержденаСтавка", 
		НСтр("ru='Не подтверждена ставка 0%'"));	
		
	Запрос.УстановитьПараметр("ТекстОтсутствуетСФПолученный", 
		НСтр("ru='Отсутствует счет-фактура полученный'"));	
		
	Запрос.УстановитьПараметр("ТекстСФПолученныйНеПроведен", 
		НСтр("ru='Счет-фактура полученный не проведен'"));	
		
	Запрос.УстановитьПараметр("ТекстВычетНеОтраженВКнигеПокупок", 
		НСтр("ru='Вычет не отражен в книге покупок'"));	
		
	Запрос.УстановитьПараметр("ТекстКорректировкаКнигиПокупок", 
		НСтр("ru='Произведена корректировка документов, уже отраженных в книге покупок'"));
		
	Запрос.УстановитьПараметр("ТекстПоступлениеНеОплаченоПоставщику", 
		НСтр("ru='Поступление по договору с исполнением обязанностей налогового агента не оплачено поставщику'"));	
		
	Запрос.УстановитьПараметр("ТекстНДСНеУплаченВБюджет", 
		НСтр("ru='НДС, начисленный при исполнении обязанностей налогового агента, не уплачен в бюджет'"));	
		
	Запрос.УстановитьПараметр("ТекстПолученныйАвансНеОтраженВКнигеПродаж", 
		НСтр("ru='НДС с полученного аванса не отражен в книге продаж'"));	
		
	Запрос.УстановитьПараметр("ТекстОплаченныеЦенностиНеРеализованы", 
		НСтр("ru='Оплаченные ценности пока не реализованы'"));	
		
	Запрос.УстановитьПараметр("ТекстНДСПринятКВычетуПолностью", 
		НСтр("ru='НДС принят к вычету полностью'"));	
		
	Запрос.УстановитьПараметр("ТекстНДСПринятКВычетуЧастично", 
		НСтр("ru='НДС принят к вычету частично'"));	
		
	Запрос.УстановитьПараметр("ТекстВыданныйАвансБезСФ", 
		НСтр("ru='Не выписан счет-фактура на выданный аванс'"));	
		
	Запрос.УстановитьПараметр("ТекстСФНаВыданныйАвансНеПроведен", 
		НСтр("ru='Счет-фактура на выданный аванс выписан, но не проведен'"));	
		
	Запрос.УстановитьПараметр("ТекстНДССписанНаРасходы", 
		НСтр("ru='НДС списан на расходы'"));	
		
	Запрос.УстановитьПараметр("ТекстВычетНеОтраженДоПодтвержденияСтавки0", 
		НСтр("ru='Вычет НДС не может быть отражен до подтверждения ставки 0%'"));
		
	Запрос.УстановитьПараметр("ТекстСноска", НСтр("ru='*'"));
		
	Запрос.УстановитьПараметр("ТекстНетСноски", НСтр("ru=''"));
	
	Запрос.УстановитьПараметр("ТекстОбъектНеПринятКУчетуОбъектСтроительства", 
		НСтр("ru='Объект строительства пока не принят к учету'"));
		
	Возврат Запрос;
	
КонецФункции

//	Программно выполняет отчет в системе компоновки данных на основе переданного макета и внешнего набора данных
//
//	Параметры
//		ИмяМакета 						- Строка - имя макета схемы компоновки данных
//		ДанныеРасшифровкиОтчета			- ДанныеРасшифровкиКомпоновкиДанных - содержит переменную, 
//										в которую будут помещены данные расшифровки
//		Результат 						- ПолеТабличногоДокумента - поле табличного документа, для вывода отчета
//		ВнешнийНаборДанныхРасшифровки 	- ТаблицаЗначений - внешний набор данных, содержащий выгрузку результат запроса
//
Процедура СформироватьРасшифровку(ИмяМакета, ДанныеРасшифровкиОтчета, Результат, ВнешнийНаборДанныхРасшифровки, ВыводитьОшибки = Ложь) Экспорт
	
	//	Установка СКД
	ЭтотОбъект.СхемаКомпоновкиДанных = ПолучитьМакет(ИмяМакета);
	//	Заголовок и период
	ВывестиЗаголовокИПараметрыОрганизации(ИмяМакета, Результат);
	//	Настройка
	ВывестиПараметрыНастройкиНаКарту(Результат);

	//	Установка настроек
	Если КоллекцияНастроек.Свойство(ИмяМакета) Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(КоллекцияНастроек[ИмяМакета]);
	Иначе
		Настройки = ЭтотОбъект.СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		ЭтотОбъект.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	КонецЕсли;

	Если ВыводитьОшибки Тогда
		ГруппировкаОшибок = КомпоновщикНастроек.Настройки.Структура.Получить(1);
		ГруппировкаОшибок.Использование = Истина;
	КонецЕсли;	
	
	Настройки = ЭтотОбъект.КомпоновщикНастроек.Настройки;
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//	Формирование отчета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровкиТабличногоДокумента);
	ТиповыеОтчеты.ДополнитьМакетыМакетаКомпоновкиРасшифровкойРесурсов(МакетКомпоновки, КомпоновщикНастроек);
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанныхРасшифровки, ДанныеРасшифровкиТабличногоДокумента);
				
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	ПроцессорВывода.НачатьВывод();
	
	Пока Истина Цикл
		
		ОбработкаПрерыванияПользователя();
		ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
		Если ЭлементРезультата = Неопределено Тогда
			Прервать;
		Иначе
			ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		КонецЕсли;	
		
	КонецЦикла;	

	ПроцессорВывода.ЗакончитьВывод();
						
КонецПроцедуры // СформироватьРасшифровку()

//	Формирует на макете графическую карту необходимого вида, получает необходимые наборы,
//	на основе которых формируются расшифровки блоков схемы
//
//	Параметры
//		Результат - ПолеТабличногоДокумента - поле табличного документа
//					для вывода карты
//		ВидКарты  - Строка - идентификатор вида карты
//
Процедура СформироватьКарту(Результат, ВидКарты) Экспорт
	
	Запрос = ПолучитьПараметрыЗапроса();
			
	Макет = ПолучитьМакет(ВидКарты);
	ОбластьВывода = Макет.ПолучитьОбласть("Область");
	
	ВыводитьПояснениеОшибок = Ложь;
	
	Если ВидКарты = "УпрощенныйУчетНДС" Тогда
		
		//	Получение необходимых наборов
		
		//	1 - НДС НАЧИСЛЕННЫЙ
		
		//	1.1 - Начисления по реализации
		НачислениеРеализация = ПолучитьНаборДанныхНачислениеРеализацияУпрощенныйУчетНДС(Запрос);
		                                          		
		Запрос.Текст = "УНИЧТОЖИТЬ ВТСоставКнигиПродаж";
		Запрос.Выполнить();

		//	1.2 - Начисления по авансам полученным
		НачислениеАвансыПолученные = ПолучитьНаборДанныхНачислениеАвансыПолученныеУпрощенныйУчетНДС(Запрос);
		//	1.3 - Восстановление (начисление) по ранее выданным авансам
		НачислениеВосстановлениеСАвансовВыданных = ПолучитьНаборДанныхНачислениеВосстановлениеСАвансовВыданныхУпрощенныйУчетНДС(Запрос);
		//	1.4 - Начисления по прочим операциям
		НачислениеДругиеОперации = ПолучитьНаборДанныхНачислениеДругиеОперацииУпрощенныйУчетНДС(Запрос);
				
		Запрос.Текст = "УНИЧТОЖИТЬ ВТОперацииСОшибками";
		Запрос.Выполнить();
		
		//	2 - НДС ВЫЧЕТЫ
		
		//	2.1 - Вычет по приобретенным ценностям
		ВычетПоПриобретеннымЦенностям = ПолучитьНаборДанныхВычетПоПриобретеннымЦенностямУпрощенныйУчетНДС(Запрос);
		//  2.2 - Вычет с авансов выданных
		ВычетАвансыВыданные = ПолучитьНаборДанныхВычетАвансыВыданныеУпрощенныйУчетНДС(Запрос);
		//	2.3 - Вычет с авансов полученных (восстановление)
		ВычетСАвансовПолученных = ПолучитьНаборДанныхВычетСАвансовПолученныхУпрощенныйУчетНДС(Запрос);
		//	2.4 - Вычеты по прочим операциям
		ВычетДругиеОперации = ПолучитьНаборДанныхВычетДругиеОперацииУпрощенныйУчетНДС(Запрос);
		
		СуммаВсехНачислений = НачислениеРеализация.Включенные + НачислениеВосстановлениеСАвансовВыданных.Включенные 
			+ НачислениеАвансыПолученные.Включенные + НачислениеДругиеОперации.Включенные;
				
		СуммаВсехВычетов 	= ВычетПоПриобретеннымЦенностям.Включенные + ВычетСАвансовПолученных.Включенные
			+ ВычетАвансыВыданные.Включенные + ВычетДругиеОперации.Включенные;
			
		//	Вывод параметров на карту
		
		//	Начисления по реализации
		ОбластьВывода.Параметры.НачислениеРеализацияВключенные 	 = ПодготовитьПоказательКВыводу(НачислениеРеализация.Включенные,
																								НачислениеРеализация.ИмеютсяЗаписи);  
		ОбластьВывода.Параметры.НачислениеРеализацияНеВключенные = ПодготовитьПоказательКВыводу(НачислениеРеализация.НеВключенные, 
																								НачислениеРеализация.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеРеализацияУпрощенныйУчетНДС", 1.8, 3, 79.9, 18);  
		Если НЕ НачислениеРеализация.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.Реализация);		
		КонецЕсли;
		//	Авансы полученные
		ОбластьВывода.Параметры.АвансыПолученныеВключенные 		= ПодготовитьПоказательКВыводу(НачислениеАвансыПолученные.Включенные, 
																							   НачислениеАвансыПолученные.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.АвансыПолученныеНевключенные 	= ПодготовитьПоказательКВыводу(НачислениеАвансыПолученные.НеВключенные, 
																							   НачислениеАвансыПолученные.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеАвансыПолученныеУпрощенныйУчетНДС", 1.8, 22.5, 79.9, 18); 
		Если НЕ НачислениеАвансыПолученные.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.АвансыПолученныеНачисление);		
		КонецЕсли;

		//	Восстановление (начисление) по ранее выданным авансам
		ОбластьВывода.Параметры.НачисленияВосстановлениеПоАвансамВключенные	  = ПодготовитьПоказательКВыводу(НачислениеВосстановлениеСАвансовВыданных.Включенные,
																											 НачислениеВосстановлениеСАвансовВыданных.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.НачисленияВосстановлениеПоАвансамНеВключенные = ПодготовитьПоказательКВыводу(НачислениеВосстановлениеСАвансовВыданных.НеВключенные, 
																											 НачислениеВосстановлениеСАвансовВыданных.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеВосстановлениеСАвансовВыданныхУпрощенныйУчетНДС", 1.8, 41.5, 79.9, 18);
		Если НЕ НачислениеВосстановлениеСАвансовВыданных.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.АвансыВыданныеНачисление);		
		КонецЕсли;
        //	Начисления по другим операциям
		ОбластьВывода.Параметры.НачисленияДругиеОперацииВключенные	 = ПодготовитьПоказательКВыводу(НачислениеДругиеОперации.Включенные, 
																									НачислениеДругиеОперации.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеДругиеОперацииУпрощенныйУчетНДС", 1.8, 61, 79.9, 18); 
		Если НЕ НачислениеДругиеОперации.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.ПрочиеОперацииНачисление);		
		КонецЕсли;
	
		
		//	Вычет НДС по приобретенным ценностям
		ОбластьВывода.Параметры.ВычетПриобретенныеЦенностиВключенные = ПодготовитьПоказательКВыводу(ВычетПоПриобретеннымЦенностям.Включенные, 
																									ВычетПоПриобретеннымЦенностям.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.ВычетПриобретенныеЦенностиНеВключенные = ПодготовитьПоказательКВыводу(ВычетПоПриобретеннымЦенностям.НеВключенные, 
																									  ВычетПоПриобретеннымЦенностям.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаВычетПоПриобретеннымЦенностямУпрощенныйУчетНДС", 189, 3, 79.9, 18); 
		Если НЕ ВычетПоПриобретеннымЦенностям.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.ПриобретенныеЦенности);		
		КонецЕсли;
		//	Вычет с авансов выданных
		ОбластьВывода.Параметры.ВычетСАвансовВыданныхВключенные = ПодготовитьПоказательКВыводу(ВычетАвансыВыданные.Включенные, 
																							   ВычетАвансыВыданные.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.ВычетСАвансовВыданныхНеВключенные = ПодготовитьПоказательКВыводу(ВычетАвансыВыданные.НеВключенные, 
																								 ВычетАвансыВыданные.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаВычетАвансыВыданныеУпрощенныйУчетНДС", 189, 22.5, 79.9, 18);
		Если НЕ ВычетАвансыВыданные.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.АвансыВыданныеВычет);		
		КонецЕсли;

		//	Вычет с авансов полученных (восстановление)
		ОбластьВывода.Параметры.ВычетСАвансовПолученныхВключенные = ПодготовитьПоказательКВыводу(ВычетСАвансовПолученных.Включенные, 
																								 ВычетСАвансовПолученных.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.ВычетСАвансовПолученныхНеВключенные = ПодготовитьПоказательКВыводу(ВычетСАвансовПолученных.НеВключенные, 
																								   ВычетСАвансовПолученных.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаВычетСАвансовПолученныхУпрощенныйУчетНДС", 189, 41.5, 79.9, 18);
        Если НЕ ВычетСАвансовПолученных.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.АвансыПолученныеВычет);		
		КонецЕсли;
		//	Вычет по другим операциям
		ОбластьВывода.Параметры.ВычетДругиеОперацииВключенные = ПодготовитьПоказательКВыводу(ВычетДругиеОперации.Включенные, 
																							 ВычетДругиеОперации.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаВычетДругиеОперацииУпрощенныйУчетНДС", 189, 61, 79.9, 18);
		Если НЕ ВычетДругиеОперации.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.ПрочиеОперацииВычет);		
		КонецЕсли;
		
		ВыводитьПояснениеОшибок = ВычетДругиеОперации.Свойство("НаличиеОшибок")
									ИЛИ ВычетАвансыВыданные.Свойство("НаличиеОшибок")
									ИЛИ ВычетСАвансовПолученных.Свойство("НаличиеОшибок")
									ИЛИ ВычетПоПриобретеннымЦенностям.Свойство("НаличиеОшибок")
									ИЛИ НачислениеДругиеОперации.Свойство("НаличиеОшибок")
									ИЛИ НачислениеВосстановлениеСАвансовВыданных.Свойство("НаличиеОшибок")
									ИЛИ НачислениеАвансыПолученные.Свойство("НаличиеОшибок")
									ИЛИ НачислениеРеализация.Свойство("НаличиеОшибок")
									ИЛИ Ложь;
									
		ВывестиРамку(ОбластьВывода, , 85, 3, 100, 80);									
		ВывестиРамку(ОбластьВывода, , 3, 110, 58, 25);
			
	ИначеЕсли ВидКарты = "УчетСРегламентнымиДокументами" Тогда
		
		//	Получение необходимых наборов
		
		//	1 - НДС НАЧИСЛЕННЫЙ
		
		//	1.1 - Начисления по реализации
		НачислениеРеализация = ПолучитьНаборДанныхНачислениеРеализация(Запрос);
		//	1.2 - Авансы полученные
		НачислениеАвансыПолученные = ПолучитьНаборДанныхНачислениеАвансыПолученные(Запрос);
		//	1.3 - Начисления при исполнении обязанностей налогового агента
		НачислениеИсполнениеОНА = ПолучитьНаборДанныхНачислениеНалоговыйАгент(Запрос);	
		//	1.4 - Восстановление (начисление) по ранее выданным авансам
		НачислениеВосстановлениеСАвансовВыданных = ПолучитьНаборДанныхНачислениеВосстановлениеСАвансовВыданных(Запрос);
		//	1.5 - Начисления при выполнении СМР хоз. способом
		НачислениеСМРХозСпособом = ПолучитьНаборДанныхНачислениеСМРХозСпособом(Запрос);
		
		//	2 - НДС ВЫЧЕТЫ
		
		Запрос.Текст = "УНИЧТОЖИТЬ ВТОперацииСОшибками";
		Запрос.Выполнить();
		
		//	2.1 - Вычет по приобретенным ценностям
		ВычетПоПриобретеннымЦенностям = ПолучитьНаборДанныхВычетПоПриобретеннымЦенностям(Запрос);		
		//	2.2 - Вычет при исполнении обязанностей налогового агента
		ВычетИсполнениеОНА = ПолучитьНаборДанныхВычетНалоговыйАгент(Запрос);
		//	2.3 - Вычет с авансов полученных (восстановление)
		ВычетСАвансовПолученных = ПолучитьНаборДанныхВычетСАвансовПолученных(Запрос);
		// 2.4 - Вычет с авансов выданных
		ВычетСАвансовВыданных = ПолучитьНаборДанныхВычетСАвансовВыданных(Запрос);
		
		//	Итоги
				
		СуммаВсехНачислений = НачислениеРеализация.Включенные + НачислениеАвансыПолученные.Включенные + НачислениеИсполнениеОНА.Включенные
			+ НачислениеВосстановлениеСАвансовВыданных.Включенные + НачислениеСМРХозСпособом.Включенные;
				
		СуммаВсехВычетов 	= ВычетПоПриобретеннымЦенностям.Включенные + ВычетИсполнениеОНА.Включенные + ВычетСАвансовПолученных.Включенные
			+ ВычетСАвансовВыданных.Включенные;
			
			
		//	Вывод параметров на карту
				
		//	Начисления по реализации
		ОбластьВывода.Параметры.НачислениеРеализацияВключенные 		= ПодготовитьПоказательКВыводу(НачислениеРеализация.Включенные, 
																								   НачислениеРеализация.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.НачислениеРеализацияНеВключенные 	= ПодготовитьПоказательКВыводу(НачислениеРеализация.НеВключенные, 
																								   НачислениеРеализация.ИмеютсяЗаписи);
		//	Выводим рамку
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеРеализация", 2.5, 3, 79.9, 17.3);
		
		Если НЕ НачислениеРеализация.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.Реализация);		
		КонецЕсли;	
		
		//	Авансы полученные
		ОбластьВывода.Параметры.АвансыПолученныеВключенные 		= ПодготовитьПоказательКВыводу(НачислениеАвансыПолученные.Включенные, 
																							   НачислениеАвансыПолученные.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.АвансыПолученныеНеВключенные    = ПодготовитьПоказательКВыводу(НачислениеАвансыПолученные.НеВключенные, 
																							   НачислениеАвансыПолученные.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеАвансыПолученные", 2.5, 22.7, 79.9, 17.3);
		
		Если НЕ НачислениеАвансыПолученные.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.АвансыПолученныеНачисление);		
		КонецЕсли;
		
		//	Восстановление (начисление) по ранее выданным авансам
		ОбластьВывода.Параметры.НачисленияВосстановлениеПоАвансамВключенные 	= ПодготовитьПоказательКВыводу(НачислениеВосстановлениеСАвансовВыданных.Включенные, 
																											   НачислениеВосстановлениеСАвансовВыданных.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.НачисленияВосстановлениеПоАвансамНеВключенные 	= ПодготовитьПоказательКВыводу(НачислениеВосстановлениеСАвансовВыданных.НеВключенные, 
																											   НачислениеВосстановлениеСАвансовВыданных.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеВосстановлениеСВыданныхАвансов", 2.5, 42.4, 79.9, 17.3);
		
		Если НЕ НачислениеВосстановлениеСАвансовВыданных.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.АвансыВыданныеНачисление);		
		КонецЕсли;
		
		//	Начисления при исполнении обязанностей налогового агента
		ОбластьВывода.Параметры.НачисленияИсполнениеОНАВключенные = ПодготовитьПоказательКВыводу(НачислениеИсполнениеОНА.Включенные, 
																								 НачислениеИсполнениеОНА.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.НачисленияИсполнениеОНАНеВключенные = ПодготовитьПоказательКВыводу(НачислениеИсполнениеОНА.НеВключенные, 
																								   НачислениеИсполнениеОНА.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеИсполнениеОНА", 2.5, 61.7, 79.9, 17.3);
		
		Если НЕ НачислениеИсполнениеОНА.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.НалоговыйАгентНачисление);		
		КонецЕсли;
		
		//	Начисление НДС при строительно-монтажных работах хоз. способом
		ОбластьВывода.Параметры.НачислениеСМРХозСпособомВключенные = ПодготовитьПоказательКВыводу(НачислениеСМРХозСпособом.Включенные, 
																								  НачислениеСМРХозСпособом.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.НачислениеСМРХозСпособомНеВключенные = ПодготовитьПоказательКВыводу(НачислениеСМРХозСпособом.НеВключенные, 
																									НачислениеСМРХозСпособом.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеСМРХозСпособом", 2.5, 81.7, 79.9, 17.3);

		Если НЕ НачислениеСМРХозСпособом.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.ВыполнениеСМР);		
		КонецЕсли;
        		
		//	Вычет НДС по приобретенным ценностям
		ОбластьВывода.Параметры.ВычетПриобретенныеЦенностиВключенные = ПодготовитьПоказательКВыводу(ВычетПоПриобретеннымЦенностям.Включенные, 
																									ВычетПоПриобретеннымЦенностям.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.ВычетПриобретенныеЦенностиНеВключенные = ПодготовитьПоказательКВыводу(ВычетПоПриобретеннымЦенностям.НеВключенные, 
																									  ВычетПоПриобретеннымЦенностям.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаВычетПриобретенныеЦенности", 189, 3, 79.9, 17.3);
		
		Если НЕ ВычетПоПриобретеннымЦенностям.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.ПриобретенныеЦенности);		
		КонецЕсли;
		
		//	Вычет с авансов выданных
		ОбластьВывода.Параметры.ВычетСАвансовВыданныхВключенные = ПодготовитьПоказательКВыводу(ВычетСАвансовВыданных.Включенные, 
																							   ВычетСАвансовВыданных.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.ВычетСАвансовВыданныхНеВключенные = ПодготовитьПоказательКВыводу(ВычетСАвансовВыданных.НеВключенные, 
																								 ВычетСАвансовВыданных.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаВычетСАвансовВыданных", 189, 22.7, 79.9, 17.3);
		
		Если НЕ ВычетСАвансовВыданных.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.АвансыВыданныеВычет);		
		КонецЕсли;
		
		//	Вычет с авансов полученных (восстановление)
		ОбластьВывода.Параметры.ВычетСАвансовПолученныхВключенные = ПодготовитьПоказательКВыводу(ВычетСАвансовПолученных.Включенные, 
																								 ВычетСАвансовПолученных.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.ВычетСАвансовПолученныхНеВключенные = ПодготовитьПоказательКВыводу(ВычетСАвансовПолученных.НеВключенные, 
																								   ВычетСАвансовПолученных.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаВычетСАвансовПолученных", 189, 42.4, 79.9, 17.3);
		
		Если НЕ ВычетСАвансовПолученных.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.АвансыПолученныеВычет);		
		КонецЕсли;
             		
		//	Вычет при исполнении обязанностей налогового агента
		ОбластьВывода.Параметры.ВычетИсполнениеОНАВключенные = ПодготовитьПоказательКВыводу(ВычетИсполнениеОНА.Включенные, 
																							ВычетИсполнениеОНА.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.ВычетИсполнениеОНАНеВключенные = ПодготовитьПоказательКВыводу(ВычетИсполнениеОНА.НеВключенные, 
																							  ВычетИсполнениеОНА.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаВычетИсполнениеОНА", 189, 61.7, 79.9, 17.3);
		
		Если НЕ ВычетИсполнениеОНА.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.НалоговыйАгентВычет);		
		КонецЕсли;
        		
		ВыводитьПояснениеОшибок = ВычетИсполнениеОНА.Свойство("НаличиеОшибок") 
									ИЛИ ВычетСАвансовПолученных.Свойство("НаличиеОшибок")
									ИЛИ	ВычетСАвансовВыданных.Свойство("НаличиеОшибок")
									ИЛИ ВычетПоПриобретеннымЦенностям.Свойство("НаличиеОшибок")
									ИЛИ НачислениеСМРХозСпособом.Свойство("НаличиеОшибок")
									ИЛИ НачислениеИсполнениеОНА.Свойство("НаличиеОшибок")
									ИЛИ НачислениеВосстановлениеСАвансовВыданных.Свойство("НаличиеОшибок")
									ИЛИ НачислениеАвансыПолученные.Свойство("НаличиеОшибок")
									ИЛИ НачислениеРеализация.Свойство("НаличиеОшибок")
									ИЛИ Ложь;
									
		ВывестиРамку(ОбластьВывода, , 85.3, 3, 100, 80.3);
		ВывестиРамку(ОбластьВывода, , 3, 112, 58, 25);


						
	ИначеЕсли ВидКарты = "СложныйУчетНДС" Тогда
		
		//	Получение необходимых наборов
		
		//	1 - НДС НАЧИСЛЕННЫЙ
		
		//	1.1 - Начисления по реализации
		НачислениеРеализация = ПолучитьНаборДанныхНачислениеРеализацияСложныйУчетНДС(Запрос);  
		//	1.2 - Авансы полученные
		НачислениеАвансыПолученные = ПолучитьНаборДанныхНачислениеАвансыПолученные(Запрос);
		//	1.3 - Начисления при исполнении обязанностей налогового агента
		НачислениеИсполнениеОНА = ПолучитьНаборДанныхНачислениеНалоговыйАгент(Запрос);	
		//	1.4 - Восстановление (начисление) по ранее выданным авансам
		НачислениеВосстановлениеСАвансовВыданных = ПолучитьНаборДанныхНачислениеВосстановлениеСАвансовВыданных(Запрос);
		//	1.5 - Начисления при выполнении СМР хоз. способом
		НачислениеСМРХозСпособом = ПолучитьНаборДанныхНачислениеСМРХозСпособом(Запрос);
		//	1.6 - Начисления по реализации по ставке 0%
		НачислениеРеализация0 = ПолучитьНаборДанныхНачислениеРеализация0(Запрос);
		//	1.7 - Восстановление по другим операциям
		НачислениеВосстановлениеДругиеОперации = ПолучитьНаборДанныхНачислениеВосстановлениеДругиеОперации(Запрос);
		//	1.8 - Операции, не отражающиеся в книге продаж
		НачислениеНеОтражаетсяВКнигеПродаж = ПолучитьНаборДанныхНачислениеНеОтражаетсяВКнигеПродаж(Запрос);
		
		//	2 - НДС ВЫЧЕТЫ
		
		Запрос.Текст = "УНИЧТОЖИТЬ ВТОперацииСОшибками";
		Запрос.Выполнить();
		
		//	2.1 - Вычет по приобретенным ценностям
		ВычетПоПриобретеннымЦенностям = ПолучитьНаборДанныхВычетПоПриобретеннымЦенностям(Запрос);		
		//	2.2 - Вычет при исполнении обязанностей налогового агента
		ВычетИсполнениеОНА = ПолучитьНаборДанныхВычетНалоговыйАгент(Запрос);
		//	2.3 - Вычет с авансов полученных (восстановление)
		ВычетСАвансовПолученных = ПолучитьНаборДанныхВычетСАвансовПолученных(Запрос);
		//	2.4 - Вычет с авансов выданных
		ВычетСАвансовВыданных = ПолучитьНаборДанныхВычетСАвансовВыданных(Запрос);
		//	2.5 - Вычет по приобретенным ценностям по ставке 0%
		ВычетПоПриобретеннымЦенностям0 = ПолучитьНаборДанныхВычетПоПриобретеннымЦенностям0(Запрос);
		//	2.6 - Вычет при исполнении обязанностей налогого агента по ставке 0%
		ВычетИсполнениеОНА0 = ПолучитьНаборДанныхВычетНалоговыйАгент0(Запрос);
		//	Итоги
						
		СуммаВсехНачислений = НачислениеРеализация.Включенные + НачислениеАвансыПолученные.Включенные + НачислениеИсполнениеОНА.Включенные
			+ НачислениеВосстановлениеСАвансовВыданных.Включенные + НачислениеСМРХозСпособом.Включенные + НачислениеРеализация0.Включенные
			+ НачислениеВосстановлениеДругиеОперации.Включенные;
				
		СуммаВсехВычетов 	= ВычетПоПриобретеннымЦенностям.Включенные + ВычетИсполнениеОНА.Включенные + ВычетСАвансовПолученных.Включенные
			+ ВычетСАвансовВыданных.Включенные + ВычетПоПриобретеннымЦенностям0.Включенные + ВычетИсполнениеОНА0.Включенные;
			
		//	Вывод параметров на карту
		
		//	Начисления по реализации
		ОбластьВывода.Параметры.НачислениеРеализацияВключенные 		= ПодготовитьПоказательКВыводу(НачислениеРеализация.Включенные, 
																								   НачислениеРеализация.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.НачислениеРеализацияНеВключенные 	= ПодготовитьПоказательКВыводу(НачислениеРеализация.НеВключенные, 
																								   НачислениеРеализация.ИмеютсяЗаписи);
		//	Выводим рамку
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеРеализация", 1.8, 2.7, 79.9, 17.5);
		Если НЕ НачислениеРеализация.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.Реализация);		
		КонецЕсли;
		
		//	Авансы полученные
		ОбластьВывода.Параметры.АвансыПолученныеВключенные 		= ПодготовитьПоказательКВыводу(НачислениеАвансыПолученные.Включенные, 
																							   НачислениеАвансыПолученные.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.АвансыПолученныеНеВключенные    = ПодготовитьПоказательКВыводу(НачислениеАвансыПолученные.НеВключенные, 
																							   НачислениеАвансыПолученные.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеАвансыПолученные", 1.8, 22.5, 79.9, 17.5);
		Если НЕ НачислениеАвансыПолученные.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.АвансыПолученныеНачисление);		
		КонецЕсли;
		
		//	Восстановление (начисление) по ранее выданным авансам
		ОбластьВывода.Параметры.НачисленияВосстановлениеПоАвансамВключенные 	= ПодготовитьПоказательКВыводу(НачислениеВосстановлениеСАвансовВыданных.Включенные, 
																											   НачислениеВосстановлениеСАвансовВыданных.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.НачисленияВосстановлениеПоАвансамНеВключенные 	= ПодготовитьПоказательКВыводу(НачислениеВосстановлениеСАвансовВыданных.НеВключенные, 
																											   НачислениеВосстановлениеСАвансовВыданных.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеВосстановлениеСВыданныхАвансов", 1.8, 42.3, 79.9, 17.5);
		Если НЕ НачислениеВосстановлениеСАвансовВыданных.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.АвансыВыданныеНачисление);		
		КонецЕсли;

		//	Начисления при исполнении обязанностей налогового агента
		ОбластьВывода.Параметры.НачисленияИсполнениеОНАВключенные = ПодготовитьПоказательКВыводу(НачислениеИсполнениеОНА.Включенные, 
																								 НачислениеИсполнениеОНА.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.НачисленияИсполнениеОНАНеВключенные = ПодготовитьПоказательКВыводу(НачислениеИсполнениеОНА.НеВключенные, 
																								   НачислениеИсполнениеОНА.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеИсполнениеОНА", 1.8, 61.9, 79.9, 17.5);
		Если НЕ НачислениеИсполнениеОНА.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.НалоговыйАгентНачисление);		
		КонецЕсли;		
		//	Начисление НДС при строительно-монтажных работах хоз. способом
		ОбластьВывода.Параметры.НачислениеСМРХозСпособомВключенные = ПодготовитьПоказательКВыводу(НачислениеСМРХозСпособом.Включенные, 
																								  НачислениеСМРХозСпособом.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.НачислениеСМРХозСпособомНеВключенные = ПодготовитьПоказательКВыводу(НачислениеСМРХозСпособом.НеВключенные, 
																									НачислениеСМРХозСпособом.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеСМРХозСпособом", 1.8, 81.4, 79.9, 17.5);
		Если НЕ НачислениеСМРХозСпособом.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.ВыполнениеСМР);		
		КонецЕсли;			
		//	Начисления по реализации под 0%
		ОбластьВывода.Параметры.НачислениеРеализация0Включенные 		= ПодготовитьПоказательКВыводу(НачислениеРеализация0.Включенные, 
																									   НачислениеРеализация0.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.НачислениеРеализация0НеВключенные 		= ПодготовитьПоказательКВыводу(НачислениеРеализация0.НеВключенные, 
																									   НачислениеРеализация0.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеРеализация0", 1.8, 101.4, 79.9, 17.5);
		Если НЕ НачислениеРеализация0.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.Реализация0);		
		КонецЕсли;
		
		//	Начисление по восстановлению НДС по прочим операциям 		
		ОбластьВывода.Параметры.НачислениеВосстановлениеДругиеОперацииВключенные = ПодготовитьПоказательКВыводу(НачислениеВосстановлениеДругиеОперации.Включенные, 
																												НачислениеВосстановлениеДругиеОперации.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.НачислениеВосстановлениеДругиеОперацииНеВключенные = ПодготовитьПоказательКВыводу(НачислениеВосстановлениеДругиеОперации.НеВключенные, 
																											      НачислениеВосстановлениеДругиеОперации.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеВосстановлениеДругиеОперации", 1.8, 121, 79.9, 17.5);
		Если НЕ НачислениеВосстановлениеДругиеОперации.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.ПрочиеОперацииНачисление);		
		КонецЕсли;
		
		//	Операции, не отражающиеся в книге продаж 		
		ОбластьВывода.Параметры.НачислениеНеОтражаютсяВКнигеПродаж 	= ПодготовитьПоказательКВыводу(НачислениеНеОтражаетсяВКнигеПродаж.Включенные, 
																													   НачислениеНеОтражаетсяВКнигеПродаж.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаНачислениеНеОтражаетсяВКнигеПродаж", 100, 121, 71.7, 17.5);
			
		
		//	Вычет НДС по приобретенным ценностям
		ОбластьВывода.Параметры.ВычетПриобретенныеЦенностиВключенные = ПодготовитьПоказательКВыводу(ВычетПоПриобретеннымЦенностям.Включенные, 
																									ВычетПоПриобретеннымЦенностям.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.ВычетПриобретенныеЦенностиНеВключенные = ПодготовитьПоказательКВыводу(ВычетПоПриобретеннымЦенностям.НеВключенные, 
																									  ВычетПоПриобретеннымЦенностям.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаВычетПриобретенныеЦенности", 189, 2.7, 79.9, 17.5); 	
		Если НЕ ВычетПоПриобретеннымЦенностям.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.ПриобретенныеЦенности);		
		КонецЕсли;
		//	Вычет с авансов выданных
		ОбластьВывода.Параметры.ВычетСАвансовВыданныхВключенные = ПодготовитьПоказательКВыводу(ВычетСАвансовВыданных.Включенные, 
																							   ВычетСАвансовВыданных.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.ВычетСАвансовВыданныхНеВключенные = ПодготовитьПоказательКВыводу(ВычетСАвансовВыданных.НеВключенные, 
																								 ВычетСАвансовВыданных.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаВычетСАвансовВыданных", 189, 22.5, 79.9, 17.5); 	
        Если НЕ ВычетСАвансовВыданных.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.АвансыВыданныеВычет);		
		КонецЕсли;		
		//	Вычет с авансов полученных (восстановление)
		ОбластьВывода.Параметры.ВычетСАвансовПолученныхВключенные = ПодготовитьПоказательКВыводу(ВычетСАвансовПолученных.Включенные, 
																								 ВычетСАвансовПолученных.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.ВычетСАвансовПолученныхНеВключенные = ПодготовитьПоказательКВыводу(ВычетСАвансовПолученных.НеВключенные, 
																								   ВычетСАвансовПолученных.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаВычетСАвансовПолученных", 189, 42.3, 79.9, 17.5);
		Если НЕ ВычетСАвансовПолученных.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.АвансыПолученныеВычет);		
		КонецЕсли;						
		//	Вычет при исполнении обязанностей налогового агента
		ОбластьВывода.Параметры.ВычетИсполнениеОНАВключенные = ПодготовитьПоказательКВыводу(ВычетИсполнениеОНА.Включенные, 
																							ВычетИсполнениеОНА.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.ВычетИсполнениеОНАНеВключенные = ПодготовитьПоказательКВыводу(ВычетИсполнениеОНА.НеВключенные, 
																							  ВычетИсполнениеОНА.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаВычетИсполнениеОНА", 189, 61.9, 79.9, 17.5);
		Если НЕ ВычетИсполнениеОНА.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.НалоговыйАгентВычет);		
		КонецЕсли;	
		//	Вычет по приобретенным ценностям, реализованным по ставке 0%
		ОбластьВывода.Параметры.ВычетПриобретенныеЦенности0Включенные 	= ПодготовитьПоказательКВыводу(ВычетПоПриобретеннымЦенностям0.Включенные, 
																									   ВычетПоПриобретеннымЦенностям0.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.ВычетПриобретенныеЦенности0НеВключенные = ПодготовитьПоказательКВыводу(ВычетПоПриобретеннымЦенностям0.НеВключенные, 
																									   ВычетПоПриобретеннымЦенностям0.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаВычетПоПриобретеннымЦенностям0", 189, 81.4, 79.9, 17.5);
		Если НЕ ВычетПоПриобретеннымЦенностям0.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.ПриобретенныеЦенности0);		
		КонецЕсли;
		//	Вычет при исполнении ОНА под 0%
		ОбластьВывода.Параметры.ВычетИсполнениеОНА0Включенные 	= ПодготовитьПоказательКВыводу(ВычетИсполнениеОНА0.Включенные, 
																							   ВычетИсполнениеОНА0.ИмеютсяЗаписи);
		ОбластьВывода.Параметры.ВычетИсполнениеОНА0НеВключенные = ПодготовитьПоказательКВыводу(ВычетИсполнениеОНА0.НеВключенные, 
																							   ВычетИсполнениеОНА0.ИмеютсяЗаписи);
		ВывестиРамку(ОбластьВывода, "РасшифровкаВычетИсполнениеОНА0", 189, 101.4, 79.9, 17.5);
		Если НЕ ВычетИсполнениеОНА0.Свойство("НаличиеОшибок") Тогда
			ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.НалоговыйАгентВычет0);		
		КонецЕсли;
		
		ВыводитьПояснениеОшибок = ВычетИсполнениеОНА.Свойство("НаличиеОшибок") 
									ИЛИ ВычетСАвансовПолученных.Свойство("НаличиеОшибок")
									ИЛИ	ВычетСАвансовВыданных.Свойство("НаличиеОшибок")
									ИЛИ ВычетПоПриобретеннымЦенностям.Свойство("НаличиеОшибок")
									ИЛИ НачислениеСМРХозСпособом.Свойство("НаличиеОшибок")
									ИЛИ НачислениеИсполнениеОНА.Свойство("НаличиеОшибок")
									ИЛИ НачислениеВосстановлениеСАвансовВыданных.Свойство("НаличиеОшибок")
									ИЛИ НачислениеАвансыПолученные.Свойство("НаличиеОшибок")
									ИЛИ НачислениеРеализация.Свойство("НаличиеОшибок")
									ИЛИ ВычетПоПриобретеннымЦенностям0.Свойство("НаличиеОшибок")
									ИЛИ ВычетИсполнениеОНА0.Свойство("НаличиеОшибок")
									ИЛИ НачислениеРеализация0.Свойство("НаличиеОшибок")
									ИЛИ НачислениеВосстановлениеДругиеОперации.Свойство("НаличиеОшибок")
									ИЛИ Ложь;
									
		ВывестиРамку(ОбластьВывода, , 85.5, 3, 100, 110);
        				
	КонецЕсли;
	
	Если СуммаВсехВычетов > СуммаВсехНачислений Тогда
		ОбластьВывода.Параметры.НалоговаяБаза = "НДС к возмещению";
		ОбластьВывода.Параметры.База          = Формат(СуммаВсехВычетов - СуммаВсехНачислений,"ЧЦ=15; ЧДЦ=2");
	Иначе
		ОбластьВывода.Параметры.НалоговаяБаза = "НДС к уплате";
		ОбластьВывода.Параметры.База          = Формат(СуммаВсехНачислений - СуммаВсехВычетов,"ЧЦ=15; ЧДЦ=2");
	КонецЕсли;
		
	ОбластьВывода.Параметры.Вычеты     	= Формат(СуммаВсехВычетов, "ЧЦ=15; ЧДЦ=2");
	ОбластьВывода.Параметры.Начисления 	= Формат(СуммаВсехНачислений, "ЧЦ=15; ЧДЦ=2");
	
	Если НЕ ВыводитьПояснениеОшибок Тогда
		ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.ПояснениеОшибки);
		ОбластьВывода.Рисунки.Удалить(ОбластьВывода.Рисунки.ПояснениеОшибки2);
	КонецЕсли;
			
	//	Устанавливаем параметры отборов для расшифровок
	ЗначениеВключатьОбособленныеПодразделения 	= ВключатьОбособленныеПодразделения;
	ЗначениеОрганизация 						= Организация.НаименованиеПолное;
	ЗначениеПериод 								= ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "ФП = Истина" );
			
	//	Вывод настройки
	ВывестиПараметрыНастройкиНаКарту(Результат);
	Результат.ФиксацияСверху = 0;
	
	Результат.Вывести(ОбластьВывода);
	Результат.ТолькоПросмотр = Истина;

		
КонецПроцедуры	

// Выводит в поле заданного табличного документа параметры настройки отчета
//
// Параметры
// 		Результат - ПолеТабличногоДокумента - поле табличного документа для вывода
//
Процедура ВывестиПараметрыНастройкиНаКарту(Результат) 
	
	Если ЗначениеВключатьОбособленныеПодразделения Тогда
		ТекстВключатьОбособленныеПодразделения = " Включать обособленные подразделения;"
	Иначе
		ТекстВключатьОбособленныеПодразделения = "";		
	КонецЕсли;	
		
	ТекстНастройки = ТекстВключатьОбособленныеПодразделения;
	
	Если СтрДлина(ТекстНастройки) > 0 Тогда
		ТекстНастройки = "Настройка:"+ТекстНастройки;
		Макет = ПолучитьМакет("МакетВыводаНастроекСхемы");
		ОбластьВывода = Макет.ПолучитьОбласть("Настройка");
		ОбластьВывода.Параметры.ТекстНастройки = ТекстНастройки;
		Результат.Вывести(ОбластьВывода);
		Результат.ФиксацияСверху = 6;
	Иначе
		Результат.ФиксацияСверху = 5;
    КонецЕсли;	
	
КонецПроцедуры

// Выводит в поле заданного табличного документа заголовок, название организации и период
//
// Параметры
// 		Результат 		- ПолеТабличногоДокумента - поле табличного документа для вывода
//		ИмяРасшифровки 	- Строка - идентификатор расшифровки отчета
//
Процедура ВывестиЗаголовокИПараметрыОрганизации(ИмяРасшифровки, Результат) 
	
	Если ИмяРасшифровки = "РасшифровкаНачислениеРеализация" Тогда
		ТекстЗаголовок = "Начисления по реализации";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаНачислениеАвансыПолученные" Тогда
		ТекстЗаголовок = "Начисления по авансам полученным";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаНачислениеИсполнениеОНА"  Тогда
		ТекстЗаголовок = "Начисления при исполнении обязанностей налогового агента";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаНачислениеВосстановлениеСВыданныхАвансов" Тогда
		ТекстЗаголовок = "Восстановление с авансов выданных";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаНачислениеСМРХозСпособом"  Тогда
		ТекстЗаголовок = "Начисления при выполнении строительно-монтажных работ хоз. способом";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаВычетПриобретенныеЦенности" Тогда
		ТекстЗаголовок = "Вычет по приобретенным ценностям	";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаВычетИсполнениеОНА" Тогда
		ТекстЗаголовок = "Вычет при исполнении обязанностей налогового агента";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаВычетСАвансовПолученных"  Тогда
		ТекстЗаголовок = "Вычет с авансов полученных";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаВычетСАвансовВыданных" Тогда
		ТекстЗаголовок = "Вычет с авансов выданных";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаНачислениеРеализацияУпрощенныйУчетНДС" Тогда
		ТекстЗаголовок = "Начисления по реализации";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаНачислениеАвансыПолученныеУпрощенныйУчетНДС" Тогда
		ТекстЗаголовок = "Начисления по авансам полученным";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаНачислениеВосстановлениеСАвансовВыданныхУпрощенныйУчетНДС" Тогда
		ТекстЗаголовок = "Восстановление с авансов выданных";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаНачислениеДругиеОперацииУпрощенныйУчетНДС" Тогда
		ТекстЗаголовок = "Начисления по прочим операциям";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаВычетПоПриобретеннымЦенностямУпрощенныйУчетНДС" Тогда
		ТекстЗаголовок = "Вычет по приобретенным ценностям";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаВычетАвансыВыданныеУпрощенныйУчетНДС" Тогда
		ТекстЗаголовок = "Вычет с авансов выданных";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаВычетСАвансовПолученныхУпрощенныйУчетНДС" Тогда
		ТекстЗаголовок = "Вычет с авансов полученных";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаВычетДругиеОперацииУпрощенныйУчетНДС" Тогда
		ТекстЗаголовок = "Вычет по прочим операциям";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаВычетПоПриобретеннымЦенностям0" Тогда
		ТекстЗаголовок = "Вычет по приобретенным ценностям, реализованным по ставке 0%";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаВычетИсполнениеОНА0" Тогда
		ТекстЗаголовок = "Вычет при исполнении обязанностей налогового агента при реализации по ставке 0%";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаНачислениеРеализация0" Тогда
		ТекстЗаголовок = "Начисления по реализации по ставке 0%";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаНачислениеВосстановлениеДругиеОперации" Тогда
		ТекстЗаголовок = "Восстановление НДС по прочим операциям";	
	ИначеЕсли ИмяРасшифровки = "РасшифровкаНачислениеНеОтражаетсяВКнигеПродаж" Тогда
		ТекстЗаголовок = "Начисления, не отражающиеся в книге продаж";	
	Иначе 
		ТекстЗаголовок = "Не задан заголовок";
	КонецЕсли;	
	
	//	Вывод параметров организации
	Макет 														= ПолучитьМакет("МакетВыводаНастроекСхемы");
	ОбластьПараметровОрганизации 								= Макет.ПолучитьОбласть("ПараметрыОрганизации");
	ОбластьПараметровОрганизации.Параметры.ПараметрыОрганизации = ЗначениеОрганизация + ", "+ ЗначениеПериод;
	Результат.Вывести(ОбластьПараметровОрганизации);
    		
	Макет 														= ПолучитьМакет("МакетВыводаНастроекСхемы");
	ОбластьВывода 												= Макет.ПолучитьОбласть("Заголовок");
	ОбластьВывода.Параметры.ТекстЗаголовок 						= ТекстЗаголовок;
	Результат.Вывести(ОбластьВывода);
	
КонецПроцедуры

// Выводит рисунок табличного документа - прямоугольник, служащий областью навигационной ссылки 
//
// Параметры
//  ОбластьВывода  	- ОбластьЯчеекТабличногоДокумента - область табличного документа
//                 в которую выводится рисунок
//  Расшифровка  	- Строка - содержит параметр расшифровки рисунка 
//  Лево  			- Число - Содержит положение левой границы рисунка, 
//					отсчитываемое от левой стороны табличного документа (в миллиметрах)
//  Верх  			- Число - Содержит положение верхней границы рисунка, 
//					отсчитываемое от верхней стороны табличного документа (в миллиметрах).
//  Ширина  		- Число - Содержит ширину рисунка (в миллиметрах). 
//  Высота  		- Число - Содержит высоту рисунка (в миллиметрах). 
//
//
Функция ВывестиРамку(ОбластьВывода, Расшифровка, Лево, Верх, Ширина, Высота) Экспорт

	Рамка = ОбластьВывода.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
		
	Рамка.ГраницаСлева  = Ложь;
	Рамка.ГраницаСправа = Ложь;
	Рамка.ГраницаСверху = Ложь;
	Рамка.ГраницаСнизу 	= Ложь;
	
	Рамка.ЦветФона 		= Новый Цвет;
	
	Рамка.Лево 		= Лево;
	Рамка.Верх  	= Верх;
	Рамка.Ширина 	= Ширина;
	Рамка.Высота  	= Высота;
	   
	Рамка.ПараметрРасшифровки 	= Расшифровка;
	Рамка.Защита 				= Истина;
	Рамка.Расшифровка 			= Расшифровка;
	
КонецФункции // ВывестиРамку()

Функция ПодготовитьПоказательКВыводу(Показатель, ИмеютсяЗаписи)
	
	Если Показатель = 0 И ИмеютсяЗаписи Тогда
		Возврат "0";
	Иначе
		Возврат Строка(Формат(Показатель,"ЧЦ=15; ЧДЦ=2"));
	КонецЕсли;
	
КонецФункции

//	Универсальные наборы

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	начисленному НДС по реализации
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхНачислениеРеализация(Запрос)
	
	//	Документы включенные в книгу продаж (НДС по реализации)
    Запрос.Текст = 
	"ВЫБРАТЬ
	|	КнигаПродаж.СчетФактура КАК СчетФактура,
	|	КнигаПродаж.СтавкаНДС КАК СтавкаНДС,
	|	КнигаПродаж.СуммаБезНДСОборот КАК Сумма,
	|	КнигаПродаж.НДСОборот КАК СуммаНДС
	|ПОМЕСТИТЬ ВТСоставКнигиПродаж
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе, &ВидыЦенностейНалоговыйАгент, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.СМРСобственнымиСилами)))
	|				И (НЕ Событие В (ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПодтвержденаСтавка0), ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.НеПодтвержденаСтавка0)))) КАК КнигаПродаж
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслугТовары.Номенклатура) КАК НоменклатураКоличество
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|	И РеализацияТоваровУслугТовары.Номенклатура <> &ПустаяНоменклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.СтавкаНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) КАК НоменклатураКоличество
	|ПОМЕСТИТЬ СписокТоваров
	|ИЗ
	|	ТаблицаТоваров КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) > 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслугУслуги.Номенклатура) КАК НоменклатураКоличество
	|ПОМЕСТИТЬ ТаблицаУслуг
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|	И РеализацияТоваровУслугУслуги.Номенклатура <> &ПустаяНоменклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугУслуги.Номенклатура,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) КАК НоменклатураКоличество
	|ПОМЕСТИТЬ СписокУслуг
	|ИЗ
	|	ТаблицаУслуг КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) > 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ НеверныеСтавки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокТоваров КАК СписокНоменклатуры)
	|	И РеализацияТоваровУслугТовары.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|	И РеализацияТоваровУслугТовары.Номенклатура <> &ПустаяНоменклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугУслуги.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокУслуг КАК СписокНоменклатуры)
	|	И РеализацияТоваровУслугУслуги.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|	И РеализацияТоваровУслугУслуги.Номенклатура <> &ПустаяНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСНачисленныйОбороты.СчетФактура КАК СчетФактура,
	|	НДСНачисленныйОбороты.СтавкаНДС
	|ПОМЕСТИТЬ ВТНДСНачисленныйОбороты
	|ИЗ
	|	РегистрНакопления.НДСНачисленный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И (НЕ СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах)
	|				И СчетФактура В
	|					(ВЫБРАТЬ
	|						КнигаПродаж.СчетФактура КАК СчетФактура
	|					ИЗ
	|						ВТСоставКнигиПродаж КАК КнигаПродаж)) КАК НДСНачисленныйОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСНачисленныйОбороты.СчетФактура КАК СчетФактура,
	|	НДСНачисленныйОбороты.СтавкаНДС
	|ПОМЕСТИТЬ ВТНДСНачисленныйОборотыЭкспорт
	|ИЗ
	|	РегистрНакопления.НДСНачисленный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			,
	|			СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|				И Организация В (&Организация)
	|				И ВЫБОР
	|					КОГДА (НЕ ВЫРАЗИТЬ(СчетФактура.ДоговорКонтрагента КАК Справочник.ДоговорыКонтрагентов) ЕСТЬ NULL )
	|						ТОГДА ВЫРАЗИТЬ(СчетФактура.ДоговорКонтрагента КАК Справочник.ДоговорыКонтрагентов).РеализацияНаЭкспорт
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|				И СчетФактура В
	|					(ВЫБРАТЬ
	|						КнигаПродаж.СчетФактура КАК СчетФактура
	|					ИЗ
	|						ВТСоставКнигиПродаж КАК КнигаПродаж)) КАК НДСНачисленныйОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НеверныеСтавкиНДС.Ссылка КАК ДокументРегистратор,
	|	НеверныеСтавкиНДС.СтавкаНДС,
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
	|	0 КАК РангОшибки
	|ПОМЕСТИТЬ ВТОперацииСОшибками
	|ИЗ
	|	НеверныеСтавки КАК НеверныеСтавкиНДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО НеверныеСтавкиНДС.Ссылка = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДСНачисленныйОбороты.СчетФактура,
	|	НДСНачисленныйОбороты.СтавкаНДС,
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	3
	|ИЗ
	|	ВТНДСНачисленныйОбороты КАК НДСНачисленныйОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО НДСНачисленныйОбороты.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДСНачисленныйОбороты.СчетФактура,
	|	НДСНачисленныйОбороты.СтавкаНДС,
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	2
	|ИЗ
	|	ВТНДСНачисленныйОборотыЭкспорт КАК НДСНачисленныйОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО НДСНачисленныйОбороты.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДСНачисленный.СчетФактура,
	|	НДСНачисленный.СтавкаНДС,
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	1
	|ИЗ
	|	РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО НДСНачисленный.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	НДСНачисленный.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И НДСНачисленный.СчетДоходовБУ = &ВыручкаЕНВД
	|	И НДСНачисленный.СчетФактура В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|	И НДСНачисленный.Организация В(&Организация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСоставКнигиПродаж.СчетФактура КАК СчетФактура,
	|	ВТСоставКнигиПродаж.СтавкаНДС,
	|	ВТОперацииСОшибками.ДокументРегистратор,
	|	МИНИМУМ(ВТСоставКнигиПродаж.Сумма) КАК Сумма,
	|	МИНИМУМ(ВТСоставКнигиПродаж.СуммаНДС) КАК СуммаНДС,
	|	МИНИМУМ(ВТОперацииСОшибками.РангОшибки) КАК РангОшибки
	|ПОМЕСТИТЬ ВТПроведеноРанжированиеОшибок
	|ИЗ
	|	ВТСоставКнигиПродаж КАК ВТСоставКнигиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОперацииСОшибками КАК ВТОперацииСОшибками
	|		ПО ВТСоставКнигиПродаж.СчетФактура = ВТОперацииСОшибками.ДокументРегистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСоставКнигиПродаж.СчетФактура,
	|	ВТСоставКнигиПродаж.СтавкаНДС,
	|	ВТОперацииСОшибками.ДокументРегистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаРеализацию)
	|			ТОГДА NULL
	|		ИНАЧЕ СчетФактураВыданныйДокументыОснования.Ссылка.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДССчетаФактуры
	|ПОМЕСТИТЬ ВТСчетФактураВыданныйДокументыОснования
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Организация В(&Организация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
	|	ВТПроведеноРанжированиеОшибок.СтавкаНДС,
	|	ВТПроведеноРанжированиеОшибок.СчетФактура КАК ДокументРегистратор,
	|	ВТПроведеноРанжированиеОшибок.Сумма,
	|	ВТПроведеноРанжированиеОшибок.СуммаНДС,
	|	1 КАК КоличествоДокументов,
	|	ВЫБОР
	|		КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки ЕСТЬ NULL 
	|			ТОГДА &ТекстБезОшибок
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки = 0
	|					ТОГДА &ТекстОшибкаРеализацияПоРазнымСтавкам
	|				КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки = 1
	|					ТОГДА &ТекстОшибкаРеализацияЕНВДСНДС
	|				КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки = 2
	|					ТОГДА &ТекстОшибкаРеализацияЭкспортСНДС
	|				КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки = 3
	|					ТОГДА &ТекстОшибкаРеализацияБезСФ
	|			КОНЕЦ
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	ВЫБОР
	|		КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки = 0
	|			ТОГДА &ТекстСноска
	|		ИНАЧЕ &ТекстНетСноски
	|	КОНЕЦ КАК СимволСноски,
	|	&ТекстОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС,
	|	ВЫБОР
	|		КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоОшибок
	|ИЗ
	|	ВТПроведеноРанжированиеОшибок КАК ВТПроведеноРанжированиеОшибок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСчетФактураВыданныйДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ВТПроведеноРанжированиеОшибок.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|			И (ВТПроведеноРанжированиеОшибок.СтавкаНДС = ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.СтавкаНДССчетаФактуры, ВТПроведеноРанжированиеОшибок.СтавкаНДС))";
	
	НачисленияПоРеализацииВключенные = Запрос.Выполнить().Выгрузить();
	
	//	Документы не включенные в книгу продаж (НДС по реализации),	так как НДС в документах не учитывается
	Если ИдентификаторКонфигурации = "УПП" Тогда
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктОбОказанииПроизводственныхУслуг.Ссылка КАК ДокументРегистратор,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
		|	ВЫРАЗИТЬ(АктОбОказанииПроизводственныхУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
		|	ВЫРАЗИТЬ(АктОбОказанииПроизводственныхУслуг.СуммаДокумента - АктОбОказанииПроизводственныхУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	&ПустаяСсылкаНаСчетФактуруВыданный КАК СчетФактура,
		|	1 КАК КоличествоДокументов,
		|	&ТекстНДСНеУчитывается КАК ПризнакНаличияОшибок,
		|	&ТекстНеОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС
		|ИЗ
		|	Документ.АктОбОказанииПроизводственныхУслуг КАК АктОбОказанииПроизводственныхУслуг
		|ГДЕ
		|	(НЕ АктОбОказанииПроизводственныхУслуг.УчитыватьНДС)
		|	И АктОбОказанииПроизводственныхУслуг.Проведен
		|	И АктОбОказанииПроизводственныхУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И АктОбОказанииПроизводственныхУслуг.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровПоставщику.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ВозвратТоваровПоставщику.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ВозвратТоваровПоставщику.СуммаДокумента - ВозвратТоваровПоставщику.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		|ГДЕ
		|	(НЕ ВозвратТоваровПоставщику.УчитыватьНДС)
		|	И ВозвратТоваровПоставщику.Проведен
		|	И ВозвратТоваровПоставщику.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВозвратТоваровПоставщику.Организация В(&Организация)
		|	И ВозвратТоваровПоставщику.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВозвратТоваровПоставщику.ИзПереработки)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтчетКомиссионераОПродажах.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажах.СуммаДокумента - ОтчетКомиссионераОПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
		|ГДЕ
		|	(НЕ ОтчетКомиссионераОПродажах.УчитыватьНДС)
		|	И ОтчетКомиссионераОПродажах.Проведен
		|	И ОтчетКомиссионераОПродажах.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОтчетКомиссионераОПродажах.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтчетОРозничныхПродажах.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажах.СуммаДокумента - ОтчетОРозничныхПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
		|ГДЕ
		|	(НЕ ОтчетОРозничныхПродажах.УчитыватьНДС)
		|	И ОтчетОРозничныхПродажах.Проведен
		|	И ОтчетОРозничныхПродажах.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОтчетОРозничныхПродажах.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаНМА.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ПередачаНМА.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПередачаНМА.СуммаДокумента - ПередачаНМА.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ПередачаНМА КАК ПередачаНМА
		|ГДЕ
		|	(НЕ ПередачаНМА.УчитыватьНДС)
		|	И ПередачаНМА.Проведен
		|	И ПередачаНМА.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПередачаНМА.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаОС.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ПередачаОС.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПередачаОС.СуммаДокумента - ПередачаОС.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ПередачаОС КАК ПередачаОС
		|ГДЕ
		|	(НЕ ПередачаОС.УчитыватьНДС)
		|	И ПередачаОС.Проведен
		|	И ПередачаОС.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПередачаОС.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(РеализацияТоваровУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(РеализацияТоваровУслуг.СуммаДокумента - РеализацияТоваровУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Проведен
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (НЕ РеализацияТоваровУслуг.УчитыватьНДС)
		|	И РеализацияТоваровУслуг.Организация В(&Организация)";
    	
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктОбОказанииПроизводственныхУслуг.Ссылка КАК ДокументРегистратор,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
		|	ВЫРАЗИТЬ(АктОбОказанииПроизводственныхУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
		|	ВЫРАЗИТЬ(АктОбОказанииПроизводственныхУслуг.СуммаДокумента - АктОбОказанииПроизводственныхУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	&ПустаяСсылкаНаСчетФактуруВыданный КАК СчетФактура,
		|	1 КАК КоличествоДокументов,
		|	&ТекстНДСНеУчитывается КАК ПризнакНаличияОшибок,
		|	&ТекстНеОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС
		|ИЗ
		|	Документ.АктОбОказанииПроизводственныхУслуг КАК АктОбОказанииПроизводственныхУслуг
		|ГДЕ
		|	(НЕ АктОбОказанииПроизводственныхУслуг.УчитыватьНДС)
		|	И АктОбОказанииПроизводственныхУслуг.Проведен
		|	И АктОбОказанииПроизводственныхУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И АктОбОказанииПроизводственныхУслуг.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровПоставщику.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ВозвратТоваровПоставщику.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ВозвратТоваровПоставщику.СуммаДокумента - ВозвратТоваровПоставщику.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		|ГДЕ
		|	(НЕ ВозвратТоваровПоставщику.УчитыватьНДС)
		|	И ВозвратТоваровПоставщику.Проведен
		|	И ВозвратТоваровПоставщику.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВозвратТоваровПоставщику.Организация В(&Организация)
		|	И ВозвратТоваровПоставщику.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВозвратТоваровПоставщику.ИзПереработки)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтчетКомиссионераОПродажах.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажах.СуммаДокумента - ОтчетКомиссионераОПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
		|ГДЕ
		|	(НЕ ОтчетКомиссионераОПродажах.УчитыватьНДС)
		|	И ОтчетКомиссионераОПродажах.Проведен
		|	И ОтчетКомиссионераОПродажах.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОтчетКомиссионераОПродажах.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтчетОРозничныхПродажах.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажах.СуммаДокумента - ОтчетОРозничныхПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
		|ГДЕ
		|	(НЕ ОтчетОРозничныхПродажах.УчитыватьНДС)
		|	И ОтчетОРозничныхПродажах.Проведен
		|	И ОтчетОРозничныхПродажах.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОтчетОРозничныхПродажах.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаНМА.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ПередачаНМА.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПередачаНМА.СуммаДокумента - ПередачаНМА.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ПередачаНМА КАК ПередачаНМА
		|ГДЕ
		|	(НЕ ПередачаНМА.УчитыватьНДС)
		|	И ПередачаНМА.Проведен
		|	И ПередачаНМА.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПередачаНМА.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаОС.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ПередачаОС.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПередачаОС.СуммаДокумента - ПередачаОС.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ПередачаОС КАК ПередачаОС
		|ГДЕ
		|	(НЕ ПередачаОС.УчитыватьНДС)
		|	И ПередачаОС.Проведен
		|	И ПередачаОС.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПередачаОС.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(РеализацияТоваровУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(РеализацияТоваровУслуг.СуммаДокумента - РеализацияТоваровУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Проведен
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (НЕ РеализацияТоваровУслуг.УчитыватьНДС)
		|	И РеализацияТоваровУслуг.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтчетКомитентуОПродажах.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ОтчетКомитентуОПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ОтчетКомитентуОПродажах.СуммаДокумента - ОтчетКомитентуОПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
		|ГДЕ
		|	(НЕ ОтчетКомитентуОПродажах.УчитыватьНДС)
		|	И ОтчетКомитентуОПродажах.Проведен
		|	И ОтчетКомитентуОПродажах.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОтчетКомитентуОПродажах.Организация В(&Организация)";
			
	КонецЕсли;	
		
	НачисленияПоРеализацииНеВключенныеНДСНеУчитывается = Запрос.Выполнить().Выгрузить();
	
	
	//	Документы не включенные в книгу продаж
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДСНачисленныйОстатки.СчетФактура КАК СчетФактура,
	|	НДСНачисленныйОстатки.СтавкаНДС,
	|	НДСНачисленныйОстатки.СуммаБезНДСОстаток,
	|	НДСНачисленныйОстатки.НДСОстаток
	|ПОМЕСТИТЬ ВТНДСНачисленныйОстатки
	|ИЗ
	|	РегистрНакопления.НДСНачисленный.Остатки(
	|			&КонецПериодаГраница,
	|			Организация В (&Организация)
	|				И ((НЕ ВидНачисления В (&НеОтражаютсяВРазделеНачислениеПоРеализации))
	|					И (НЕ ВидЦенности В (&ВидыЦенностейНалоговыйАгент))
	|					И (НЕ ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.СМРСобственнымиСилами)))) КАК НДСНачисленныйОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСНачисленныйОстатки.СчетФактура КАК ДокументРегистратор,
	|	НДСНачисленныйОстатки.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(НДСНачисленныйОстатки.СуммаБезНДСОстаток) КАК Сумма,
	|	СУММА(НДСНачисленныйОстатки.НДСОстаток) КАК СуммаНДС,
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
	|	1 КАК КоличествоДокументов,
	|	ВЫБОР
	|		КОГДА СУММА(НДСНачисленныйОстатки.НДСОстаток) > 0
	|			ТОГДА &ТекстНачислениеНеОтраженоВКнигеПродаж
	|		ИНАЧЕ &ТекстКорректировкаКнигиПродаж
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	&ТекстНеОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС
	|ИЗ
	|	ВТНДСНачисленныйОстатки КАК НДСНачисленныйОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО (НДСНачисленныйОстатки.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|				ИЛИ НДСНачисленныйОстатки.СчетФактура = СчетФактураВыданныйДокументыОснования.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСНачисленныйОстатки.СчетФактура,
	|	НДСНачисленныйОстатки.СтавкаНДС,
	|	СчетФактураВыданныйДокументыОснования.Ссылка";
	
	НачисленияПоРеализацииНеВключенныеНДСНеОтражен = Запрос.Выполнить().Выгрузить();
	
	//	Расшифровка ошибки "Реализация одной номенклатуры по разным ставкам"
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугТовары.Ссылка КАК ОшДокументРегистратор,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК ОшСтавкаНДС,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК ОшНоменклатура,
	|	1 КАК ОшКоличествоДокументов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокТоваров КАК СписокНоменклатуры)
	|	И РеализацияТоваровУслугТовары.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|	И РеализацияТоваровУслугТовары.Номенклатура <> &ПустаяНоменклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС,
	|	РеализацияТоваровУслугУслуги.Номенклатура,
	|	1
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугУслуги.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокУслуг КАК СписокНоменклатуры)
	|	И РеализацияТоваровУслугУслуги.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|	И РеализацияТоваровУслугУслуги.Номенклатура <> &ПустаяНоменклатура";
			
	НачисленияПоРеализацииОшибки = Запрос.Выполнить().Выгрузить();
			
	ВнешнийНаборДанныхНачислениеРеализация = Новый Структура;
	ВнешнийНаборДанныхНачислениеРеализация.Вставить("НачисленияПоРеализацииВключенные",	
													НачисленияПоРеализацииВключенные);
	ВнешнийНаборДанныхНачислениеРеализация.Вставить("НачисленияПоРеализацииНеВключенныеНДСНеУчитывается", 
													НачисленияПоРеализацииНеВключенныеНДСНеУчитывается);
	ВнешнийНаборДанныхНачислениеРеализация.Вставить("НачисленияПоРеализацииНеВключенныеНДСНеОтражен",	
													НачисленияПоРеализацииНеВключенныеНДСНеОтражен);
	ВнешнийНаборДанныхНачислениеРеализация.Вставить("Ошибка", НачисленияПоРеализацииОшибки);
					
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхНачислениеРеализация", ВнешнийНаборДанныхНачислениеРеализация);
	
	ВключенныеВБазу = НачисленияПоРеализацииВключенные.Итог("СуммаНДС"); 
	НеВключенныеВБазу = НачисленияПоРеализацииНеВключенныеНДСНеУчитывается.Итог("СуммаНДС") 
		+ НачисленияПоРеализацииНеВключенныеНДСНеОтражен.Итог("СуммаНДС");
		
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	Если НачисленияПоРеализацииВключенные.Итог("КоличествоОшибок") > 0 Тогда
		СтруктураВозвращаемыхПараметров.Вставить("НаличиеОшибок", Истина);
	КонецЕсли;		
	
	КоличествоЗаписей = НачисленияПоРеализацииВключенные.Количество() 
		+ НачисленияПоРеализацииНеВключенныеНДСНеУчитывается.Количество()
		+ НачисленияПоРеализацииНеВключенныеНДСНеОтражен.Количество();
		 
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);
		 
	Возврат СтруктураВозвращаемыхПараметров;
	
КонецФункции // ПолучитьНаборДанныхНачислениеРеализация()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	начисленному НДС с полученных авансов
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхНачислениеАвансыПолученные(Запрос)
	
	//	Получаем таблицу авансов полученных
	
	//	Затем получаем состав книги продаж, в части авансов полученных,
	//	далее соединяем две таблицы, выявляя ошибки во включенных документах
	//	а так же объединяем с таблицей остатков по регистру "НДС начисленный" (в части авансов полученных) на начало следующего налогового периода
	//	выявляя не включенные в книгу продаж авансы полученные
    
	Если ИдентификаторКонфигурации = "БП" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстаткиИОбороты.Регистратор КАК ДокументРегистратор,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.СуммаОборотКт - ХозрасчетныйОстаткиИОбороты.СуммаОборотКт * 18 / 118 КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.СуммаОборотКт * 18 / 118 КАК ЧИСЛО(15, 2)) КАК СуммаНДС
		|ПОМЕСТИТЬ ВТАвансыПолученные
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериодаГраница, Регистратор, , Счет В ИЕРАРХИИ (&СписокСчетовАвансовПолученных), , Организация В (&Организация)) КАК ХозрасчетныйОстаткиИОбороты
		|ГДЕ
		|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт > 0
		|	И ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументРегистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСЗаписиКнигиПродажОбороты.СчетФактура КАК ДокументРегистратор,
		|	НДСЗаписиКнигиПродажОбороты.СтавкаНДС КАК СтавкаНДС,
		|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот КАК Сумма,
		|	НДСЗаписиКнигиПродажОбороты.НДСОборот КАК СуммаНДС
		|ПОМЕСТИТЬ СоставКнигиПродажВЧастиАвансов
		|ИЗ
		|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
		|			&НачалоПериода,
		|			&КонецПериодаГраница,
		|			,
		|			Организация В (&Организация)
		|				И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПолученАванс)) КАК НДСЗаписиКнигиПродажОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументРегистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСНачисленныйОстатки.СчетФактура КАК СчетФактура,
		|	НДСНачисленныйОстатки.СтавкаНДС,
		|	НДСНачисленныйОстатки.СуммаБезНДСОстаток,
		|	НДСНачисленныйОстатки.НДСОстаток
		|ПОМЕСТИТЬ НДСНачисленныйОстаткиАвансыПолученные
		|ИЗ
		|	РегистрНакопления.НДСНачисленный.Остатки(
		|			&КонецПериодаГраница,
		|			Организация В (&Организация)
		|				И ВидНачисления = &НДСсАвансов) КАК НДСНачисленныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.ДокументРегистратор, Авансы.ДокументРегистратор) КАК ДокументРегистратор,
		|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
		|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)) КАК СтавкаНДС,
		|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.Сумма, Авансы.Сумма) КАК Сумма,
		|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СуммаНДС, Авансы.СуммаНДС) КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL 
		|			ТОГДА &ТекстПолученныйАвансБезСФ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СчетФактураВыданныйДокументыОснования.Ссылка.Проведен
		|					ТОГДА ВЫБОР
		|							КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
		|								ТОГДА &ТекстНачислениеНеОтраженоВКнигеПродаж
		|							ИНАЧЕ ВЫБОР
		|									КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
		|										ТОГДА &ТекстБезОшибок
		|									ИНАЧЕ ВЫБОР
		|											КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор.Проведен
		|												ТОГДА &ТекстБезОшибок
		|											ИНАЧЕ &ТекстСФНаАвансПоНепроведенномуПоручению
		|										КОНЕЦ
		|								КОНЕЦ
		|						КОНЕЦ
		|				ИНАЧЕ &ТекстСФНаПолученныйАвансНеПроведен
		|			КОНЕЦ
		|	КОНЕЦ КАК ПризнакНаличияОшибок,
		|	&ТекстОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС,
		|	ВЫБОР
		|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
		|			ТОГДА Авансы.СуммаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНеВключеннаяВБазу,
		|	ВЫБОР
		|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СуммаНДС, Авансы.СуммаНДС)
		|	КОНЕЦ КАК СуммаВключеннаяВБазу,
		|	1 КАК КоличествоДокументов,
		|	ВЫБОР
		|		КОГДА СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СчетФактураВыданныйДокументыОснования.Ссылка.Проведен
		|					ТОГДА ВЫБОР
		|							КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
		|								ТОГДА 0
		|							ИНАЧЕ ВЫБОР
		|									КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
		|										ТОГДА 0
		|									ИНАЧЕ ВЫБОР
		|											КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор.Проведен
		|												ТОГДА 0
		|											ИНАЧЕ 1
		|										КОНЕЦ
		|								КОНЕЦ
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК КоличествоОшибок
		|ИЗ
		|	СоставКнигиПродажВЧастиАвансов КАК СоставКнигиПродажВЧастиАвансов
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТАвансыПолученные КАК Авансы
		|		ПО (Авансы.ДокументРегистратор = СоставКнигиПродажВЧастиАвансов.ДокументРегистратор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО (Авансы.ДокументРегистратор = СчетФактураВыданныйДокументыОснования.ДокументОснование
		|				ИЛИ СоставКнигиПродажВЧастиАвансов.ДокументРегистратор = СчетФактураВыданныйДокументыОснования.ДокументОснование)
		|ГДЕ
		|	(НЕ СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL )
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	НДСНачисленныйОстатки.СчетФактура,
		|	СчетФактураВыданный.Ссылка,
		|	НДСНачисленныйОстатки.СтавкаНДС,
		|	НДСНачисленныйОстатки.СуммаБезНДСОстаток,
		|	НДСНачисленныйОстатки.НДСОстаток,
		|	ВЫБОР
		|		КОГДА НДСНачисленныйОстатки.НДСОстаток > 0
		|			ТОГДА &ТекстНачислениеНеОтраженоВКнигеПродаж
		|		ИНАЧЕ &ТекстКорректировкаКнигиПродаж
		|	КОНЕЦ,
		|	&ТекстНеОтраженыВКнигеПродаж,
		|	НДСНачисленныйОстатки.НДСОстаток,
		|	0,
		|	1,
		|	0
		|ИЗ
		|	НДСНачисленныйОстаткиАвансыПолученные КАК НДСНачисленныйОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПО НДСНачисленныйОстатки.СчетФактура = СчетФактураВыданный.ДокументОснование
		|ГДЕ
		|	(НЕ СчетФактураВыданный.ПометкаУдаления)";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстаткиИОбороты.Регистратор КАК ДокументРегистратор,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.СуммаОборотКт - ХозрасчетныйОстаткиИОбороты.СуммаОборотКт * 18 / 118 КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.СуммаОборотКт * 18 / 118 КАК ЧИСЛО(15, 2)) КАК СуммаНДС
		|ПОМЕСТИТЬ ВТАвансыПолученные
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериодаГраница, Регистратор, , Счет В ИЕРАРХИИ (&СписокСчетовАвансовПолученных), , Организация В (&Организация)) КАК ХозрасчетныйОстаткиИОбороты
		|ГДЕ
		|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт > 0
		|	И (ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее
		|			ИЛИ ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежныйОрдерПоступлениеДенежныхСредств)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументРегистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСЗаписиКнигиПродажОбороты.СчетФактура КАК ДокументРегистратор,
		|	НДСЗаписиКнигиПродажОбороты.СтавкаНДС КАК СтавкаНДС,
		|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот КАК Сумма,
		|	НДСЗаписиКнигиПродажОбороты.НДСОборот КАК СуммаНДС
		|ПОМЕСТИТЬ СоставКнигиПродажВЧастиАвансов
		|ИЗ
		|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
		|			&НачалоПериода,
		|			&КонецПериодаГраница,
		|			,
		|			Организация В (&Организация)
		|				И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПолученАванс)) КАК НДСЗаписиКнигиПродажОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументРегистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСНачисленныйОстатки.СчетФактура КАК СчетФактура,
		|	НДСНачисленныйОстатки.СтавкаНДС,
		|	НДСНачисленныйОстатки.СуммаБезНДСОстаток,
		|	НДСНачисленныйОстатки.НДСОстаток
		|ПОМЕСТИТЬ НДСНачисленныйОстаткиАвансыПолученные
		|ИЗ
		|	РегистрНакопления.НДСНачисленный.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И ВидНачисления = &НДСсАвансов) КАК НДСНачисленныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.ДокументРегистратор, Авансы.ДокументРегистратор) КАК ДокументРегистратор,
		|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
		|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)) КАК СтавкаНДС,
		|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.Сумма, Авансы.Сумма) КАК Сумма,
		|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СуммаНДС, Авансы.СуммаНДС) КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL 
		|			ТОГДА &ТекстПолученныйАвансБезСФ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СчетФактураВыданныйДокументыОснования.Ссылка.Проведен
		|					ТОГДА ВЫБОР
		|							КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
		|								ТОГДА &ТекстНачислениеНеОтраженоВКнигеПродаж
		|							ИНАЧЕ ВЫБОР
		|									КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
		|										ТОГДА &ТекстБезОшибок
		|									ИНАЧЕ ВЫБОР
		|											КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор.Проведен
		|												ТОГДА &ТекстБезОшибок
		|											ИНАЧЕ &ТекстСФНаАвансПоНепроведенномуПоручению
		|										КОНЕЦ
		|								КОНЕЦ
		|						КОНЕЦ
		|				ИНАЧЕ &ТекстСФНаПолученныйАвансНеПроведен
		|			КОНЕЦ
		|	КОНЕЦ КАК ПризнакНаличияОшибок,
		|	ВЫБОР
		|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
		|			ТОГДА &ТекстНеОтраженыВКнигеПродаж
		|		ИНАЧЕ &ТекстОтраженыВКнигеПродаж
		|	КОНЕЦ КАК ПризнакОтраженияНДС,
		|	ВЫБОР
		|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
		|			ТОГДА Авансы.СуммаНДС
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНеВключеннаяВБазу,
		|	ВЫБОР
		|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СуммаНДС, Авансы.СуммаНДС)
		|	КОНЕЦ КАК СуммаВключеннаяВБазу,
		|	1 КАК КоличествоДокументов,
		|	ВЫБОР
		|		КОГДА СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СчетФактураВыданныйДокументыОснования.Ссылка.Проведен
		|					ТОГДА ВЫБОР
		|							КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
		|								ТОГДА 0
		|							ИНАЧЕ ВЫБОР
		|									КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
		|										ТОГДА 0
		|									ИНАЧЕ ВЫБОР
		|											КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор.Проведен
		|												ТОГДА 0
		|											ИНАЧЕ 1
		|										КОНЕЦ
		|								КОНЕЦ
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК КоличествоОшибок
		|ИЗ
		|	СоставКнигиПродажВЧастиАвансов КАК СоставКнигиПродажВЧастиАвансов
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТАвансыПолученные КАК Авансы
		|		ПО (Авансы.ДокументРегистратор = СоставКнигиПродажВЧастиАвансов.ДокументРегистратор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО (Авансы.ДокументРегистратор = СчетФактураВыданныйДокументыОснования.ДокументОснование
		|				ИЛИ СоставКнигиПродажВЧастиАвансов.ДокументРегистратор = СчетФактураВыданныйДокументыОснования.ДокументОснование)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	НДСНачисленныйОстатки.СчетФактура,
		|	СчетФактураВыданныйДокументыОснования.Ссылка,
		|	НДСНачисленныйОстатки.СтавкаНДС,
		|	НДСНачисленныйОстатки.СуммаБезНДСОстаток,
		|	НДСНачисленныйОстатки.НДСОстаток,
		|	ВЫБОР
		|		КОГДА НДСНачисленныйОстатки.НДСОстаток > 0
		|			ТОГДА &ТекстНачислениеНеОтраженоВКнигеПродаж
		|		ИНАЧЕ &ТекстКорректировкаКнигиПродаж
		|	КОНЕЦ,
		|	&ТекстНеОтраженыВКнигеПродаж,
		|	НДСНачисленныйОстатки.НДСОстаток,
		|	0,
		|	1,
		|	0
		|ИЗ
		|	НДСНачисленныйОстаткиАвансыПолученные КАК НДСНачисленныйОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО НДСНачисленныйОстатки.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование";
		
	КонецЕсли;	
				
	НачисленияПоАвансамПолученным = Запрос.Выполнить().Выгрузить();
	
	ВнешнийНаборДанныхНачислениеАвансыПолученные = Новый Структура;
	ВнешнийНаборДанныхНачислениеАвансыПолученные.Вставить("НачисленияПоАвансамПолученным",НачисленияПоАвансамПолученным);
	
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхНачислениеАвансыПолученные", 
									 ВнешнийНаборДанныхНачислениеАвансыПолученные);
			
	ВключенныеВБазу = НачисленияПоАвансамПолученным.Итог("СуммаВключеннаяВБазу");
	НеВключенныеВБазу = НачисленияПоАвансамПолученным.Итог("СуммаНеВключеннаяВБазу");
	
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	Если НачисленияПоАвансамПолученным.Итог("КоличествоОшибок") > 0 Тогда
		СтруктураВозвращаемыхПараметров.Вставить("НаличиеОшибок", Истина);
	КонецЕсли;
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", НачисленияПоАвансамПолученным.Количество() > 0);
	
	Возврат СтруктураВозвращаемыхПараметров;
	
КонецФункции // ПолучитьНаборДанныхНачислениеАвансыПолученные()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	начисленному НДС при исполнении обязанностей налогового агента
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхНачислениеНалоговыйАгент(Запрос)
	
	Если ИдентификаторКонфигурации = "БП" Тогда
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НДСЗаписиКнигиПродажОбороты.СчетФактура КАК СчетФактура,
		|	НДСЗаписиКнигиПродажОбороты.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	НДСЗаписиКнигиПродажОбороты.Покупатель КАК Покупатель,
		|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот КАК СуммаБезНДСОборот,
		|	НДСЗаписиКнигиПродажОбороты.НДСОборот КАК НДСОборот
		|ПОМЕСТИТЬ ВТНДСЗаписиКнигиПродажОбороты
		|ИЗ
		|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
		|			&НачалоПериода,
		|			&КонецПериодаГраница,
		|			,
		|			Организация В (&Организация)
		|				И ВидЦенности В (&ВидыЦенностейНалоговыйАгент)) КАК НДСЗаписиКнигиПродажОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	ДоговорКонтрагента,
		|	Покупатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Хозрасчетный.Ссылка КАК СчетСсылка
		|ПОМЕСТИТЬ ВТСчета
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
		|ГДЕ
		|	(НЕ Хозрасчетный.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты))
		|	И (НЕ Хозрасчетный.ВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы))
		|	И (НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор
		|ПОМЕСТИТЬ Договоры
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Организация В(&Организация)
		|	И ДоговорыКонтрагентов.УчетАгентскогоНДС = ИСТИНА
		|	И ДоговорыКонтрагентов.НалоговыйАгентПоОплате = ИСТИНА
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Договор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХозрасчетныйСубконто.Регистратор КАК Регистратор,
		|	ХозрасчетныйСубконто.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ НомераПроводок
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Субконто КАК ХозрасчетныйСубконто
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Договоры КАК Договоры
		|		ПО (ХозрасчетныйСубконто.Вид = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры))
		|			И ХозрасчетныйСубконто.Значение = Договоры.Договор
		|			И (ХозрасчетныйСубконто.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет))
		|			И (ХозрасчетныйСубконто.Период МЕЖДУ &НачалоПериода И &КонецПериода)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ХозрасчетныйСубконто.Регистратор КАК Регистратор,
		|	ХозрасчетныйСубконто.НомерСтроки КАК НомерСтроки,
		|	ХозрасчетныйСубконто.Вид,
		|	ХозрасчетныйСубконто.Значение
		|ПОМЕСТИТЬ ЗначенияСубконто
		|ИЗ
		|	НомераПроводок КАК НомераПроводок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Субконто КАК ХозрасчетныйСубконто
		|		ПО НомераПроводок.Регистратор = ХозрасчетныйСубконто.Регистратор
		|			И НомераПроводок.НомерСтроки = ХозрасчетныйСубконто.НомерСтроки
		|			И (ХозрасчетныйСубконто.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Дебет))
		|			И (ХозрасчетныйСубконто.Вид В (ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами)))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Хозрасчетный.Регистратор КАК Регистратор,
		|	Контрагенты.Значение КАК СубконтоДт1,
		|	Договоры.Значение КАК СубконтоДт2,
		|	ДокументыРасчетов.Значение КАК СубконтоДт3,
		|	Хозрасчетный.Сумма КАК СуммаОборот,
		|	ВЫРАЗИТЬ(Хозрасчетный.Сумма * 0.18 КАК ЧИСЛО(15, 2)) КАК СуммаНДСОборот
		|ПОМЕСТИТЬ ВТХозрасчетныйОборотыДтКт
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияСубконто КАК Договоры
		|		ПО Хозрасчетный.Регистратор = Договоры.Регистратор
		|			И Хозрасчетный.НомерСтроки = Договоры.НомерСтроки
		|			И (Договоры.Вид = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияСубконто КАК Контрагенты
		|		ПО Хозрасчетный.Регистратор = Контрагенты.Регистратор
		|			И Хозрасчетный.НомерСтроки = Контрагенты.НомерСтроки
		|			И (Контрагенты.Вид = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗначенияСубконто КАК ДокументыРасчетов
		|		ПО Хозрасчетный.Регистратор = ДокументыРасчетов.Регистратор
		|			И Хозрасчетный.НомерСтроки = ДокументыРасчетов.НомерСтроки
		|			И (ДокументыРасчетов.Вид = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами))
		|ГДЕ
		|	Хозрасчетный.СчетКт В
		|			(ВЫБРАТЬ
		|				ВТСчета.СчетСсылка
		|			ИЗ
		|				ВТСчета КАК ВТСчета)
		|	И (НЕ Хозрасчетный.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНалоговогоАгента))
		|	И Хозрасчетный.Организация В(&Организация)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор,
		|	СубконтоДт1,
		|	СубконтоДт2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка КАК Ссылка,
		|	СчетФактураВыданный.Ссылка.Проведен КАК Проведен,
		|	СчетФактураВыданный.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СчетФактураВыданный.Ссылка.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВТСчетФактураВыданный
		|ИЗ
		|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НалоговыйАгент)
		|	И СчетФактураВыданный.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДоговорКонтрагента,
		|	ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОборотыДтКт.Регистратор КАК ДокументОплаты,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
		|	СУММА(ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот, ХозрасчетныйОборотыДтКт.СуммаОборот + ХозрасчетныйОборотыДтКт.СуммаНДСОборот)) КАК Сумма,
		|	СУММА(ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.НДСОборот, ХозрасчетныйОборотыДтКт.СуммаНДСОборот)) КАК СуммаНДС,
		|	ЕСТЬNULL(СчетФактураВыданный.Ссылка, НЕОПРЕДЕЛЕНО) КАК СчетФактура,
		|	ВЫБОР
		|		КОГДА НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот ЕСТЬ NULL 
		|			ТОГДА ВЫБОР
		|					КОГДА СчетФактураВыданный.Ссылка ЕСТЬ NULL 
		|						ТОГДА &ТекстСФНалоговогоАгентаНеВыписан
		|					ИНАЧЕ ВЫБОР
		|							КОГДА СчетФактураВыданный.Проведен
		|								ТОГДА &ТекстНачислениеНеОтраженоВКнигеПродаж
		|							ИНАЧЕ &ТекстСФНалоговогоАгентаНеПроведен
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ &ТекстБезОшибок
		|	КОНЕЦ КАК ПризнакНаличияОшибок,
		|	ВЫБОР
		|		КОГДА НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот ЕСТЬ NULL 
		|			ТОГДА &ТекстНеОтраженыВКнигеПродаж
		|		ИНАЧЕ &ТекстОтраженыВКнигеПродаж
		|	КОНЕЦ КАК ПризнакОтраженияНДС,
		|	СУММА(1) КАК КоличествоДокументов,
		|	ХозрасчетныйОборотыДтКт.СубконтоДт3 КАК ДокументРегистратор,
		|	СУММА(ВЫБОР
		|			КОГДА НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот ЕСТЬ NULL 
		|				ТОГДА 0
		|			ИНАЧЕ НДСЗаписиКнигиПродажОбороты.НДСОборот
		|		КОНЕЦ) КАК СуммаВключенныхВБазу,
		|	СУММА(ВЫБОР
		|			КОГДА НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот ЕСТЬ NULL 
		|				ТОГДА ХозрасчетныйОборотыДтКт.СуммаНДСОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаНеВключенныхВБазу
		|ИЗ
		|	ВТХозрасчетныйОборотыДтКт КАК ХозрасчетныйОборотыДтКт
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСчетФактураВыданный КАК СчетФактураВыданный
		|		ПО ХозрасчетныйОборотыДтКт.Регистратор = СчетФактураВыданный.ДокументОснование
		|			И ХозрасчетныйОборотыДтКт.СубконтоДт2 = СчетФактураВыданный.ДоговорКонтрагента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСЗаписиКнигиПродажОбороты КАК НДСЗаписиКнигиПродажОбороты
		|		ПО ХозрасчетныйОборотыДтКт.Регистратор = НДСЗаписиКнигиПродажОбороты.СчетФактура
		|			И ХозрасчетныйОборотыДтКт.СубконтоДт2 = НДСЗаписиКнигиПродажОбороты.ДоговорКонтрагента
		|			И ХозрасчетныйОборотыДтКт.СубконтоДт1 = НДСЗаписиКнигиПродажОбороты.Покупатель
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОборотыДтКт.Регистратор,
		|	ЕСТЬNULL(СчетФактураВыданный.Ссылка, НЕОПРЕДЕЛЕНО),
		|	ХозрасчетныйОборотыДтКт.СубконтоДт1,
		|	ХозрасчетныйОборотыДтКт.СубконтоДт2,
		|	ХозрасчетныйОборотыДтКт.СубконтоДт3,
		|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот,
		|	НДСЗаписиКнигиПродажОбороты.НДСОборот,
		|	ВЫБОР
		|		КОГДА НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот ЕСТЬ NULL 
		|			ТОГДА ВЫБОР
		|					КОГДА СчетФактураВыданный.Ссылка ЕСТЬ NULL 
		|						ТОГДА &ТекстСФНалоговогоАгентаНеВыписан
		|					ИНАЧЕ ВЫБОР
		|							КОГДА СчетФактураВыданный.Проведен
		|								ТОГДА &ТекстНачислениеНеОтраженоВКнигеПродаж
		|							ИНАЧЕ &ТекстСФНалоговогоАгентаНеПроведен
		|						КОНЕЦ
		|				КОНЕЦ
		|		ИНАЧЕ &ТекстБезОшибок
		|	КОНЕЦ";


		
	Иначе
		
		Если РедакцияКонфигурации = "1.2" ИЛИ РедакцияКонфигурации = "1.0" Тогда
			
			НачисленияИсполнениеОНА = Новый ТаблицаЗначений;
			
			ВнешнийНаборДанныхНачислениеИсполнениеОНА = Новый Структура;
			ВнешнийНаборДанныхНачислениеИсполнениеОНА.Вставить("НачисленияИсполнениеОНА", НачисленияИсполнениеОНА);
			
			СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхНачислениеИсполнениеОНА", 
			ВнешнийНаборДанныхНачислениеИсполнениеОНА);
			
			СтруктураВозвращаемыхПараметров = Новый Структура();
			СтруктураВозвращаемыхПараметров.Вставить("Включенные", 0);
			СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", 0);
			
			СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", Ложь);	
			
			Возврат СтруктураВозвращаемыхПараметров;
					
		Иначе
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасчетыПоПриобретению.Регистратор,
			|	РасчетыПоПриобретению.Документ,
			|	РасчетыПоПриобретению.СуммаРегОборот,
			|	ВЫРАЗИТЬ(РасчетыПоПриобретению.СуммаРегОборот + РасчетыПоПриобретению.СуммаРегОборот * 0.18 КАК ЧИСЛО(15, 2)) КАК Сумма,
			|	ВЫРАЗИТЬ(РасчетыПоПриобретению.СуммаРегОборот * 0.18 КАК ЧИСЛО(15, 2)) КАК СуммаНДС
			|ПОМЕСТИТЬ ВТРасчетыПоПриобретениюВУсловныхЕдиницахОрганизацииНачислениеНалоговыйАгент
			|ИЗ
			|	РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации.Обороты(
			|			&НачалоПериода,
			|			&КонецПериодаГраница,
			|			Регистратор,
			|			ДоговорКонтрагента.УчетАгентскогоНДС
			|				И ДоговорКонтрагента.НалоговыйАгентПоОплате
			|				И Организация В (&Организация)) КАК РасчетыПоПриобретению
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	РасчетыПоПриобретению.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НДСЗаписиКнигиПродажОбороты.СчетФактура,
			|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот,
			|	НДСЗаписиКнигиПродажОбороты.НДСОборот
			|ПОМЕСТИТЬ ВТНДСЗаписиКнигиПродажНачислениеНалоговыйАгент
			|ИЗ
			|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
			|			&НачалоПериода,
			|			&КонецПериодаГраница,
			|			,
			|			Организация В (&Организация)
			|				И ВидЦенности В (&ВидыЦенностейНалоговыйАгент)) КАК НДСЗаписиКнигиПродажОбороты
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	НДСЗаписиКнигиПродажОбороты.СчетФактура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасчетыПоПриобретению.Регистратор КАК ДокументОплаты,
			|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
			|	СУММА(ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот, РасчетыПоПриобретению.Сумма)) КАК Сумма,
			|	СУММА(ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.НДСОборот, РасчетыПоПриобретению.СуммаНДС)) КАК СуммаНДС,
			|	ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.Ссылка, НЕОПРЕДЕЛЕНО) КАК СчетФактура,
			|	ВЫБОР
			|		КОГДА НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот ЕСТЬ NULL 
			|			ТОГДА ВЫБОР
			|					КОГДА СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL 
			|						ТОГДА &ТекстСФНалоговогоАгентаНеВыписан
			|					ИНАЧЕ ВЫБОР
			|							КОГДА СчетФактураВыданныйДокументыОснования.Ссылка.Проведен
			|								ТОГДА &ТекстНачислениеНеОтраженоВКнигеПродаж
			|							ИНАЧЕ &ТекстСФНалоговогоАгентаНеПроведен
			|						КОНЕЦ
			|				КОНЕЦ
			|		ИНАЧЕ &ТекстБезОшибок
			|	КОНЕЦ КАК ПризнакНаличияОшибок,
			|	ВЫБОР
			|		КОГДА НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот ЕСТЬ NULL 
			|			ТОГДА &ТекстНеОтраженыВКнигеПродаж
			|		ИНАЧЕ &ТекстОтраженыВКнигеПродаж
			|	КОНЕЦ КАК ПризнакОтраженияНДС,
			|	СУММА(1) КАК КоличествоДокументов,
			|	РасчетыПоПриобретению.Документ КАК ДокументРегистратор,
			|	СУММА(ВЫБОР
			|			КОГДА НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот ЕСТЬ NULL 
			|				ТОГДА 0
			|			ИНАЧЕ НДСЗаписиКнигиПродажОбороты.НДСОборот
			|		КОНЕЦ) КАК СуммаВключенныхВБазу,
			|	СУММА(ВЫБОР
			|			КОГДА НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот ЕСТЬ NULL 
			|				ТОГДА РасчетыПоПриобретению.СуммаРегОборот * 0.18
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК СуммаНеВключенныхВБазу
			|ИЗ
			|	ВТРасчетыПоПриобретениюВУсловныхЕдиницахОрганизацииНачислениеНалоговыйАгент КАК РасчетыПоПриобретению
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
			|		ПО РасчетыПоПриобретению.Регистратор = СчетФактураВыданныйДокументыОснования.ДокументОснование
			|			И (СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НалоговыйАгент))
			|			И (СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления = ЛОЖЬ)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСЗаписиКнигиПродажНачислениеНалоговыйАгент КАК НДСЗаписиКнигиПродажОбороты
			|		ПО РасчетыПоПриобретению.Регистратор = НДСЗаписиКнигиПродажОбороты.СчетФактура
			|ГДЕ
			|	РасчетыПоПриобретению.СуммаРегОборот > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетыПоПриобретению.Регистратор,
			|	ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.Ссылка, НЕОПРЕДЕЛЕНО),
			|	ВЫБОР
			|		КОГДА НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот ЕСТЬ NULL 
			|			ТОГДА ВЫБОР
			|					КОГДА СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL 
			|						ТОГДА &ТекстСФНалоговогоАгентаНеВыписан
			|					ИНАЧЕ ВЫБОР
			|							КОГДА СчетФактураВыданныйДокументыОснования.Ссылка.Проведен
			|								ТОГДА &ТекстНачислениеНеОтраженоВКнигеПродаж
			|							ИНАЧЕ &ТекстСФНалоговогоАгентаНеПроведен
			|						КОНЕЦ
			|				КОНЕЦ
			|		ИНАЧЕ &ТекстБезОшибок
			|	КОНЕЦ,
			|	ВЫБОР
			|		КОГДА НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот ЕСТЬ NULL 
			|			ТОГДА &ТекстНеОтраженыВКнигеПродаж
			|		ИНАЧЕ &ТекстОтраженыВКнигеПродаж
			|	КОНЕЦ,
			|	РасчетыПоПриобретению.Документ";

		КонецЕсли;	
	КонецЕсли;
	
	НачисленияИсполнениеОНА = Запрос.Выполнить().Выгрузить();
	
	ВнешнийНаборДанныхНачислениеИсполнениеОНА = Новый Структура;
	ВнешнийНаборДанныхНачислениеИсполнениеОНА.Вставить("НачисленияИсполнениеОНА", НачисленияИсполнениеОНА);
	
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхНачислениеИсполнениеОНА", 
									 ВнешнийНаборДанныхНачислениеИсполнениеОНА);
	
	ВключенныеВБазу = НачисленияИсполнениеОНА.Итог("СуммаВключенныхВБазу");
	НеВключенныеВБазу = НачисленияИсполнениеОНА.Итог("СуммаНеВключенныхВБазу");
		
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", НачисленияИсполнениеОНА.Количество() > 0);	
	
	Возврат СтруктураВозвращаемыхПараметров;
	
КонецФункции // ПолучитьНаборДанныхНачислениеИсполнениеОНА()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	начисленному НДС при восстановлении с авансов выданных (по факту поступления ценностей)
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхНачислениеВосстановлениеСАвансовВыданных(Запрос)
	
	//	Не вошедшие в базу
	Если ИдентификаторКонфигурации = "БП" Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НДСсАвансовОстатки.СчетФактура КАК СчетФактура,
		|	НДСсАвансовОстатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСсАвансовОстатки.ВидЦенности КАК ВидЦенности,
		|	НДСсАвансовОстатки.СуммаБезНДСОстаток,
		|	НДСсАвансовОстатки.НДСОстаток
		|ПОМЕСТИТЬ ВТНДССАвансовОстатки
		|ИЗ
		|	РегистрНакопления.НДСсАвансов.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК НДСсАвансовОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	СтавкаНДС,
		|	ВидЦенности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСПредъявленныйОстатки.СчетФактура КАК СчетФактура,
		|	НДСПредъявленныйОстатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСПредъявленныйОстатки.ВидЦенности КАК ВидЦенности,
		|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток,
		|	НДСПредъявленныйОстатки.НДСОстаток
		|ПОМЕСТИТЬ ВТНДСПредъявленныйПоАвансамОстатки
		|ИЗ
		|	РегистрНакопления.НДСПредъявленный.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК НДСПредъявленныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	СтавкаНДС,
		|	ВидЦенности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
		|	ХозрасчетныйОстатки.СуммаОстатокДт
		|ПОМЕСТИТЬ ВТХозрасчетныйОстаткиАвансы
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериодаГраница, Счет В (&СписокСчетовАвансовВыданных), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами), Организация В (&Организация)) КАК ХозрасчетныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСсАвансовОстатки.СчетФактура КАК ДокументРегистратор,
		|	НДСсАвансовОстатки.СтавкаНДС,
		|	ВЫБОР
		|		КОГДА НДСсАвансовОстатки.СуммаБезНДСОстаток - ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) = 0
		|			ТОГДА НДСсАвансовОстатки.СуммаБезНДСОстаток
		|		ИНАЧЕ НДСсАвансовОстатки.СуммаБезНДСОстаток - ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0)
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА НДСсАвансовОстатки.НДСОстаток - ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) = 0
		|			ТОГДА НДСсАвансовОстатки.НДСОстаток
		|		ИНАЧЕ НДСсАвансовОстатки.НДСОстаток - ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0)
		|	КОНЕЦ КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА НДСсАвансовОстатки.НДСОстаток - ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) = 0
		|			ТОГДА &ТекстВыданныйАвансНеОтраженВКнигеПокупок
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НДСсАвансовОстатки.СуммаБезНДСОстаток + НДСсАвансовОстатки.НДСОстаток > ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстатокДт, 0)
		|					ТОГДА &ТекстНачислениеНеОтраженоВКнигеПродаж
		|				ИНАЧЕ &ТекстОплаченныеЦенностиНеПоступили
		|			КОНЕЦ
		|	КОНЕЦ КАК ПризнакНаличияОшибок,
		|	&ТекстНеОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС,
		|	1 КАК КоличествоДокументов
		|ИЗ
		|	ВТНДССАвансовОстатки КАК НДСсАвансовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСПредъявленныйПоАвансамОстатки КАК НДСПредъявленныйОстатки
		|		ПО НДСсАвансовОстатки.СчетФактура = НДСПредъявленныйОстатки.СчетФактура
		|			И НДСсАвансовОстатки.СтавкаНДС = НДСПредъявленныйОстатки.СтавкаНДС
		|			И НДСсАвансовОстатки.ВидЦенности = НДСПредъявленныйОстатки.ВидЦенности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХозрасчетныйОстаткиАвансы КАК ХозрасчетныйОстатки
		|		ПО НДСсАвансовОстатки.СчетФактура = ХозрасчетныйОстатки.Субконто1";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НДСсАвансовОстатки.СчетФактура КАК СчетФактура,
		|	НДСсАвансовОстатки.СтавкаНДС,
		|	НДСсАвансовОстатки.ВидЦенности,
		|	НДСсАвансовОстатки.СуммаБезНДСОстаток,
		|	НДСсАвансовОстатки.НДСОстаток,
		|	НДСсАвансовОстатки.Покупатель КАК Покупатель,
		|	НДСсАвансовОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента
		|ПОМЕСТИТЬ ВТНДССАвансовОстатки
		|ИЗ
		|	РегистрНакопления.НДСсАвансов.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК НДСсАвансовОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Покупатель,
		|	ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСПредъявленныйОстатки.СчетФактура КАК СчетФактура,
		|	НДСПредъявленныйОстатки.СтавкаНДС,
		|	НДСПредъявленныйОстатки.ВидЦенности,
		|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток,
		|	НДСПредъявленныйОстатки.НДСОстаток
		|ПОМЕСТИТЬ ВТНДСПредъявленныйПоАвансамОстатки
		|ИЗ
		|	РегистрНакопления.НДСПредъявленный.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК НДСПредъявленныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
		|	ХозрасчетныйОстатки.Субконто2 КАК Субконто2,
		|	ХозрасчетныйОстатки.СуммаОстатокДт
		|ПОМЕСТИТЬ ВТХозрасчетныйОстаткиАвансы
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериодаГраница, Счет В (&СписокСчетовАвансовВыданных), &ВидыСубконто, Организация В (&Организация)) КАК ХозрасчетныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСсАвансовОстатки.СчетФактура КАК СчетФактура,
		|	НДСсАвансовОстатки.СтавкаНДС,
		|	НДСсАвансовОстатки.ВидЦенности,
		|	НДСсАвансовОстатки.СуммаБезНДСОстаток,
		|	НДСсАвансовОстатки.НДСОстаток,
		|	НДСсАвансовОстатки.Покупатель КАК Покупатель,
		|	НДСсАвансовОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
		|	ХозрасчетныйОстатки.Субконто2 КАК Субконто2,
		|	ХозрасчетныйОстатки.СуммаОстатокДт
		|ПОМЕСТИТЬ ВТНДССАвансовОстаткиИХозрасчетныйОстатки
		|ИЗ
		|	ВТНДССАвансовОстатки КАК НДСсАвансовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХозрасчетныйОстаткиАвансы КАК ХозрасчетныйОстатки
		|		ПО НДСсАвансовОстатки.Покупатель = ХозрасчетныйОстатки.Субконто1
		|			И НДСсАвансовОстатки.ДоговорКонтрагента = ХозрасчетныйОстатки.Субконто2
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НДСсАвансовОстатки.СчетФактура,
		|	НДСсАвансовОстатки.СтавкаНДС,
		|	НДСсАвансовОстатки.ВидЦенности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСсАвансовОстатки.СчетФактура КАК ДокументРегистратор,
		|	НДСсАвансовОстатки.СтавкаНДС,
		|	ВЫБОР
		|		КОГДА НДСсАвансовОстатки.СуммаБезНДСОстаток - ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) = 0
		|			ТОГДА НДСсАвансовОстатки.СуммаБезНДСОстаток
		|		ИНАЧЕ НДСсАвансовОстатки.СуммаБезНДСОстаток - ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0)
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА НДСсАвансовОстатки.НДСОстаток - ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) = 0
		|			ТОГДА НДСсАвансовОстатки.НДСОстаток
		|		ИНАЧЕ НДСсАвансовОстатки.НДСОстаток - ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0)
		|	КОНЕЦ КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА НДСсАвансовОстатки.НДСОстаток - ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) = 0
		|			ТОГДА &ТекстВыданныйАвансНеОтраженВКнигеПокупок
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НДСсАвансовОстатки.СуммаБезНДСОстаток + НДСсАвансовОстатки.НДСОстаток > ЕСТЬNULL(НДСсАвансовОстатки.СуммаОстатокДт, 0)
		|					ТОГДА &ТекстНачислениеНеОтраженоВКнигеПродаж
		|				ИНАЧЕ &ТекстОплаченныеЦенностиНеПоступили
		|			КОНЕЦ
		|	КОНЕЦ КАК ПризнакНаличияОшибок,
		|	&ТекстНеОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС,
		|	1 КАК КоличествоДокументов
		|ИЗ
		|	ВТНДССАвансовОстаткиИХозрасчетныйОстатки КАК НДСсАвансовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСПредъявленныйПоАвансамОстатки КАК НДСПредъявленныйОстатки
		|		ПО НДСсАвансовОстатки.СчетФактура = НДСПредъявленныйОстатки.СчетФактура
		|			И НДСсАвансовОстатки.СтавкаНДС = НДСПредъявленныйОстатки.СтавкаНДС
		|			И НДСсАвансовОстатки.ВидЦенности = НДСПредъявленныйОстатки.ВидЦенности";
		
	КонецЕсли;
	
	ВосстановлениеПоАвансамВыданнымНеВключенные = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СоставКнигиПродаж.СчетФактура КАК СчетФактура,
	|	СоставКнигиПродаж.СтавкаНДС КАК СтавкаНДС,
	|	СоставКнигиПродаж.СуммаБезНДСОборот,
	|	СоставКнигиПродаж.НДСОборот
	|ПОМЕСТИТЬ ВТСоставКнигиПродажВосстановлениеСАвансовВыданных
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК СоставКнигиПродаж
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставКнигиПродаж.СуммаБезНДСОборот КАК Сумма,
	|	СоставКнигиПродаж.НДСОборот КАК СуммаНДС,
	|	СоставКнигиПродаж.СчетФактура КАК ДокументРегистратор,
	|	СоставКнигиПродаж.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА НДСсАвансовОстатки.СуммаБезНДСОстаток ЕСТЬ NULL 
	|			ТОГДА &ТекстНДСПолностьюВосстановлен
	|		ИНАЧЕ &ТекстНДСВосстановленЧастично
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	&ТекстОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС,
	|	1 КАК КоличествоДокументов
	|ИЗ
	|	ВТСоставКнигиПродажВосстановлениеСАвансовВыданных КАК СоставКнигиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСПредъявленныйПоАвансамОстатки КАК НДСсАвансовОстатки
	|		ПО СоставКнигиПродаж.СчетФактура = НДСсАвансовОстатки.СчетФактура
	|			И СоставКнигиПродаж.СтавкаНДС = НДСсАвансовОстатки.СтавкаНДС";			 
	
	ВосстановлениеПоАвансамВыданнымВключенные = Запрос.Выполнить().Выгрузить();
	
	ВнешнийНаборДанныхНачислениеВосстановлениеСВыданныхАвансов = Новый Структура;
	ВнешнийНаборДанныхНачислениеВосстановлениеСВыданныхАвансов.Вставить("ВосстановлениеПоАвансамВыданнымВключенные",		
																		ВосстановлениеПоАвансамВыданнымВключенные);
	ВнешнийНаборДанныхНачислениеВосстановлениеСВыданныхАвансов.Вставить("ВосстановлениеПоАвансамВыданнымНеВключенные",	
																		ВосстановлениеПоАвансамВыданнымНеВключенные);
	
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхНачислениеВосстановлениеСВыданныхАвансов", 
									 ВнешнийНаборДанныхНачислениеВосстановлениеСВыданныхАвансов);
	
	ВключенныеВБазу = ВосстановлениеПоАвансамВыданнымВключенные.Итог("СуммаНДС");
	НеВключенныеВБазу = ВосстановлениеПоАвансамВыданнымНеВключенные.Итог("СуммаНДС");
	
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	КоличествоЗаписей = ВосстановлениеПоАвансамВыданнымВключенные.Количество() 
		+ ВосстановлениеПоАвансамВыданнымНеВключенные.Количество(); 
	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);
	
	Возврат СтруктураВозвращаемыхПараметров;
	
КонецФункции // ПолучитьНаборДанныхНачислениеВосстановлениеСАвансовВыданных()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	начисленному НДС при выполнении строительно-монтажных работ хозяйственным способом
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхНачислениеСМРХозСпособом(Запрос)
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДСНачисленныйОстатки.СчетФактура КАК СчетФактура,
	|	НДСНачисленныйОстатки.СтавкаНДС,
	|	НДСНачисленныйОстатки.СуммаБезНДСОстаток,
	|	НДСНачисленныйОстатки.НДСОстаток
	|ПОМЕСТИТЬ НДСНачисленныйПоСМР
	|ИЗ
	|	РегистрНакопления.НДСНачисленный.Остатки(
	|			&НачалоСледующегоПериода,
	|			Организация В (&Организация)
	|				И ВидНачисления = ЗНАЧЕНИЕ(Перечисление.НДСВидНачисления.НДСНачисленКУплате)
	|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.СМРСобственнымиСилами)) КАК НДСНачисленныйОстатки
	|ГДЕ
	|	(НЕ(НДСНачисленныйОстатки.СуммаБезНДСОстаток = 0
	|				И НДСНачисленныйОстатки.НДСОстаток = 0))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПродажОбороты.СчетФактура КАК СчетФактура,
	|	НДСЗаписиКнигиПродажОбороты.СтавкаНДС,
	|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот,
	|	НДСЗаписиКнигиПродажОбороты.НДСОборот
	|ПОМЕСТИТЬ ЗаписиКнигиПродажВЧастиСМР
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.СМРСобственнымиСилами)) КАК НДСЗаписиКнигиПродажОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСНачисленныйОстатки.СчетФактура КАК ДокументРегистратор,
	|	СчетаФактурыВыданные.Ссылка КАК СчетФактура,
	|	НДСНачисленныйОстатки.СтавкаНДС,
	|	НДСНачисленныйОстатки.СуммаБезНДСОстаток КАК Сумма,
	|	НДСНачисленныйОстатки.НДСОстаток КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА НДСНачисленныйОстатки.НДСОстаток > 0
	|			ТОГДА &ТекстНеОтраженыВКнигеПродаж
	|		ИНАЧЕ &ТекстКорректировкаКнигиПродаж
	|	КОНЕЦ КАК ПризнакОтраженияНДС,
	|	1 КАК КоличествоДокументов,
	|	НДСНачисленныйОстатки.НДСОстаток КАК НеВключенныйНДС,
	|	0 КАК ВключенныйНДС
	|ИЗ
	|	НДСНачисленныйПоСМР КАК НДСНачисленныйОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетаФактурыВыданные
	|		ПО (СчетаФактурыВыданные.ДокументОснование = НДСНачисленныйОстатки.СчетФактура)
	|ГДЕ
	|	(НЕ(НДСНачисленныйОстатки.СуммаБезНДСОстаток = 0
	|				И НДСНачисленныйОстатки.НДСОстаток = 0))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПродажОбороты.СчетФактура,
	|	СчетаФактурыВыданные.Ссылка,
	|	НДСЗаписиКнигиПродажОбороты.СтавкаНДС,
	|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот,
	|	НДСЗаписиКнигиПродажОбороты.НДСОборот,
	|	&ТекстОтраженыВКнигеПродаж,
	|	1,
	|	0,
	|	НДСЗаписиКнигиПродажОбороты.НДСОборот
	|ИЗ
	|	ЗаписиКнигиПродажВЧастиСМР КАК НДСЗаписиКнигиПродажОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетаФактурыВыданные
	|		ПО (СчетаФактурыВыданные.ДокументОснование = НДСЗаписиКнигиПродажОбороты.СчетФактура)";
	
	НачислениеСМРХозСпособом = Запрос.Выполнить().Выгрузить();
	
	ВнешнийНаборДанныхНачислениеСМРХозСпособом = Новый Структура;
	ВнешнийНаборДанныхНачислениеСМРХозСпособом.Вставить("НачислениеСМРХозСпособом",	НачислениеСМРХозСпособом);
	
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхНачислениеСМРХозСпособом", 
									 ВнешнийНаборДанныхНачислениеСМРХозСпособом);
	
	ВключенныеВБазу = НачислениеСМРХозСпособом.Итог("ВключенныйНДС");
	НеВключенныеВБазу = НачислениеСМРХозСпособом.Итог("НеВключенныйНДС");
		
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", НачислениеСМРХозСпособом.Количество() > 0);	
	

	Возврат СтруктураВозвращаемыхПараметров;
	
КонецФункции // ПолучитьНаборДанныхНачисление()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	вычету НДС по приобретенным ценностям
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхВычетПоПриобретеннымЦенностям(Запрос)
	
	Если ИдентификаторКонфигурации = "БП" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставКнигиПокупок.СчетФактура КАК ДокументРегистратор,
		|	СоставКнигиПокупок.СтавкаНДС,
		|	СоставКнигиПокупок.СуммаБезНДСОборот,
		|	СоставКнигиПокупок.НДСОборот
		|ПОМЕСТИТЬ ВТСоставКнигиПокупок
		|ИЗ
		|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
		|			&НачалоПериода,
		|			&КонецПериодаГраница,
		|			,
		|			Организация В (&Организация)
		|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе, &ВидыЦенностейНалоговыйАгент))
		|				И Событие <> ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСКВычету0)) КАК СоставКнигиПокупок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументРегистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслугТовары.Номенклатура) КАК НоменклатураКоличество
		|ПОМЕСТИТЬ ТаблицаПоступившихТоваров
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка.Организация В(&Организация)
		|	И ПоступлениеТоваровУслугТовары.Номенклатура <> &ПустаяНоменклатура
		|	И ПоступлениеТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
		|	И ПоступлениеТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
		|	И ПоступлениеТоваровУслугТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТСоставКнигиПокупок.ДокументРегистратор
		|			ИЗ
		|				ВТСоставКнигиПокупок)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугТовары.Номенклатура,
		|	ПоступлениеТоваровУслугТовары.СтавкаНДС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) КАК НоменклатураКоличество
		|ПОМЕСТИТЬ СписокПоступившихТоваров
		|ИЗ
		|	ТаблицаПоступившихТоваров КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) > 1
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслугУслуги.Номенклатура) КАК НоменклатураКоличество
		|ПОМЕСТИТЬ ТаблицаПоступившихУслуг
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|ГДЕ
		|	ПоступлениеТоваровУслугУслуги.Ссылка.Организация В(&Организация)
		|	И ПоступлениеТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
		|	И ПоступлениеТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
		|	И ПоступлениеТоваровУслугУслуги.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТСоставКнигиПокупок.ДокументРегистратор
		|			ИЗ
		|				ВТСоставКнигиПокупок)
		|	И ПоступлениеТоваровУслугУслуги.Номенклатура <> &ПустаяНоменклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугУслуги.Номенклатура,
		|	ПоступлениеТоваровУслугУслуги.СтавкаНДС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) КАК НоменклатураКоличество
		|ПОМЕСТИТЬ СписокПоступившихУслуг
		|ИЗ
		|	ТаблицаПоступившихУслуг КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) > 1
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТовары.Ссылка КАК Ссылка,
		|	ПоступлениеТовары.СтавкаНДС
		|ПОМЕСТИТЬ ВТОперацииСОшибками
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТовары
		|ГДЕ
		|	ПоступлениеТовары.Ссылка.Организация В(&Организация)
		|	И ПоступлениеТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
		|	И ПоступлениеТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
		|	И ПоступлениеТовары.Номенклатура В
		|			(ВЫБРАТЬ
		|				СписокНоменклатуры.Номенклатура
		|			ИЗ
		|				СписокПоступившихТоваров КАК СписокНоменклатуры)
		|	И ПоступлениеТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТСоставКнигиПокупок.ДокументРегистратор
		|			ИЗ
		|				ВТСоставКнигиПокупок)
		|	И ПоступлениеТовары.Номенклатура <> &ПустаяНоменклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТоваровУслугУслуги.Ссылка,
		|	ПоступлениеТоваровУслугУслуги.СтавкаНДС
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|ГДЕ
		|	ПоступлениеТоваровУслугУслуги.Ссылка.Организация В(&Организация)
		|	И ПоступлениеТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
		|	И ПоступлениеТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
		|	И ПоступлениеТоваровУслугУслуги.Номенклатура В
		|			(ВЫБРАТЬ
		|				СписокНоменклатуры.Номенклатура
		|			ИЗ
		|				СписокПоступившихУслуг КАК СписокНоменклатуры)
		|	И ПоступлениеТоваровУслугУслуги.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТСоставКнигиПокупок.ДокументРегистратор
		|			ИЗ
		|				ВТСоставКнигиПокупок)
		|	И ПоступлениеТоваровУслугУслуги.Номенклатура <> &ПустаяНоменклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСоставКнигиПокупок.ДокументРегистратор,
		|	ВТСоставКнигиПокупок.СтавкаНДС,
		|	ВТСоставКнигиПокупок.СуммаБезНДСОборот КАК Сумма,
		|	ВТСоставКнигиПокупок.НДСОборот КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ВТОперацииСОшибками.Ссылка ЕСТЬ NULL 
		|			ТОГДА &ТекстБезОшибок
		|		ИНАЧЕ &ТекстОшибкаПоступлениеПоРазнымСтавкам
		|	КОНЕЦ КАК ПризнакНаличияОшибок,
		|	ВЫБОР
		|		КОГДА ВТОперацииСОшибками.Ссылка ЕСТЬ NULL 
		|			ТОГДА &ТекстНетСноски
		|		ИНАЧЕ &ТекстСноска
		|	КОНЕЦ КАК СимволСноски,
		|	СчетФактураПолученныйДокументыОснования.Ссылка КАК СчетФактура,
		|	&ТекстОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
		|	1 КАК КоличествоДокументов,
		|	ВЫБОР
		|		КОГДА ВТСоставКнигиПокупок.ДокументРегистратор ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ ВТСоставКнигиПокупок.ДокументРегистратор ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ ВТСоставКнигиПокупок.ДокументРегистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА ВТСоставКнигиПокупок.ДокументРегистратор.Номер
		|		КОГДА ВТСоставКнигиПокупок.ДокументРегистратор.ПредъявленСчетФактура
		|			ТОГДА ВТСоставКнигиПокупок.ДокументРегистратор.НомерВходящегоСчетаФактуры
		|		КОГДА ВТСоставКнигиПокупок.ДокументРегистратор ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Номер)
		|	КОНЕЦ КАК НомерВходящегоДокумента,
		|	ВЫБОР
		|		КОГДА ВТСоставКнигиПокупок.ДокументРегистратор ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ ВТСоставКнигиПокупок.ДокументРегистратор ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ ВТСоставКнигиПокупок.ДокументРегистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА ВТСоставКнигиПокупок.ДокументРегистратор.Дата
		|		КОГДА ВТСоставКнигиПокупок.ДокументРегистратор.ПредъявленСчетФактура
		|			ТОГДА ВТСоставКнигиПокупок.ДокументРегистратор.ДатаВходящегоСчетаФактуры
		|		КОГДА ВТСоставКнигиПокупок.ДокументРегистратор ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Дата)
		|	КОНЕЦ КАК ДатаВходящегоДокумента,
		|	ВЫБОР
		|		КОГДА ВТОперацииСОшибками.Ссылка ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоличествоОшибок
		|ИЗ
		|	ВТСоставКнигиПокупок КАК ВТСоставКнигиПокупок
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОперацииСОшибками КАК ВТОперацииСОшибками
		|		ПО ВТСоставКнигиПокупок.ДокументРегистратор = ВТОперацииСОшибками.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ПО ВТСоставКнигиПокупок.ДокументРегистратор = СчетФактураПолученныйДокументыОснования.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО ВТСоставКнигиПокупок.ДокументРегистратор = СчетФактураВыданныйДокументыОснования.ДокументОснование";
	
		ВычетПоПриобретеннымЦенностямВключенные = Запрос.Выполнить().Выгрузить();
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставКнигиПокупок.СчетФактура КАК ДокументРегистратор,
		|	СоставКнигиПокупок.СтавкаНДС,
		|	СоставКнигиПокупок.СуммаБезНДСОборот,
		|	СоставКнигиПокупок.НДСОборот
		|ПОМЕСТИТЬ ВТСоставКнигиПокупок
		|ИЗ
		|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
		|			&НачалоПериода,
		|			&КонецПериодаГраница,
		|			,
		|			Организация В (&Организация)
		|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе, &ВидыЦенностейНалоговыйАгент))
		|				И Событие <> ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСКВычету0)) КАК СоставКнигиПокупок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументРегистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслугТовары.Номенклатура) КАК НоменклатураКоличество
		|ПОМЕСТИТЬ ТаблицаПоступившихТоваров
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка.Организация В(&Организация)
		|	И ПоступлениеТоваровУслугТовары.Номенклатура <> &ПустаяНоменклатура
		|	И ПоступлениеТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
		|	И ПоступлениеТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
		|	И ПоступлениеТоваровУслугТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТСоставКнигиПокупок.ДокументРегистратор
		|			ИЗ
		|				ВТСоставКнигиПокупок)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугТовары.Номенклатура,
		|	ПоступлениеТоваровУслугТовары.СтавкаНДС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) КАК НоменклатураКоличество
		|ПОМЕСТИТЬ СписокПоступившихТоваров
		|ИЗ
		|	ТаблицаПоступившихТоваров КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) > 1
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
		|	ПоступлениеТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслугУслуги.Номенклатура) КАК НоменклатураКоличество
		|ПОМЕСТИТЬ ТаблицаПоступившихУслуг
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|ГДЕ
		|	ПоступлениеТоваровУслугУслуги.Ссылка.Организация В(&Организация)
		|	И ПоступлениеТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
		|	И ПоступлениеТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
		|	И ПоступлениеТоваровУслугУслуги.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТСоставКнигиПокупок.ДокументРегистратор
		|			ИЗ
		|				ВТСоставКнигиПокупок)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугУслуги.Номенклатура,
		|	ПоступлениеТоваровУслугУслуги.СтавкаНДС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) КАК НоменклатураКоличество
		|ПОМЕСТИТЬ СписокПоступившихУслуг
		|ИЗ
		|	ТаблицаПоступившихУслуг КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) > 1
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТовары.Ссылка КАК Ссылка,
		|	ПоступлениеТовары.СтавкаНДС
		|ПОМЕСТИТЬ ВТОперацииСОшибками
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТовары
		|ГДЕ
		|	ПоступлениеТовары.Ссылка.Организация В(&Организация)
		|	И ПоступлениеТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
		|	И ПоступлениеТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
		|	И ПоступлениеТовары.Номенклатура В
		|			(ВЫБРАТЬ
		|				СписокНоменклатуры.Номенклатура
		|			ИЗ
		|				СписокПоступившихТоваров КАК СписокНоменклатуры)
		|	И ПоступлениеТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТСоставКнигиПокупок.ДокументРегистратор
		|			ИЗ
		|				ВТСоставКнигиПокупок)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТоваровУслугУслуги.Ссылка,
		|	ПоступлениеТоваровУслугУслуги.СтавкаНДС
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|ГДЕ
		|	ПоступлениеТоваровУслугУслуги.Ссылка.Организация В(&Организация)
		|	И ПоступлениеТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
		|	И ПоступлениеТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
		|	И ПоступлениеТоваровУслугУслуги.Номенклатура В
		|			(ВЫБРАТЬ
		|				СписокНоменклатуры.Номенклатура
		|			ИЗ
		|				СписокПоступившихУслуг КАК СписокНоменклатуры)
		|	И ПоступлениеТоваровУслугУслуги.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТСоставКнигиПокупок.ДокументРегистратор
		|			ИЗ
		|				ВТСоставКнигиПокупок)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСоставКнигиПокупок.ДокументРегистратор,
		|	ВТСоставКнигиПокупок.СтавкаНДС,
		|	ВТСоставКнигиПокупок.СуммаБезНДСОборот КАК Сумма,
		|	ВТСоставКнигиПокупок.НДСОборот КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ВТОперацииСОшибками.Ссылка ЕСТЬ NULL 
		|			ТОГДА &ТекстБезОшибок
		|		ИНАЧЕ &ТекстОшибкаПоступлениеПоРазнымСтавкам
		|	КОНЕЦ КАК ПризнакНаличияОшибок,
		|	ВЫБОР
		|		КОГДА ВТОперацииСОшибками.Ссылка ЕСТЬ NULL 
		|			ТОГДА &ТекстНетСноски
		|		ИНАЧЕ &ТекстСноска
		|	КОНЕЦ КАК СимволСноски,
		|	СчетФактураПолученныйДокументыОснования.Ссылка КАК СчетФактура,
		|	&ТекстОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
		|	1 КАК КоличествоДокументов,
		|	ВЫБОР
		|		КОГДА ВТСоставКнигиПокупок.ДокументРегистратор ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ ВТСоставКнигиПокупок.ДокументРегистратор ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ ВТСоставКнигиПокупок.ДокументРегистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА ВТСоставКнигиПокупок.ДокументРегистратор.Номер
		|		КОГДА ВТСоставКнигиПокупок.ДокументРегистратор ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Номер)
		|	КОНЕЦ КАК НомерВходящегоДокумента,
		|	ВЫБОР
		|		КОГДА ВТСоставКнигиПокупок.ДокументРегистратор ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ ВТСоставКнигиПокупок.ДокументРегистратор ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ ВТСоставКнигиПокупок.ДокументРегистратор ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА ВТСоставКнигиПокупок.ДокументРегистратор.Дата
		|		КОГДА ВТСоставКнигиПокупок.ДокументРегистратор ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Дата)
		|	КОНЕЦ КАК ДатаВходящегоДокумента,
		|	ВЫБОР
		|		КОГДА ВТОперацииСОшибками.Ссылка ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоличествоОшибок
		|ИЗ
		|	ВТСоставКнигиПокупок КАК ВТСоставКнигиПокупок
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОперацииСОшибками КАК ВТОперацииСОшибками
		|		ПО ВТСоставКнигиПокупок.ДокументРегистратор = ВТОперацииСОшибками.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ПО ВТСоставКнигиПокупок.ДокументРегистратор = СчетФактураПолученныйДокументыОснования.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО ВТСоставКнигиПокупок.ДокументРегистратор = СчетФактураВыданныйДокументыОснования.ДокументОснование";
	
		ВычетПоПриобретеннымЦенностямВключенные = Запрос.Выполнить().Выгрузить();
			
	КонецЕсли;	
		
	Если ИдентификаторКонфигурации = "БП" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НДСПредъявленныйОстатки.СчетФактура КАК СчетФактура,
		|	НДСПредъявленныйОстатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСПредъявленныйОстатки.ВидЦенности КАК ВидЦенности,
		|	НДСПредъявленныйОстатки.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток,
		|	НДСПредъявленныйОстатки.НДСОстаток
		|ПОМЕСТИТЬ НДСПредъявленныйОстаткиПоПриобретеннымЦенностям
		|ИЗ
		|	РегистрНакопления.НДСПредъявленный.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе))) КАК НДСПредъявленныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	ВидЦенности,
		|	СтавкаНДС,
		|	СчетУчетаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСпоОСиНМАОстатки.СчетФактура КАК СчетФактура,
		|	НДСпоОСиНМАОстатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСпоОСиНМАОстатки.ВидЦенности КАК ВидЦенности,
		|	НДСпоОСиНМАОстатки.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСпоОСиНМАОстатки.СуммаБезНДСОстаток,
		|	НДСпоОСиНМАОстатки.НДСОстаток
		|ПОМЕСТИТЬ НДСпоОСиНМАОстаткиПоПриобретеннымЦенностям
		|ИЗ
		|	РегистрНакопления.НДСпоОСиНМА.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И НДСВключенВСтоимость = ЛОЖЬ
		|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе))) КАК НДСпоОСиНМАОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	ВидЦенности,
		|	СтавкаНДС,
		|	СчетУчетаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСПредъявленныйРеализация0Остатки.СчетФактура КАК СчетФактура,
		|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСПредъявленныйРеализация0Остатки.ВидЦенности КАК ВидЦенности,
		|	НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток,
		|	НДСПредъявленныйРеализация0Остатки.НДСОстаток
		|ПОМЕСТИТЬ НДСПредъявленныйРеализация0ОстаткиПоПриобретеннымЦенностям
		|ИЗ
		|	РегистрНакопления.НДСПредъявленныйРеализация0.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе))) КАК НДСПредъявленныйРеализация0Остатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	ВидЦенности,
		|	СтавкаНДС,
		|	СчетУчетаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСПредъявленныйОстатки.СчетФактура КАК ДокументРегистратор,
		|	НДСПредъявленныйОстатки.СтавкаНДС,
		|	СУММА(ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0)) КАК Сумма,
		|	СУММА(ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0)) КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.НДСОстаток, 0) = 0
		|				И НДСПредъявленныйОстатки.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС)
		|			ТОГДА &ТекстОбъектНеПринятКУчету
		|		КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.НДСОстаток, 0) = 0
		|				И НДСПредъявленныйОстатки.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.СМРСобственнымиСилами)
		|			ТОГДА &ТекстОбъектНеПринятКУчетуОбъектСтроительства
		|		КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0) = 0
		|			ТОГДА &ТекстНеПодтвержденаСтавка
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВЫБОР
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|								ТОГДА НДСПредъявленныйОстатки.СчетФактура
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|								ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка
		|							ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка, СчетФактураВыданныйДокументыОснования.Ссылка)
		|						КОНЕЦ ЕСТЬ NULL 
		|						ИЛИ ВЫБОР
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|								ТОГДА ЛОЖЬ
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|								ТОГДА ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, &НачалоСледующегоПериода) > &КонецПериода
		|							ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Дата), &НачалоСледующегоПериода) > &КонецПериода
		|						КОНЕЦ
		|					ТОГДА &ТекстОтсутствуетСФПолученный
		|				КОГДА (НЕ ВЫБОР
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|								ТОГДА НДСПредъявленныйОстатки.СчетФактура.Проведен
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|								ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
		|							ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.Проведен, СчетФактураВыданныйДокументыОснования.Ссылка.Проведен)
		|						КОНЕЦ)
		|					ТОГДА &ТекстСФПолученныйНеПроведен
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) > 0
		|							ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
		|						ИНАЧЕ &ТекстКорректировкаКнигиПокупок
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ПризнакНаличияОшибок,
		|	&ТекстНеОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
		|	1 КАК КоличествоДокументов,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка, СчетФактураВыданныйДокументыОснования.Ссылка)
		|	КОНЕЦ КАК СчетФактура,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура.Номер
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура.НомерВходящегоСчетаФактуры
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Номер)
		|	КОНЕЦ КАК НомерВходящегоДокумента,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура.Дата
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура.ДатаВходящегоСчетаФактуры
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Дата)
		|	КОНЕЦ КАК ДатаВходящегоДокумента
		|ИЗ
		|	НДСПредъявленныйОстаткиПоПриобретеннымЦенностям КАК НДСПредъявленныйОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ НДСпоОСиНМАОстаткиПоПриобретеннымЦенностям КАК НДСпоОСиНМАОстатки
		|		ПО НДСПредъявленныйОстатки.СчетФактура = НДСпоОСиНМАОстатки.СчетФактура
		|			И НДСПредъявленныйОстатки.ВидЦенности = НДСпоОСиНМАОстатки.ВидЦенности
		|			И НДСПредъявленныйОстатки.СтавкаНДС = НДСпоОСиНМАОстатки.СтавкаНДС
		|			И НДСПредъявленныйОстатки.СчетУчетаНДС = НДСпоОСиНМАОстатки.СчетУчетаНДС
		|			И (НДСпоОСиНМАОстатки.СуммаБезНДСОстаток + НДСпоОСиНМАОстатки.НДСОстаток > 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ НДСПредъявленныйРеализация0ОстаткиПоПриобретеннымЦенностям КАК НДСПредъявленныйРеализация0Остатки
		|		ПО НДСПредъявленныйОстатки.СчетФактура = НДСПредъявленныйРеализация0Остатки.СчетФактура
		|			И НДСПредъявленныйОстатки.ВидЦенности = НДСПредъявленныйРеализация0Остатки.ВидЦенности
		|			И НДСПредъявленныйОстатки.СтавкаНДС = НДСПредъявленныйРеализация0Остатки.СтавкаНДС
		|			И НДСПредъявленныйОстатки.СчетУчетаНДС = НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС
		|			И (НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток + НДСПредъявленныйРеализация0Остатки.НДСОстаток > 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ПО (НДСПредъявленныйОстатки.СчетФактура = СчетФактураПолученныйДокументыОснования.ДокументОснование
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура = СчетФактураПолученныйДокументыОснования.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО (НДСПредъявленныйОстатки.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура = СчетФактураВыданныйДокументыОснования.Ссылка)
		|			И (СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаРеализацию))
		|ГДЕ
		|	(НДСПредъявленныйОстатки.СуммаБезНДСОстаток > 0
		|			ИЛИ НДСПредъявленныйОстатки.НДСОстаток > 0)
		|	И ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0) > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	НДСПредъявленныйОстатки.СчетФактура,
		|	НДСПредъявленныйОстатки.СтавкаНДС,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка, СчетФактураВыданныйДокументыОснования.Ссылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура.Номер
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура.НомерВходящегоСчетаФактуры
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Номер)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура.Дата
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура.ДатаВходящегоСчетаФактуры
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Дата)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.НДСОстаток, 0) = 0
		|				И НДСПредъявленныйОстатки.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС)
		|			ТОГДА &ТекстОбъектНеПринятКУчету
		|		КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.НДСОстаток, 0) = 0
		|				И НДСПредъявленныйОстатки.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.СМРСобственнымиСилами)
		|			ТОГДА &ТекстОбъектНеПринятКУчетуОбъектСтроительства
		|		КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0) = 0
		|			ТОГДА &ТекстНеПодтвержденаСтавка
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВЫБОР
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|								ТОГДА НДСПредъявленныйОстатки.СчетФактура
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|								ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка
		|							ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка, СчетФактураВыданныйДокументыОснования.Ссылка)
		|						КОНЕЦ ЕСТЬ NULL 
		|						ИЛИ ВЫБОР
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|								ТОГДА ЛОЖЬ
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|								ТОГДА ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, &НачалоСледующегоПериода) > &КонецПериода
		|							ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Дата), &НачалоСледующегоПериода) > &КонецПериода
		|						КОНЕЦ
		|					ТОГДА &ТекстОтсутствуетСФПолученный
		|				КОГДА (НЕ ВЫБОР
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|								ТОГДА НДСПредъявленныйОстатки.СчетФактура.Проведен
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|								ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
		|							ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.Проведен, СчетФактураВыданныйДокументыОснования.Ссылка.Проведен)
		|						КОНЕЦ)
		|					ТОГДА &ТекстСФПолученныйНеПроведен
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) > 0
		|							ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
		|						ИНАЧЕ &ТекстКорректировкаКнигиПокупок
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ";
				
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НДСПредъявленныйОстатки.СчетФактура КАК СчетФактура,
		|	НДСПредъявленныйОстатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСПредъявленныйОстатки.ВидЦенности КАК ВидЦенности,
		|	НДСПредъявленныйОстатки.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток,
		|	НДСПредъявленныйОстатки.НДСОстаток
		|ПОМЕСТИТЬ НДСПредъявленныйОстаткиПоПриобретеннымЦенностям
		|ИЗ
		|	РегистрНакопления.НДСПредъявленный.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе))) КАК НДСПредъявленныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	ВидЦенности,
		|	СтавкаНДС,
		|	СчетУчетаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСпоОСиНМАОстатки.СчетФактура КАК СчетФактура,
		|	НДСпоОСиНМАОстатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСпоОСиНМАОстатки.ВидЦенности КАК ВидЦенности,
		|	НДСпоОСиНМАОстатки.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСпоОСиНМАОстатки.СуммаБезНДСОстаток,
		|	НДСпоОСиНМАОстатки.НДСОстаток
		|ПОМЕСТИТЬ НДСпоОСиНМАОстаткиПоПриобретеннымЦенностям
		|ИЗ
		|	РегистрНакопления.НДСпоОСиНМА.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И НДСВключенВСтоимость = ЛОЖЬ
		|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе))) КАК НДСпоОСиНМАОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	ВидЦенности,
		|	СтавкаНДС,
		|	СчетУчетаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСПредъявленныйРеализация0Остатки.СчетФактура КАК СчетФактура,
		|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСПредъявленныйРеализация0Остатки.ВидЦенности КАК ВидЦенности,
		|	НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток,
		|	НДСПредъявленныйРеализация0Остатки.НДСОстаток
		|ПОМЕСТИТЬ НДСПредъявленныйРеализация0ОстаткиПоПриобретеннымЦенностям
		|ИЗ
		|	РегистрНакопления.НДСПредъявленныйРеализация0.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе))) КАК НДСПредъявленныйРеализация0Остатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	ВидЦенности,
		|	СтавкаНДС,
		|	СчетУчетаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСПредъявленныйОстатки.СчетФактура КАК ДокументРегистратор,
		|	НДСПредъявленныйОстатки.СтавкаНДС,
		|	СУММА(ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0)) КАК Сумма,
		|	СУММА(ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0)) КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.НДСОстаток, 0) = 0
		|				И НДСПредъявленныйОстатки.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС)
		|			ТОГДА &ТекстОбъектНеПринятКУчету
		|		КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.НДСОстаток, 0) = 0
		|				И НДСПредъявленныйОстатки.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.СМРСобственнымиСилами)
		|			ТОГДА &ТекстОбъектНеПринятКУчетуОбъектСтроительства
		|		КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0) = 0
		|			ТОГДА &ТекстНеПодтвержденаСтавка
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВЫБОР
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|								ТОГДА НДСПредъявленныйОстатки.СчетФактура
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|								ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка
		|							ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка, СчетФактураВыданныйДокументыОснования.Ссылка)
		|						КОНЕЦ ЕСТЬ NULL 
		|						ИЛИ ВЫБОР
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|								ТОГДА ЛОЖЬ
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|								ТОГДА ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, &НачалоСледующегоПериода) > &КонецПериода
		|							ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Дата), &НачалоСледующегоПериода) > &КонецПериода
		|						КОНЕЦ
		|					ТОГДА &ТекстОтсутствуетСФПолученный
		|				КОГДА (НЕ ВЫБОР
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|								ТОГДА НДСПредъявленныйОстатки.СчетФактура.Проведен
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|								ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
		|							ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.Проведен, СчетФактураВыданныйДокументыОснования.Ссылка.Проведен)
		|						КОНЕЦ)
		|					ТОГДА &ТекстСФПолученныйНеПроведен
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) > 0
		|							ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
		|						ИНАЧЕ &ТекстКорректировкаКнигиПокупок
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ПризнакНаличияОшибок,
		|	&ТекстНеОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
		|	1 КАК КоличествоДокументов,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка, СчетФактураВыданныйДокументыОснования.Ссылка)
		|	КОНЕЦ КАК СчетФактура,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура.Номер
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Номер)
		|	КОНЕЦ КАК НомерВходящегоДокумента,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура.Дата
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Дата)
		|	КОНЕЦ КАК ДатаВходящегоДокумента
		|ИЗ
		|	НДСПредъявленныйОстаткиПоПриобретеннымЦенностям КАК НДСПредъявленныйОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ НДСпоОСиНМАОстаткиПоПриобретеннымЦенностям КАК НДСпоОСиНМАОстатки
		|		ПО НДСПредъявленныйОстатки.СчетФактура = НДСпоОСиНМАОстатки.СчетФактура
		|			И НДСПредъявленныйОстатки.ВидЦенности = НДСпоОСиНМАОстатки.ВидЦенности
		|			И НДСПредъявленныйОстатки.СтавкаНДС = НДСпоОСиНМАОстатки.СтавкаНДС
		|			И НДСПредъявленныйОстатки.СчетУчетаНДС = НДСпоОСиНМАОстатки.СчетУчетаНДС
		|			И (НДСпоОСиНМАОстатки.СуммаБезНДСОстаток + НДСпоОСиНМАОстатки.НДСОстаток > 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ НДСПредъявленныйРеализация0ОстаткиПоПриобретеннымЦенностям КАК НДСПредъявленныйРеализация0Остатки
		|		ПО НДСПредъявленныйОстатки.СчетФактура = НДСПредъявленныйРеализация0Остатки.СчетФактура
		|			И НДСПредъявленныйОстатки.ВидЦенности = НДСПредъявленныйРеализация0Остатки.ВидЦенности
		|			И НДСПредъявленныйОстатки.СтавкаНДС = НДСПредъявленныйРеализация0Остатки.СтавкаНДС
		|			И НДСПредъявленныйОстатки.СчетУчетаНДС = НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС
		|			И (НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток + НДСПредъявленныйРеализация0Остатки.НДСОстаток > 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ПО (НДСПредъявленныйОстатки.СчетФактура = СчетФактураПолученныйДокументыОснования.ДокументОснование
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура = СчетФактураПолученныйДокументыОснования.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО (НДСПредъявленныйОстатки.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура = СчетФактураВыданныйДокументыОснования.Ссылка)
		|			И (СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаРеализацию))
		|ГДЕ
		|	(НДСПредъявленныйОстатки.СуммаБезНДСОстаток > 0
		|			ИЛИ НДСПредъявленныйОстатки.НДСОстаток > 0)
		|	И ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0) > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	НДСПредъявленныйОстатки.СчетФактура,
		|	НДСПредъявленныйОстатки.СтавкаНДС,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка, СчетФактураВыданныйДокументыОснования.Ссылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура.Номер
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Номер)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура.Дата
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Дата)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.НДСОстаток, 0) = 0
		|				И НДСПредъявленныйОстатки.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОС)
		|			ТОГДА &ТекстОбъектНеПринятКУчету
		|		КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.НДСОстаток, 0) = 0
		|				И НДСПредъявленныйОстатки.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.СМРСобственнымиСилами)
		|			ТОГДА &ТекстОбъектНеПринятКУчетуОбъектСтроительства
		|		КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0) = 0
		|			ТОГДА &ТекстНеПодтвержденаСтавка
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВЫБОР
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|								ТОГДА НДСПредъявленныйОстатки.СчетФактура
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|								ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка
		|							ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка, СчетФактураВыданныйДокументыОснования.Ссылка)
		|						КОНЕЦ ЕСТЬ NULL 
		|						ИЛИ ВЫБОР
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|								ТОГДА ЛОЖЬ
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|								ТОГДА ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, &НачалоСледующегоПериода) > &КонецПериода
		|							ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Дата), &НачалоСледующегоПериода) > &КонецПериода
		|						КОНЕЦ
		|					ТОГДА &ТекстОтсутствуетСФПолученный
		|				КОГДА (НЕ ВЫБОР
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|									ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|								ТОГДА НДСПредъявленныйОстатки.СчетФактура.Проведен
		|							КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|								ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
		|							ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.Проведен, СчетФактураВыданныйДокументыОснования.Ссылка.Проведен)
		|						КОНЕЦ)
		|					ТОГДА &ТекстСФПолученныйНеПроведен
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) > 0
		|							ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
		|						ИНАЧЕ &ТекстКорректировкаКнигиПокупок
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ";	
		
	КонецЕсли;
		
	ВычетПоПриобретеннымЦенностямНеВключенныеРегламенты = Запрос.Выполнить().Выгрузить();

	Если ИдентификаторКонфигурации = "БП" Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НДСВключенныйВСтоимостьОбороты.СчетФактура КАК СчетФактура,
		|	НДСВключенныйВСтоимостьОбороты.СуммаБезНДСОборот,
		|	НДСВключенныйВСтоимостьОбороты.НДСОборот,
		|	НДСВключенныйВСтоимостьОбороты.СтавкаНДС
		|ПОМЕСТИТЬ ВТНДСВключенныйВСтоимость
		|ИЗ
		|	РегистрНакопления.НДСВключенныйВСтоимость.Обороты(, &КонецПериода, , Организация В (&Организация)) КАК НДСВключенныйВСтоимостьОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АвансовыйОтчет.Ссылка КАК ДокументРегистратор,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
		|	ВЫРАЗИТЬ(АвансовыйОтчет.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
		|	ВЫРАЗИТЬ(АвансовыйОтчет.СуммаДокумента - АвансовыйОтчет.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	1 КАК КоличествоДокументов,
		|	ВЫБОР
		|		КОГДА (НЕ АвансовыйОтчет.УчитыватьНДС)
		|			ТОГДА &ТекстНДСНеУчитывается
		|		ИНАЧЕ &ТекстНДСВключенВСтоимость
		|	КОНЕЦ КАК ПризнакНаличияОшибок,
		|	&ТекстНеОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС
		|ПОМЕСТИТЬ ВТДокументы
		|ИЗ
		|	Документ.АвансовыйОтчет КАК АвансовыйОтчет
		|ГДЕ
		|	((НЕ АвансовыйОтчет.УчитыватьНДС)
		|			ИЛИ АвансовыйОтчет.Ссылка В
		|				(ВЫБРАТЬ
		|					НДСВключенныйВСтоимость.СчетФактура
		|				ИЗ
		|					ВТНДСВключенныйВСтоимость КАК НДСВключенныйВСтоимость))
		|	И АвансовыйОтчет.Проведен
		|	И АвансовыйОтчет.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И АвансовыйОтчет.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателя.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ВозвратТоваровОтПокупателя.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ВозвратТоваровОтПокупателя.СуммаДокумента - ВозвратТоваровОтПокупателя.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	1,
		|	ВЫБОР
		|		КОГДА (НЕ ВозвратТоваровОтПокупателя.УчитыватьНДС)
		|			ТОГДА &ТекстНДСНеУчитывается
		|		ИНАЧЕ &ТекстНДСВключенВСтоимость
		|	КОНЕЦ,
		|	&ТекстНеОтраженыВКнигеПокупок
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
		|ГДЕ
		|	(НЕ ВозвратТоваровОтПокупателя.УчитыватьНДС)
		|	И ВозвратТоваровОтПокупателя.Проведен
		|	И ВозвратТоваровОтПокупателя.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВозвратТоваровОтПокупателя.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеДопРасходов.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ПоступлениеДопРасходов.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПоступлениеДопРасходов.СуммаДокумента - ПоступлениеДопРасходов.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	1,
		|	ВЫБОР
		|		КОГДА (НЕ ПоступлениеДопРасходов.УчитыватьНДС)
		|			ТОГДА &ТекстНДСНеУчитывается
		|		ИНАЧЕ &ТекстНДСВключенВСтоимость
		|	КОНЕЦ,
		|	&ТекстНеОтраженыВКнигеПокупок
		|ИЗ
		|	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
		|ГДЕ
		|	((НЕ ПоступлениеДопРасходов.УчитыватьНДС)
		|			ИЛИ ПоступлениеДопРасходов.Ссылка В
		|				(ВЫБРАТЬ
		|					НДСВключенныйВСтоимость.СчетФактура
		|				ИЗ
		|					ВТНДСВключенныйВСтоимость КАК НДСВключенныйВСтоимость))
		|	И ПоступлениеДопРасходов.Проведен
		|	И ПоступлениеДопРасходов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПоступлениеДопРасходов.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеНМА.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ПоступлениеНМА.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПоступлениеНМА.СуммаДокумента - ПоступлениеНМА.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	1,
		|	ВЫБОР
		|		КОГДА (НЕ ПоступлениеНМА.УчитыватьНДС)
		|			ТОГДА &ТекстНДСНеУчитывается
		|		ИНАЧЕ &ТекстНДСВключенВСтоимость
		|	КОНЕЦ,
		|	&ТекстНеОтраженыВКнигеПокупок
		|ИЗ
		|	Документ.ПоступлениеНМА КАК ПоступлениеНМА
		|ГДЕ
		|	((НЕ ПоступлениеНМА.УчитыватьНДС)
		|			ИЛИ ПоступлениеНМА.Ссылка В
		|				(ВЫБРАТЬ
		|					НДСВключенныйВСтоимость.СчетФактура
		|				ИЗ
		|					ВТНДСВключенныйВСтоимость КАК НДСВключенныйВСтоимость))
		|	И ПоступлениеНМА.Проведен
		|	И ПоступлениеНМА.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПоступлениеНМА.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ПоступлениеТоваровУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПоступлениеТоваровУслуг.СуммаДокумента - ПоступлениеТоваровУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	1,
		|	ВЫБОР
		|		КОГДА (НЕ ПоступлениеТоваровУслуг.УчитыватьНДС)
		|			ТОГДА &ТекстНДСНеУчитывается
		|		ИНАЧЕ &ТекстНДСВключенВСтоимость
		|	КОНЕЦ,
		|	&ТекстНеОтраженыВКнигеПокупок
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	((НЕ ПоступлениеТоваровУслуг.УчитыватьНДС)
		|			ИЛИ ПоступлениеТоваровУслуг.Ссылка В
		|				(ВЫБРАТЬ
		|					НДСВключенныйВСтоимость.СчетФактура
		|				ИЗ
		|					ВТНДСВключенныйВСтоимость КАК НДСВключенныйВСтоимость))
		|	И ПоступлениеТоваровУслуг.Проведен
		|	И ПоступлениеТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПоступлениеТоваровУслуг.Организация В(&Организация)
		|	И ПоступлениеТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеИзПереработки.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ПоступлениеИзПереработки.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПоступлениеИзПереработки.СуммаДокумента - ПоступлениеИзПереработки.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	1,
		|	ВЫБОР
		|		КОГДА (НЕ ПоступлениеИзПереработки.УчитыватьНДС)
		|			ТОГДА &ТекстНДСНеУчитывается
		|		ИНАЧЕ &ТекстНДСВключенВСтоимость
		|	КОНЕЦ,
		|	&ТекстНеОтраженыВКнигеПокупок
		|ИЗ
		|	Документ.ПоступлениеИзПереработки КАК ПоступлениеИзПереработки
		|ГДЕ
		|	((НЕ ПоступлениеИзПереработки.УчитыватьНДС)
		|			ИЛИ ПоступлениеИзПереработки.Ссылка В
		|				(ВЫБРАТЬ
		|					НДСВключенныйВСтоимость.СчетФактура
		|				ИЗ
		|					ВТНДСВключенныйВСтоимость КАК НДСВключенныйВСтоимость))
		|	И ПоступлениеИзПереработки.Проведен
		|	И ПоступлениеИзПереработки.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПоступлениеИзПереработки.Организация В(&Организация)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументРегистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДокументы.ДокументРегистратор КАК ДокументРегистратор,
		|	ЕСТЬNULL(ВТНДСВключенныйВСтоимость.СтавкаНДС, ВТДокументы.СтавкаНДС) КАК СтавкаНДС,
		|	ЕСТЬNULL(ВТНДСВключенныйВСтоимость.НДСОборот, ВТДокументы.СуммаНДС) КАК СуммаНДС,
		|	ЕСТЬNULL(ВТНДСВключенныйВСтоимость.СуммаБезНДСОборот, ВТДокументы.Сумма) КАК Сумма,
		|	ВТДокументы.КоличествоДокументов КАК КоличествоДокументов,
		|	ВТДокументы.ПризнакНаличияОшибок,
		|	ВТДокументы.ПризнакОтраженияНДС КАК ПризнакОтраженияНДС,
		|	СчетФактураПолученный.Ссылка КАК СчетФактура,
		|	СчетФактураПолученный.Ссылка.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	СчетФактураПолученный.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента
		|ИЗ
		|	ВТДокументы КАК ВТДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСВключенныйВСтоимость КАК ВТНДСВключенныйВСтоимость
		|		ПО ВТДокументы.ДокументРегистратор = ВТНДСВключенныйВСтоимость.СчетФактура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученный
		|		ПО (СчетФактураПолученный.ДокументОснование = ВТДокументы.ДокументРегистратор)";
			
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НДСВключенныйВСтоимостьОбороты.СчетФактура КАК СчетФактура,
		|	НДСВключенныйВСтоимостьОбороты.НДСОборот,
		|	НДСВключенныйВСтоимостьОбороты.СуммаБезНДСОборот,
		|	НДСВключенныйВСтоимостьОбороты.СтавкаНДС
		|ПОМЕСТИТЬ ВТНДСВключенныйВСтоимость
		|ИЗ
		|	РегистрНакопления.НДСВключенныйВСтоимость.Обороты(, &КонецПериода, , Организация В (&Организация)) КАК НДСВключенныйВСтоимостьОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АвансовыйОтчет.Ссылка КАК ДокументРегистратор,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
		|	ВЫРАЗИТЬ(АвансовыйОтчет.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
		|	ВЫРАЗИТЬ(АвансовыйОтчет.СуммаДокумента - АвансовыйОтчет.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	1 КАК КоличествоДокументов,
		|	ВЫБОР
		|		КОГДА (НЕ АвансовыйОтчет.УчитыватьНДС)
		|			ТОГДА &ТекстНДСНеУчитывается
		|		ИНАЧЕ &ТекстНДСВключенВСтоимость
		|	КОНЕЦ КАК ПризнакНаличияОшибок,
		|	&ТекстНеОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС
		|ПОМЕСТИТЬ ВТДокументы
		|ИЗ
		|	Документ.АвансовыйОтчет КАК АвансовыйОтчет
		|ГДЕ
		|	((НЕ АвансовыйОтчет.УчитыватьНДС)
		|			ИЛИ АвансовыйОтчет.Ссылка В
		|				(ВЫБРАТЬ
		|					НДСВключенныйВСтоимость.СчетФактура
		|				ИЗ
		|					ВТНДСВключенныйВСтоимость КАК НДСВключенныйВСтоимость))
		|	И АвансовыйОтчет.Проведен
		|	И АвансовыйОтчет.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И АвансовыйОтчет.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателя.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ВозвратТоваровОтПокупателя.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ВозвратТоваровОтПокупателя.СуммаДокумента - ВозвратТоваровОтПокупателя.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	1,
		|	ВЫБОР
		|		КОГДА (НЕ ВозвратТоваровОтПокупателя.УчитыватьНДС)
		|			ТОГДА &ТекстНДСНеУчитывается
		|		ИНАЧЕ &ТекстНДСВключенВСтоимость
		|	КОНЕЦ,
		|	&ТекстНеОтраженыВКнигеПокупок
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
		|ГДЕ
		|	(НЕ ВозвратТоваровОтПокупателя.УчитыватьНДС)
		|	И ВозвратТоваровОтПокупателя.Проведен
		|	И ВозвратТоваровОтПокупателя.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВозвратТоваровОтПокупателя.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеДопРасходов.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ПоступлениеДопРасходов.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПоступлениеДопРасходов.СуммаДокумента - ПоступлениеДопРасходов.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	1,
		|	ВЫБОР
		|		КОГДА (НЕ ПоступлениеДопРасходов.УчитыватьНДС)
		|			ТОГДА &ТекстНДСНеУчитывается
		|		ИНАЧЕ &ТекстНДСВключенВСтоимость
		|	КОНЕЦ,
		|	&ТекстНеОтраженыВКнигеПокупок
		|ИЗ
		|	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
		|ГДЕ
		|	((НЕ ПоступлениеДопРасходов.УчитыватьНДС)
		|			ИЛИ ПоступлениеДопРасходов.Ссылка В
		|				(ВЫБРАТЬ
		|					НДСВключенныйВСтоимость.СчетФактура
		|				ИЗ
		|					ВТНДСВключенныйВСтоимость КАК НДСВключенныйВСтоимость))
		|	И ПоступлениеДопРасходов.Проведен
		|	И ПоступлениеДопРасходов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПоступлениеДопРасходов.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеНМА.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ПоступлениеНМА.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПоступлениеНМА.СуммаДокумента - ПоступлениеНМА.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	1,
		|	ВЫБОР
		|		КОГДА (НЕ ПоступлениеНМА.УчитыватьНДС)
		|			ТОГДА &ТекстНДСНеУчитывается
		|		ИНАЧЕ &ТекстНДСВключенВСтоимость
		|	КОНЕЦ,
		|	&ТекстНеОтраженыВКнигеПокупок
		|ИЗ
		|	Документ.ПоступлениеНМА КАК ПоступлениеНМА
		|ГДЕ
		|	((НЕ ПоступлениеНМА.УчитыватьНДС)
		|			ИЛИ ПоступлениеНМА.Ссылка В
		|				(ВЫБРАТЬ
		|					НДСВключенныйВСтоимость.СчетФактура
		|				ИЗ
		|					ВТНДСВключенныйВСтоимость КАК НДСВключенныйВСтоимость))
		|	И ПоступлениеНМА.Проведен
		|	И ПоступлениеНМА.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПоступлениеНМА.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ПоступлениеТоваровУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПоступлениеТоваровУслуг.СуммаДокумента - ПоступлениеТоваровУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	1,
		|	ВЫБОР
		|		КОГДА (НЕ ПоступлениеТоваровУслуг.УчитыватьНДС)
		|			ТОГДА &ТекстНДСНеУчитывается
		|		ИНАЧЕ &ТекстНДСВключенВСтоимость
		|	КОНЕЦ,
		|	&ТекстНеОтраженыВКнигеПокупок
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	((НЕ ПоступлениеТоваровУслуг.УчитыватьНДС)
		|			ИЛИ ПоступлениеТоваровУслуг.Ссылка В
		|				(ВЫБРАТЬ
		|					НДСВключенныйВСтоимость.СчетФактура
		|				ИЗ
		|					ВТНДСВключенныйВСтоимость КАК НДСВключенныйВСтоимость))
		|	И ПоступлениеТоваровУслуг.Проведен
		|	И ПоступлениеТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПоступлениеТоваровУслуг.Организация В(&Организация)
		|	И ПоступлениеТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументРегистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДокументы.ДокументРегистратор КАК ДокументРегистратор,
		|	ЕСТЬNULL(ВТНДСВключенныйВСтоимость.СтавкаНДС, ВТДокументы.СтавкаНДС) КАК СтавкаНДС,
		|	ЕСТЬNULL(ВТНДСВключенныйВСтоимость.НДСОборот, ВТДокументы.СуммаНДС) КАК СуммаНДС,
		|	ЕСТЬNULL(ВТНДСВключенныйВСтоимость.СуммаБезНДСОборот, ВТДокументы.Сумма) КАК Сумма,
		|	ВТДокументы.КоличествоДокументов КАК КоличествоДокументов,
		|	ВТДокументы.ПризнакНаличияОшибок,
		|	ВТДокументы.ПризнакОтраженияНДС КАК ПризнакОтраженияНДС,
		|	СчетФактураПолученный.Ссылка КАК СчетФактура,
		|	СчетФактураПолученный.Ссылка.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	СчетФактураПолученный.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента
		|ИЗ
		|	ВТДокументы КАК ВТДокументы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСВключенныйВСтоимость КАК ВТНДСВключенныйВСтоимость
		|		ПО ВТДокументы.ДокументРегистратор = ВТНДСВключенныйВСтоимость.СчетФактура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученный
		|		ПО (СчетФактураПолученный.ДокументОснование = ВТДокументы.ДокументРегистратор)";
	
	КонецЕсли;	 
	
	ВычетПоПриобретеннымЦенностямНеВключенныеПервичка = Запрос.Выполнить().Выгрузить();
			
	//	Расшифровка ошибки "Поступление одной номенклатуры по разным ставкам"
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТовары.Ссылка КАК ОшДокументРегистратор,
	|	ПоступлениеТовары.СтавкаНДС КАК ОшСтавкаНДС,
	|	ПоступлениеТовары.Номенклатура КАК ОшНоменклатура,
	|	1 КАК ОшКоличествоДокументов
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТовары
	|ГДЕ
	|	ПоступлениеТовары.Ссылка.Организация В(&Организация)
	|	И ПоступлениеТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И ПоступлениеТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И ПоступлениеТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокПоступившихТоваров КАК СписокНоменклатуры)
	|	И ПоступлениеТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТСоставКнигиПокупок.ДокументРегистратор
	|			ИЗ
	|				ВТСоставКнигиПокупок)
	|	И ПоступлениеТовары.Номенклатура <> &ПустаяНоменклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка,
	|	ПоступлениеТоваровУслугУслуги.СтавкаНДС,
	|	ПоступлениеТоваровУслугУслуги.Номенклатура,
	|	1
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|ГДЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка.Организация В(&Организация)
	|	И ПоступлениеТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И ПоступлениеТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И ПоступлениеТоваровУслугУслуги.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокПоступившихУслуг КАК СписокНоменклатуры)
	|	И ПоступлениеТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТСоставКнигиПокупок.ДокументРегистратор
	|			ИЗ
	|				ВТСоставКнигиПокупок)
	|	И ПоступлениеТоваровУслугУслуги.Номенклатура <> &ПустаяНоменклатура";
    	
	
	ВычетПоПриобретеннымЦенностямОшибка = Запрос.Выполнить().Выгрузить();
		 
	ВнешнийНаборДанныхВычетПриобретенныеЦенности = Новый Структура;
	
	ВнешнийНаборДанныхВычетПриобретенныеЦенности.Вставить("ВычетПоПриобретеннымЦенностямВключенные", 
		ВычетПоПриобретеннымЦенностямВключенные);
	ВнешнийНаборДанныхВычетПриобретенныеЦенности.Вставить("ВычетПоПриобретеннымЦенностямНеВключенныеРегламенты", 
		ВычетПоПриобретеннымЦенностямНеВключенныеРегламенты);
	ВнешнийНаборДанныхВычетПриобретенныеЦенности.Вставить("ВычетПоПриобретеннымЦенностямНеВключенныеПервичка", 
		ВычетПоПриобретеннымЦенностямНеВключенныеПервичка);
	ВнешнийНаборДанныхВычетПриобретенныеЦенности.Вставить("Ошибка", ВычетПоПриобретеннымЦенностямОшибка); 	
	
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхВычетПриобретенныеЦенности", 
									 ВнешнийНаборДанныхВычетПриобретенныеЦенности);
	
	ВключенныеВБазу = ВычетПоПриобретеннымЦенностямВключенные.Итог("СуммаНДС");
	НеВключенныеВБазу = ВычетПоПриобретеннымЦенностямНеВключенныеРегламенты.Итог("СуммаНДС")
		+ ВычетПоПриобретеннымЦенностямНеВключенныеПервичка.Итог("СуммаНДС");
		
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	     
	Если ВычетПоПриобретеннымЦенностямВключенные.Итог("КоличествоОшибок") > 0 Тогда
		СтруктураВозвращаемыхПараметров.Вставить("НаличиеОшибок", Истина);
	КонецЕсли;
	
	КоличествоЗаписей = ВычетПоПриобретеннымЦенностямВключенные.Количество() 
		+ ВычетПоПриобретеннымЦенностямНеВключенныеРегламенты.Количество() 
		+ ВычетПоПриобретеннымЦенностямНеВключенныеПервичка.Количество();
		
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);	
	
	Возврат СтруктураВозвращаемыхПараметров;

КонецФункции // ПолучитьНаборДанныхВычетПоПриобретеннымЦенностям()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	вычету НДС при исполнении обязанностей налогового агента
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхВычетНалоговыйАгент(Запрос)
	
	Если ИдентификаторКонфигурации = "БП" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НДСПредъявленныйОстатки.СчетФактура КАК СчетФактура,
		|	НДСПредъявленныйОстатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток,
		|	НДСПредъявленныйОстатки.НДСОстаток,
		|	НДСПредъявленныйОстатки.ВидЦенности КАК ВидЦенности,
		|	НДСПредъявленныйОстатки.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСПредъявленныйОстатки.Поставщик,
		|	НДСПредъявленныйОстатки.ДоговорКонтрагента
		|ПОМЕСТИТЬ ВТНДСПредъявленныйОстатки
		|ИЗ
		|	РегистрНакопления.НДСПредъявленный.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И ВидЦенности В (&ВидыЦенностейНалоговыйАгент)
		|				И ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК НДСПредъявленныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	ВидЦенности,
		|	СчетУчетаНДС,
		|	СтавкаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСпоОСиНМАОстатки.СчетФактура КАК СчетФактура,
		|	НДСпоОСиНМАОстатки.ВидЦенности КАК ВидЦенности,
		|	НДСпоОСиНМАОстатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСпоОСиНМАОстатки.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСпоОСиНМАОстатки.СуммаБезНДСОстаток,
		|	НДСпоОСиНМАОстатки.НДСОстаток
		|ПОМЕСТИТЬ ВТНДСпоОСиНМАОстаткиНалоговыйАгент
		|ИЗ
		|	РегистрНакопления.НДСпоОСиНМА.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И НДСВключенВСтоимость = ЛОЖЬ
		|				И ВидЦенности В (&ВидыЦенностейНалоговыйАгент)
		|				И НеВлияетНаВычет = ЛОЖЬ
		|				И СчетФактура В
		|					(ВЫБРАТЬ
		|						НДСПредъявленныйОстатки.СчетФактура
		|					ИЗ
		|						ВТНДСПредъявленныйОстатки КАК НДСПредъявленныйОстатки)) КАК НДСпоОСиНМАОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	ВидЦенности,
		|	СтавкаНДС,
		|	СчетУчетаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСПредъявленныйРеализация0Остатки.СчетФактура КАК СчетФактура,
		|	НДСПредъявленныйРеализация0Остатки.ВидЦенности КАК ВидЦенности,
		|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток,
		|	НДСПредъявленныйРеализация0Остатки.НДСОстаток
		|ПОМЕСТИТЬ ВТНДСПредъявленныйРеализация0ОстаткиНалоговыйАгент
		|ИЗ
		|	РегистрНакопления.НДСПредъявленныйРеализация0.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И ВидЦенности В (&ВидыЦенностейНалоговыйАгент)
		|				И СчетФактура В
		|					(ВЫБРАТЬ
		|						НДСПредъявленныйОстатки.СчетФактура
		|					ИЗ
		|						ВТНДСПредъявленныйОстатки КАК НДСПредъявленныйОстатки)) КАК НДСПредъявленныйРеализация0Остатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	ВидЦенности,
		|	СтавкаНДС,
		|	СчетУчетаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
		|	ХозрасчетныйОстатки.СуммаОстатокКт
		|ПОМЕСТИТЬ ВТХозрасчетныйОстаткиНалоговыйАгент
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&НачалоСледующегоПериода,
		|			,
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами),
		|			Организация В (&Организация)
		|				И Субконто1 В
		|					(ВЫБРАТЬ
		|						НДСПредъявленныйОстатки.СчетФактура
		|					ИЗ
		|						ВТНДСПредъявленныйОстатки КАК НДСПредъявленныйОстатки)) КАК ХозрасчетныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйПогашение.Регистратор КАК Регистратор,
		|	ХозрасчетныйПогашение.Субконто1
		|ПОМЕСТИТЬ ВТХозрасчетныйПогашениеНалоговыйАгент
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			,
		|			&КонецПериодаГраница,
		|			Регистратор,
		|			,
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами),
		|			Организация В (&Организация)
		|				И Субконто1 В
		|					(ВЫБРАТЬ
		|						НДСПредъявленныйОстатки.СчетФактура
		|					ИЗ
		|						ВТНДСПредъявленныйОстатки КАК НДСПредъявленныйОстатки),
		|			КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)),
		|			) КАК ХозрасчетныйПогашение
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗадолженностьПередБюджетом.Субконто1 КАК Субконто1,
		|	ЗадолженностьПередБюджетом.СуммаОстатокКт
		|ПОМЕСТИТЬ ВТЗадолженностьПередБюджетомНалоговыйАгент
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоСледующегоПериода, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНалоговогоАгента), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами), Организация В (&Организация)) КАК ЗадолженностьПередБюджетом
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОборотыПогашенияВБюджет.Субконто1 КАК Субконто1,
		|	ХозрасчетныйОборотыПогашенияВБюджет.Регистратор
		|ПОМЕСТИТЬ ВТХозрасчетныйОборотыПогашенияВБюджетНалоговыйАгент
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(, &КонецПериодаГраница, Регистратор, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНалоговогоАгента), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами), Организация В (&Организация), КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)), ) КАК ХозрасчетныйОборотыПогашенияВБюджет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйПогашение.Субконто1 КАК Субконто1,
		|	ХозрасчетныйПогашение.Регистратор КАК Регистратор,
		|	ХозрасчетныйОборотыПогашенияВБюджет.Регистратор КАК ДокументОплатыВБюджет
		|ПОМЕСТИТЬ ВТХозрасчетныйНалоговыйАгентРезультирующаяТаблица
		|ИЗ
		|	ВТХозрасчетныйПогашениеНалоговыйАгент КАК ХозрасчетныйПогашение
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХозрасчетныйОборотыПогашенияВБюджетНалоговыйАгент КАК ХозрасчетныйОборотыПогашенияВБюджет
		|		ПО ХозрасчетныйПогашение.Регистратор = ХозрасчетныйОборотыПогашенияВБюджет.Субконто1
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСПредъявленныйОстатки.СчетФактура КАК ДокументРегистратор,
		|	НДСПредъявленныйОстатки.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0)) КАК Сумма,
		|	СУММА(ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.НДСОстаток, 0)) КАК СуммаНДС,
		|	ХозрасчетныйОстатки.СуммаОстатокКт,
		|	ХозрасчетныйПогашение.Регистратор КАК ДокументОплатыПоставщику,
		|	ХозрасчетныйПогашение.Субконто1 КАК КонтрагентОплата,
		|	НДСПредъявленныйОстатки.ДоговорКонтрагента КАК ДоговорОплата,
		|	НДСПредъявленныйОстатки.СчетФактура КАК ДокументОплата,
		|	ЗадолженностьПередБюджетом.СуммаОстатокКт КАК СуммаЗадолженностиПередБюджетом,
		|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
		|	ХозрасчетныйПогашение.ДокументОплатыВБюджет КАК ДокументОплатыВБюджет,
		|	&ТекстНеОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстатокКт, 0) > 0
		|			ТОГДА &ТекстПоступлениеНеОплаченоПоставщику
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL 
		|					ТОГДА &ТекстСФНалоговогоАгентаНеВыписан
		|				ИНАЧЕ ВЫБОР
		|						КОГДА (НЕ СчетФактураВыданныйДокументыОснования.Ссылка.Проведен)
		|							ТОГДА &ТекстСФНалоговогоАгентаНеПроведен
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ЗадолженностьПередБюджетом.СуммаОстатокКт ЕСТЬ NULL 
		|									ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
		|								ИНАЧЕ &ТекстНДСНеУплаченВБюджет
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ПризнакНаличияОшибок,
		|	1 КАК КоличествоДокументов
		|ИЗ
		|	ВТНДСПредъявленныйОстатки КАК НДСПредъявленныйОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСпоОСиНМАОстаткиНалоговыйАгент КАК НДСпоОСиНМАОстатки
		|		ПО НДСПредъявленныйОстатки.СчетФактура = НДСпоОСиНМАОстатки.СчетФактура
		|			И НДСПредъявленныйОстатки.ВидЦенности = НДСпоОСиНМАОстатки.ВидЦенности
		|			И НДСПредъявленныйОстатки.СтавкаНДС = НДСпоОСиНМАОстатки.СтавкаНДС
		|			И НДСПредъявленныйОстатки.СчетУчетаНДС = НДСпоОСиНМАОстатки.СчетУчетаНДС
		|			И (НДСпоОСиНМАОстатки.СуммаБезНДСОстаток + НДСпоОСиНМАОстатки.НДСОстаток > 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСПредъявленныйРеализация0ОстаткиНалоговыйАгент КАК НДСПредъявленныйРеализация0Остатки
		|		ПО НДСПредъявленныйОстатки.СчетФактура = НДСПредъявленныйРеализация0Остатки.СчетФактура
		|			И НДСПредъявленныйОстатки.ВидЦенности = НДСПредъявленныйРеализация0Остатки.ВидЦенности
		|			И НДСПредъявленныйОстатки.СтавкаНДС = НДСПредъявленныйРеализация0Остатки.СтавкаНДС
		|			И НДСПредъявленныйОстатки.СчетУчетаНДС = НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС
		|			И (НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток + НДСПредъявленныйРеализация0Остатки.НДСОстаток > 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХозрасчетныйОстаткиНалоговыйАгент КАК ХозрасчетныйОстатки
		|		ПО НДСПредъявленныйОстатки.СчетФактура = ХозрасчетныйОстатки.Субконто1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХозрасчетныйНалоговыйАгентРезультирующаяТаблица КАК ХозрасчетныйПогашение
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТЗадолженностьПередБюджетомНалоговыйАгент КАК ЗадолженностьПередБюджетом
		|			ПО ХозрасчетныйПогашение.Регистратор = ЗадолженностьПередБюджетом.Субконто1
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|			ПО ХозрасчетныйПогашение.Регистратор = СчетФактураВыданныйДокументыОснования.ДокументОснование
		|		ПО НДСПредъявленныйОстатки.СчетФактура = ХозрасчетныйПогашение.Субконто1
		|ГДЕ
		|	(НДСПредъявленныйОстатки.СуммаБезНДСОстаток > 0
		|			ИЛИ НДСПредъявленныйОстатки.НДСОстаток > 0)
		|	И СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НалоговыйАгент)
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйПогашение.ДокументОплатыВБюджет,
		|	НДСПредъявленныйОстатки.СчетФактура,
		|	НДСПредъявленныйОстатки.СтавкаНДС,
		|	ХозрасчетныйОстатки.СуммаОстатокКт,
		|	ХозрасчетныйПогашение.Регистратор,
		|	ХозрасчетныйПогашение.Субконто1,
		|	НДСПредъявленныйОстатки.ДоговорКонтрагента,
		|	ЗадолженностьПередБюджетом.СуммаОстатокКт,
		|	СчетФактураВыданныйДокументыОснования.Ссылка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстатокКт, 0) > 0
		|			ТОГДА &ТекстПоступлениеНеОплаченоПоставщику
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL 
		|					ТОГДА &ТекстСФНалоговогоАгентаНеВыписан
		|				ИНАЧЕ ВЫБОР
		|						КОГДА (НЕ СчетФактураВыданныйДокументыОснования.Ссылка.Проведен)
		|							ТОГДА &ТекстСФНалоговогоАгентаНеПроведен
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ЗадолженностьПередБюджетом.СуммаОстатокКт ЕСТЬ NULL 
		|									ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
		|								ИНАЧЕ &ТекстНДСНеУплаченВБюджет
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ,
		|	НДСПредъявленныйОстатки.СчетФактура
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.НДСОстаток, 0)) > 0";
		
		ВычетПриИсполненииОНАНеВключенные = Запрос.Выполнить().Выгрузить();
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НДСЗаписиКнигиПокупокОбороты.СчетФактура,
		|	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС,
		|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот,
		|	НДСЗаписиКнигиПокупокОбороты.НДСОборот,
		|	НДСЗаписиКнигиПокупокОбороты.ДокументОплаты КАК ДокументОплаты
		|ПОМЕСТИТЬ НДСЗаписиКнигиПокупокОборотыНалоговыйАгентВычеты
		|ИЗ
		|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
		|			&НачалоПериода,
		|			&КонецПериодаГраница,
		|			,
		|			ВидЦенности В (&ВидыЦенностейНалоговыйАгент)
		|				И Организация В (&Организация)
		|				И Событие <> ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСКВычету0)) КАК НДСЗаписиКнигиПокупокОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументОплаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОбороты.Субконто1 КАК Субконто1,
		|	ХозрасчетныйОбороты.Регистратор
		|ПОМЕСТИТЬ ХозрасчетныйОборотыОплатаНалоговыйАгентВычет
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(, &КонецПериодаГраница, Регистратор, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНалоговогоАгента), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами), Организация В (&Организация), КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)), ) КАК ХозрасчетныйОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСЗаписиКнигиПокупокОбороты.СчетФактура КАК ДокументРегистратор,
		|	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС,
		|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот КАК Сумма,
		|	НДСЗаписиКнигиПокупокОбороты.НДСОборот КАК СуммаНДС,
		|	НДСЗаписиКнигиПокупокОбороты.ДокументОплаты КАК ДокументОплатыПоставщику,
		|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
		|	ХозрасчетныйОбороты.Регистратор КАК ДокументОплатыВБюджет,
		|	1 КАК КоличествоДокументов,
		|	&ТекстОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
		|	&ТекстБезОшибок КАК ПризнакНаличияОшибок
		|ИЗ
		|	НДСЗаписиКнигиПокупокОборотыНалоговыйАгентВычеты КАК НДСЗаписиКнигиПокупокОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО НДСЗаписиКнигиПокупокОбороты.ДокументОплаты = СчетФактураВыданныйДокументыОснования.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйОборотыОплатаНалоговыйАгентВычет КАК ХозрасчетныйОбороты
		|		ПО НДСЗаписиКнигиПокупокОбороты.ДокументОплаты = ХозрасчетныйОбороты.Субконто1";
		
		ВычетПриИсполненииОНАВключенные = Запрос.Выполнить().Выгрузить();
			
	Иначе
		
		Если РедакцияКонфигурации = "1.2" ИЛИ РедакцияКонфигурации = "1.0" Тогда
			
			ВычетПриИсполненииОНАВключенные = Новый ТаблицаЗначений;
            ВычетПриИсполненииОНАНеВключенные = Новый ТаблицаЗначений;
			
			ВнешнийНаборДанныхВычетИсполнениеОНА = Новый Структура;
			ВнешнийНаборДанныхВычетИсполнениеОНА.Вставить("ВычетПриИсполненииОНАНеВключенные",ВычетПриИсполненииОНАНеВключенные);
			ВнешнийНаборДанныхВычетИсполнениеОНА.Вставить("ВычетПриИсполненииОНАВключенные",ВычетПриИсполненииОНАВключенные);
			
			СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхВычетИсполнениеОНА", ВнешнийНаборДанныхВычетИсполнениеОНА);
								
			СтруктураВозвращаемыхПараметров = Новый Структура();
			СтруктураВозвращаемыхПараметров.Вставить("Включенные", 0);
			СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", 0);
			 			
			СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", Ложь);
			
			Возврат СтруктураВозвращаемыхПараметров;
			
		Иначе
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НДСПредъявленныйОстатки.СчетФактура,
			|	НДСПредъявленныйОстатки.СтавкаНДС,
			|	НДСПредъявленныйОстатки.ВидЦенности,
			|	НДСПредъявленныйОстатки.СчетУчетаНДС,
			|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток,
			|	НДСПредъявленныйОстатки.НДСОстаток,
			|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток КАК СуммаБезНДСОстаток1,
			|	НДСПредъявленныйОстатки.НДСОстаток КАК НДСОстаток1
			|ПОМЕСТИТЬ ВТНДСПредъявленныйОстаткиВычетНалоговыйАгент
			|ИЗ
			|	РегистрНакопления.НДСПредъявленный.Остатки(
			|			&НачалоСледующегоПериода,
			|			Организация В (&Организация)
			|				И ВидЦенности В (&ВидыЦенностейНалоговыйАгент)
			|				И ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК НДСПредъявленныйОстатки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	НДСПредъявленныйОстатки.СчетФактура,
			|	НДСПредъявленныйОстатки.ВидЦенности,
			|	НДСПредъявленныйОстатки.СтавкаНДС,
			|	НДСПредъявленныйОстатки.СчетУчетаНДС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НДСпоОСиНМАОстатки.СчетФактура,
			|	НДСпоОСиНМАОстатки.ВидЦенности,
			|	НДСпоОСиНМАОстатки.СтавкаНДС,
			|	НДСпоОСиНМАОстатки.СчетУчетаНДС,
			|	НДСпоОСиНМАОстатки.СуммаБезНДСОстаток,
			|	НДСпоОСиНМАОстатки.НДСОстаток
			|ПОМЕСТИТЬ ВТНДСпоОСиНМАВычетНалоговыйАгент
			|ИЗ
			|	РегистрНакопления.НДСпоОСиНМА.Остатки(
			|			&НачалоСледующегоПериода,
			|			Организация В (&Организация)
			|				И НДСВключенВСтоимость = ЛОЖЬ
			|				И ВидЦенности В (&ВидыЦенностейНалоговыйАгент)
			|				И НеВлияетНаВычет = ЛОЖЬ) КАК НДСпоОСиНМАОстатки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	НДСпоОСиНМАОстатки.СчетФактура,
			|	НДСпоОСиНМАОстатки.ВидЦенности,
			|	НДСпоОСиНМАОстатки.СтавкаНДС,
			|	НДСпоОСиНМАОстатки.СчетУчетаНДС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НДСПредъявленныйРеализация0Остатки.СчетФактура,
			|	НДСПредъявленныйРеализация0Остатки.ВидЦенности,
			|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС,
			|	НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС,
			|	НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток,
			|	НДСПредъявленныйРеализация0Остатки.НДСОстаток
			|ПОМЕСТИТЬ ВТНДСПредъявленныйРеализация0ВычетНалоговыйАгент
			|ИЗ
			|	РегистрНакопления.НДСПредъявленныйРеализация0.Остатки(
			|			&НачалоСледующегоПериода,
			|			Организация В (&Организация)
			|				И ВидЦенности В (&ВидыЦенностейНалоговыйАгент)) КАК НДСПредъявленныйРеализация0Остатки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	НДСПредъявленныйРеализация0Остатки.СчетФактура,
			|	НДСПредъявленныйРеализация0Остатки.ВидЦенности,
			|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС,
			|	НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасчетыПоПриобретениюОстатки.Документ,
			|	РасчетыПоПриобретениюОстатки.СуммаРегОстаток
			|ПОМЕСТИТЬ ВТРасчетыПоПриобретениюОстаткиВычетНалоговыйАгент
			|ИЗ
			|	РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации.Остатки(&НачалоСледующегоПериода, Организация В (&Организация)) КАК РасчетыПоПриобретениюОстатки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	РасчетыПоПриобретениюОстатки.Документ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасчетыПоПриобретению.Регистратор,
			|	РасчетыПоПриобретению.ДоговорКонтрагента,
			|	РасчетыПоПриобретению.Документ,
			|	РасчетыПоПриобретению.Контрагент,
			|	РасчетыПоПриобретению.СуммаРегОборот
			|ПОМЕСТИТЬ ВТРасчетыПоПриобретениюВычетНалоговыйАгент
			|ИЗ
			|	РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации.Обороты(
			|			,
			|			&КонецПериодаГраница,
			|			Регистратор,
			|			ДоговорКонтрагента.УчетАгентскогоНДС
			|				И ДоговорКонтрагента.НалоговыйАгентПоОплате
			|				И Организация В (&Организация)) КАК РасчетыПоПриобретению
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	РасчетыПоПриобретению.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасчетыПоПриобретению.Регистратор,
			|	РасчетыПоПриобретению.ДоговорКонтрагента,
			|	РасчетыПоПриобретению.Документ,
			|	РасчетыПоПриобретению.Контрагент,
			|	РасчетыПоПриобретению.СуммаРегОборот,
			|	СчетФактураВыданныйДокументыОснования.Ссылка КАК ДокументСчетФактура
			|ПОМЕСТИТЬ ВТРасчетыПоПриобретениюВычетНалоговыйАгентСчетФактура
			|ИЗ
			|	ВТРасчетыПоПриобретениюВычетНалоговыйАгент КАК РасчетыПоПриобретению
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
			|		ПО РасчетыПоПриобретению.Регистратор = СчетФактураВыданныйДокументыОснования.ДокументОснование
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	РасчетыПоПриобретению.Контрагент,
			|	РасчетыПоПриобретению.ДоговорКонтрагента
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗадолженностьПередБюджетом.Субконто1,
			|	ЗадолженностьПередБюджетом.Субконто2,
			|	ЗадолженностьПередБюджетом.СуммаОстатокКт
			|ПОМЕСТИТЬ ВТЗадолженностьПередБюджетомВычетНалоговыйАгент
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоСледующегоПериода, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНалоговогоАгента), , Организация В (&Организация)) КАК ЗадолженностьПередБюджетом
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ЗадолженностьПередБюджетом.Субконто1,
			|	ЗадолженностьПередБюджетом.Субконто2
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ХозрасчетныйОборотыПогашенияВБюджет.Субконто1,
			|	ХозрасчетныйОборотыПогашенияВБюджет.Субконто2,
			|	ХозрасчетныйОборотыПогашенияВБюджет.Регистратор
			|ПОМЕСТИТЬ ВТХозрасчетныйОборотыПогашенияВБюджетВычетНалоговыйАгент
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Обороты(
			|			,
			|			&КонецПериодаГраница,
			|			Регистратор,
			|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНалоговогоАгента),
			|			,
			|			Организация В (&Организация),
			|			КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета))
			|				ИЛИ КорСчет.Родитель = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпециальныеСчета),
			|			) КАК ХозрасчетныйОборотыПогашенияВБюджет
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ХозрасчетныйОборотыПогашенияВБюджет.Субконто1,
			|	ХозрасчетныйОборотыПогашенияВБюджет.Субконто2
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НДСПредъявленныйОстатки.СчетФактура КАК ДокументРегистратор,
			|	НДСПредъявленныйОстатки.СтавкаНДС КАК СтавкаНДС,
			|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток,
			|	НДСПредъявленныйОстатки.НДСОстаток,
			|	СУММА(ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0)) КАК Сумма,
			|	СУММА(ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.НДСОстаток, 0)) КАК СуммаНДС,
			|	РасчетыПоПриобретениюОстатки.СуммаРегОстаток КАК ЗадолженностьПередКонтрагентом,
			|	РасчетыПоПриобретению.Регистратор КАК ДокументОплатыПоставщику,
			|	РасчетыПоПриобретению.ДокументСчетФактура КАК СчетФактура,
			|	ЗадолженностьПередБюджетом.СуммаОстатокКт КАК ЗадолженностьПередБюджетом,
			|	ХозрасчетныйОборотыПогашенияВБюджет.Регистратор КАК ДокументОплатыВБюджет,
			|	&ТекстНеОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(РасчетыПоПриобретениюОстатки.СуммаРегОстаток, 0) > 0
			|			ТОГДА &ТекстПоступлениеНеОплаченоПоставщику
			|		ИНАЧЕ ВЫБОР
			|				КОГДА РасчетыПоПриобретению.ДокументСчетФактура ЕСТЬ NULL 
			|					ТОГДА &ТекстСФНалоговогоАгентаНеВыписан
			|				ИНАЧЕ ВЫБОР
			|						КОГДА (НЕ РасчетыПоПриобретению.ДокументСчетФактура.Проведен)
			|							ТОГДА &ТекстСФНалоговогоАгентаНеПроведен
			|						ИНАЧЕ ВЫБОР
			|								КОГДА ЗадолженностьПередБюджетом.СуммаОстатокКт ЕСТЬ NULL 
			|									ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
			|								ИНАЧЕ &ТекстНДСНеУплаченВБюджет
			|							КОНЕЦ
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ КАК ПризнакНаличияОшибок,
			|	1 КАК КоличествоДокументов,
			|	РасчетыПоПриобретению.СуммаРегОборот
			|ИЗ
			|	ВТНДСПредъявленныйОстаткиВычетНалоговыйАгент КАК НДСПредъявленныйОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСпоОСиНМАВычетНалоговыйАгент КАК НДСпоОСиНМАОстатки
			|		ПО НДСПредъявленныйОстатки.СчетФактура = НДСпоОСиНМАОстатки.СчетФактура
			|			И НДСПредъявленныйОстатки.ВидЦенности = НДСпоОСиНМАОстатки.ВидЦенности
			|			И НДСПредъявленныйОстатки.СтавкаНДС = НДСпоОСиНМАОстатки.СтавкаНДС
			|			И НДСПредъявленныйОстатки.СчетУчетаНДС = НДСпоОСиНМАОстатки.СчетУчетаНДС
			|			И (НДСпоОСиНМАОстатки.СуммаБезНДСОстаток + НДСпоОСиНМАОстатки.НДСОстаток > 0)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСПредъявленныйРеализация0ВычетНалоговыйАгент КАК НДСПредъявленныйРеализация0Остатки
			|		ПО НДСПредъявленныйОстатки.СчетФактура = НДСПредъявленныйРеализация0Остатки.СчетФактура
			|			И НДСПредъявленныйОстатки.ВидЦенности = НДСПредъявленныйРеализация0Остатки.ВидЦенности
			|			И НДСПредъявленныйОстатки.СтавкаНДС = НДСПредъявленныйРеализация0Остатки.СтавкаНДС
			|			И НДСПредъявленныйОстатки.СчетУчетаНДС = НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС
			|			И (НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток + НДСПредъявленныйРеализация0Остатки.НДСОстаток > 0)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетыПоПриобретениюОстаткиВычетНалоговыйАгент КАК РасчетыПоПриобретениюОстатки
			|		ПО НДСПредъявленныйОстатки.СчетФактура = РасчетыПоПриобретениюОстатки.Документ
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетыПоПриобретениюВычетНалоговыйАгентСчетФактура КАК РасчетыПоПриобретению
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТЗадолженностьПередБюджетомВычетНалоговыйАгент КАК ЗадолженностьПередБюджетом
			|			ПО РасчетыПоПриобретению.Контрагент = ЗадолженностьПередБюджетом.Субконто1
			|				И РасчетыПоПриобретению.ДоговорКонтрагента = ЗадолженностьПередБюджетом.Субконто2
			|		ПО (РасчетыПоПриобретению.Документ = НДСПредъявленныйОстатки.СчетФактура)
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХозрасчетныйОборотыПогашенияВБюджетВычетНалоговыйАгент КАК ХозрасчетныйОборотыПогашенияВБюджет
			|		ПО (РасчетыПоПриобретению.Контрагент = ХозрасчетныйОборотыПогашенияВБюджет.Субконто1)
			|			И (РасчетыПоПриобретению.ДоговорКонтрагента = ХозрасчетныйОборотыПогашенияВБюджет.Субконто2)
			|ГДЕ
			|	(НДСПредъявленныйОстатки.СуммаБезНДСОстаток > 0
			|			ИЛИ НДСПредъявленныйОстатки.НДСОстаток > 0)
			|	И РасчетыПоПриобретению.СуммаРегОборот > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	НДСПредъявленныйОстатки.СчетФактура,
			|	НДСПредъявленныйОстатки.СтавкаНДС,
			|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток,
			|	НДСПредъявленныйОстатки.НДСОстаток,
			|	РасчетыПоПриобретениюОстатки.СуммаРегОстаток,
			|	РасчетыПоПриобретению.Регистратор,
			|	РасчетыПоПриобретению.ДокументСчетФактура,
			|	ЗадолженностьПередБюджетом.СуммаОстатокКт,
			|	ХозрасчетныйОборотыПогашенияВБюджет.Регистратор,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(РасчетыПоПриобретениюОстатки.СуммаРегОстаток, 0) > 0
			|			ТОГДА &ТекстПоступлениеНеОплаченоПоставщику
			|		ИНАЧЕ ВЫБОР
			|				КОГДА РасчетыПоПриобретению.ДокументСчетФактура ЕСТЬ NULL 
			|					ТОГДА &ТекстСФНалоговогоАгентаНеВыписан
			|				ИНАЧЕ ВЫБОР
			|						КОГДА (НЕ РасчетыПоПриобретению.ДокументСчетФактура.Проведен)
			|							ТОГДА &ТекстСФНалоговогоАгентаНеПроведен
			|						ИНАЧЕ ВЫБОР
			|								КОГДА ЗадолженностьПередБюджетом.СуммаОстатокКт ЕСТЬ NULL 
			|									ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
			|								ИНАЧЕ &ТекстНДСНеУплаченВБюджет
			|							КОНЕЦ
			|					КОНЕЦ
			|			КОНЕЦ
			|	КОНЕЦ,
			|	РасчетыПоПриобретению.СуммаРегОборот
			|
			|ИМЕЮЩИЕ
			|	СУММА(ЕСТЬNULL(НДСПредъявленныйОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.СуммаБезНДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0) + ЕСТЬNULL(НДСПредъявленныйОстатки.НДСОстаток, 0) - ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0) - ЕСТЬNULL(НДСпоОСиНМАОстатки.НДСОстаток, 0)) > 0";
			
			ВычетПриИсполненииОНАНеВключенные = Запрос.Выполнить().Выгрузить();
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НДСЗаписиКнигиПокупокОбороты.СчетФактура,
			|	НДСЗаписиКнигиПокупокОбороты.Поставщик,
			|	НДСЗаписиКнигиПокупокОбороты.ДоговорКонтрагента,
			|	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС,
			|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот,
			|	НДСЗаписиКнигиПокупокОбороты.НДСОборот,
			|	НДСЗаписиКнигиПокупокОбороты.ДокументОплаты
			|ПОМЕСТИТЬ ВТНДСЗаписиКнигиПокупокВычетНалоговыйАгент
			|ИЗ
			|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
			|			&НачалоПериода,
			|			&КонецПериодаГраница,
			|			,
			|			ВидЦенности В (&ВидыЦенностейНалоговыйАгент)
			|				И Организация В (&Организация)
			|				И Событие <> ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСКВычету0)) КАК НДСЗаписиКнигиПокупокОбороты
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	НДСЗаписиКнигиПокупокОбороты.СчетФактура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НДСЗаписиКнигиПокупокОбороты.СчетФактура,
			|	НДСЗаписиКнигиПокупокОбороты.Поставщик,
			|	НДСЗаписиКнигиПокупокОбороты.ДоговорКонтрагента,
			|	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС,
			|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот,
			|	НДСЗаписиКнигиПокупокОбороты.НДСОборот,
			|	НДСЗаписиКнигиПокупокОбороты.ДокументОплаты,
			|	СчетФактураВыданныйДокументыОснования.Ссылка КАК ДокументСчетФактура
			|ПОМЕСТИТЬ ВТНДСЗаписиКнигиПокупокВычетНалоговыйАгентСчетФактура
			|ИЗ
			|	ВТНДСЗаписиКнигиПокупокВычетНалоговыйАгент КАК НДСЗаписиКнигиПокупокОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
			|		ПО НДСЗаписиКнигиПокупокОбороты.ДокументОплаты = СчетФактураВыданныйДокументыОснования.ДокументОснование
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	НДСЗаписиКнигиПокупокОбороты.Поставщик,
			|	НДСЗаписиКнигиПокупокОбороты.ДоговорКонтрагента
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ХозрасчетныйОборотыПогашенияВБюджет.Субконто1,
			|	ХозрасчетныйОборотыПогашенияВБюджет.Субконто2,
			|	ХозрасчетныйОборотыПогашенияВБюджет.Регистратор
			|ПОМЕСТИТЬ ХозрасчетныйОборотыПогашенияВБюджетВычетНалоговыйАгент
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Обороты(
			|			,
			|			&КонецПериодаГраница,
			|			Регистратор,
			|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНалоговогоАгента),
			|			,
			|			Организация В (&Организация),
			|			КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета))
			|				ИЛИ КорСчет.Родитель = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпециальныеСчета),
			|			) КАК ХозрасчетныйОборотыПогашенияВБюджет
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ХозрасчетныйОборотыПогашенияВБюджет.Субконто1,
			|	ХозрасчетныйОборотыПогашенияВБюджет.Субконто2
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НДСЗаписиКнигиПокупокОбороты.СчетФактура КАК ДокументРегистратор,
			|	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС,
			|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот КАК Сумма,
			|	НДСЗаписиКнигиПокупокОбороты.НДСОборот КАК СуммаНДС,
			|	НДСЗаписиКнигиПокупокОбороты.ДокументОплаты КАК ДокументОплатыПоставщику,
			|	НДСЗаписиКнигиПокупокОбороты.ДокументСчетФактура КАК СчетФактура,
			|	ХозрасчетныйОборотыПогашенияВБюджет.Регистратор КАК ДокументОплатыВБюджет,
			|	1 КАК КоличествоДокументов,
			|	&ТекстОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
			|	&ТекстБезОшибок КАК ПризнакНаличияОшибок
			|ИЗ
			|	ВТНДСЗаписиКнигиПокупокВычетНалоговыйАгентСчетФактура КАК НДСЗаписиКнигиПокупокОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйОборотыПогашенияВБюджетВычетНалоговыйАгент КАК ХозрасчетныйОборотыПогашенияВБюджет
			|		ПО НДСЗаписиКнигиПокупокОбороты.Поставщик = ХозрасчетныйОборотыПогашенияВБюджет.Субконто1
			|			И НДСЗаписиКнигиПокупокОбороты.ДоговорКонтрагента = ХозрасчетныйОборотыПогашенияВБюджет.Субконто2";
						
			ВычетПриИсполненииОНАВключенные = Запрос.Выполнить().Выгрузить();
						
		КонецЕсли;
	КонецЕсли;	
		
	ВнешнийНаборДанныхВычетИсполнениеОНА = Новый Структура;
	ВнешнийНаборДанныхВычетИсполнениеОНА.Вставить("ВычетПриИсполненииОНАНеВключенные",ВычетПриИсполненииОНАНеВключенные);
	ВнешнийНаборДанныхВычетИсполнениеОНА.Вставить("ВычетПриИсполненииОНАВключенные",ВычетПриИсполненииОНАВключенные);
	
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхВычетИсполнениеОНА", ВнешнийНаборДанныхВычетИсполнениеОНА);
	
	ВключенныеВБазу = ВычетПриИсполненииОНАВключенные.Итог("СуммаНДС");
	НеВключенныеВБазу = ВычетПриИсполненииОНАНеВключенные.Итог("СуммаНДС");
	
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	КоличествоЗаписей = ВычетПриИсполненииОНАВключенные.Количество() 
	+ ВычетПриИсполненииОНАНеВключенные.Количество();
	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);
	
	Возврат СтруктураВозвращаемыхПараметров;
	
КонецФункции // ПолучитьНаборДанныхВычетИсполнениеОНА()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	вычету НДС с авансов полученных (по факту реализации ценностей)
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхВычетСАвансовПолученных(Запрос)
	
	Если ИдентификаторКонфигурации = "БП" Тогда
 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НДСсАвансовОстатки.СчетФактура КАК СчетФактура,
		|	НДСсАвансовОстатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСсАвансовОстатки.ВидЦенности КАК ВидЦенности,
		|	НДСсАвансовОстатки.СуммаБезНДСОстаток,
		|	НДСсАвансовОстатки.НДСОстаток
		|ПОМЕСТИТЬ ВТНДСсАвансовПолученныхОстатки
		|ИЗ
		|	РегистрНакопления.НДСсАвансов.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыПолученные)) КАК НДСсАвансовОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	СтавкаНДС,
		|	ВидЦенности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСНачисленныйОстатки.СчетФактура КАК СчетФактура,
		|	НДСНачисленныйОстатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСНачисленныйОстатки.ВидЦенности КАК ВидЦенности,
		|	НДСНачисленныйОстатки.СуммаБезНДСОстаток,
		|	НДСНачисленныйОстатки.НДСОстаток
		|ПОМЕСТИТЬ ВТНДСНачисленныйСАвансовПолученныхОстатки
		|ИЗ
		|	РегистрНакопления.НДСНачисленный.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыПолученные)) КАК НДСНачисленныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	СтавкаНДС,
		|	ВидЦенности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
		|	ХозрасчетныйОстатки.СуммаОстатокКт
		|ПОМЕСТИТЬ ВТХозрасчетныйСАвансовПолученныхОстатки
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериодаГраница, Счет В (&СписокСчетовАвансовПолученных), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами), Организация В (&Организация)) КАК ХозрасчетныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСсАвансовОстатки.СчетФактура КАК ДокументРегистратор,
		|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
		|	НДСсАвансовОстатки.СтавкаНДС,
		|	ВЫБОР
		|		КОГДА НДСсАвансовОстатки.СуммаБезНДСОстаток - ЕСТЬNULL(НДСНачисленныйОстатки.СуммаБезНДСОстаток, 0) = 0
		|			ТОГДА НДСсАвансовОстатки.СуммаБезНДСОстаток
		|		ИНАЧЕ НДСсАвансовОстатки.СуммаБезНДСОстаток - ЕСТЬNULL(НДСНачисленныйОстатки.СуммаБезНДСОстаток, 0)
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА НДСсАвансовОстатки.НДСОстаток - ЕСТЬNULL(НДСНачисленныйОстатки.НДСОстаток, 0) = 0
		|			ТОГДА НДСсАвансовОстатки.НДСОстаток
		|		ИНАЧЕ НДСсАвансовОстатки.НДСОстаток - ЕСТЬNULL(НДСНачисленныйОстатки.НДСОстаток, 0)
		|	КОНЕЦ КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА НДСсАвансовОстатки.НДСОстаток - ЕСТЬNULL(НДСНачисленныйОстатки.НДСОстаток, 0) = 0
		|			ТОГДА ВЫБОР
		|					КОГДА НДСсАвансовОстатки.НДСОстаток > 0
		|						ТОГДА &ТекстПолученныйАвансНеОтраженВКнигеПродаж
		|					ИНАЧЕ &ТекстКорректировкаКнигиПокупок
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НДСсАвансовОстатки.СуммаБезНДСОстаток + НДСсАвансовОстатки.НДСОстаток > ЕСТЬNULL(ХозрасчетныйОстатки.СуммаОстатокКт, 0)
		|					ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
		|				ИНАЧЕ &ТекстОплаченныеЦенностиНеРеализованы
		|			КОНЕЦ
		|	КОНЕЦ КАК ПризнакНаличияОшибок,
		|	&ТекстНеОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
		|	1 КАК КоличествоДокументов
		|ИЗ
		|	ВТНДСсАвансовПолученныхОстатки КАК НДСсАвансовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСНачисленныйСАвансовПолученныхОстатки КАК НДСНачисленныйОстатки
		|		ПО НДСсАвансовОстатки.СчетФактура = НДСНачисленныйОстатки.СчетФактура
		|			И НДСсАвансовОстатки.СтавкаНДС = НДСНачисленныйОстатки.СтавкаНДС
		|			И НДСсАвансовОстатки.ВидЦенности = НДСНачисленныйОстатки.ВидЦенности
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХозрасчетныйСАвансовПолученныхОстатки КАК ХозрасчетныйОстатки
		|		ПО НДСсАвансовОстатки.СчетФактура = ХозрасчетныйОстатки.Субконто1
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО НДСсАвансовОстатки.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
		|ГДЕ
		|	НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления";
		
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НДСсАвансовОстатки.СчетФактура КАК СчетФактура,
		|	НДСсАвансовОстатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСсАвансовОстатки.ВидЦенности КАК ВидЦенности,
		|	НДСсАвансовОстатки.СуммаБезНДСОстаток,
		|	НДСсАвансовОстатки.НДСОстаток,
		|	НДСсАвансовОстатки.Покупатель КАК Покупатель,
		|	НДСсАвансовОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента
		|ПОМЕСТИТЬ ВТНДСсАвансовПолученныхОстатки
		|ИЗ
		|	РегистрНакопления.НДСсАвансов.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыПолученные)) КАК НДСсАвансовОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Покупатель,
		|	ДоговорКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСНачисленныйОстатки.СчетФактура КАК СчетФактура,
		|	НДСНачисленныйОстатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСНачисленныйОстатки.ВидЦенности КАК ВидЦенности,
		|	НДСНачисленныйОстатки.СуммаБезНДСОстаток,
		|	НДСНачисленныйОстатки.НДСОстаток
		|ПОМЕСТИТЬ ВТНДСНачисленныйСАвансовПолученныхОстатки
		|ИЗ
		|	РегистрНакопления.НДСНачисленный.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыПолученные)) КАК НДСНачисленныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	СтавкаНДС,
		|	ВидЦенности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
		|	ХозрасчетныйОстатки.Субконто1 КАК Субконто2,
		|	ХозрасчетныйОстатки.СуммаОстатокКт
		|ПОМЕСТИТЬ ВТХозрасчетныйСАвансовПолученныхОстатки
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонецПериодаГраница, Счет В (&СписокСчетовАвансовПолученных), &ВидыСубконто, Организация В (&Организация)) КАК ХозрасчетныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1,
		|	Субконто2
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСсАвансовОстатки.СчетФактура КАК СчетФактура,
		|	НДСсАвансовОстатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСсАвансовОстатки.ВидЦенности КАК ВидЦенности,
		|	НДСсАвансовОстатки.СуммаБезНДСОстаток,
		|	НДСсАвансовОстатки.НДСОстаток,
		|	НДСсАвансовОстатки.Покупатель КАК Покупатель,
		|	НДСсАвансовОстатки.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
		|	ХозрасчетныйОстатки.Субконто1 КАК Субконто2,
		|	ХозрасчетныйОстатки.СуммаОстатокКт
		|ПОМЕСТИТЬ ВТНДСсАвансовПолученныхОстаткиИХозрасчетныйОстатки
		|ИЗ
		|	ВТНДСсАвансовПолученныхОстатки КАК НДСсАвансовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХозрасчетныйСАвансовПолученныхОстатки КАК ХозрасчетныйОстатки
		|		ПО НДСсАвансовОстатки.Покупатель = ХозрасчетныйОстатки.Субконто1
		|			И НДСсАвансовОстатки.ДоговорКонтрагента = ХозрасчетныйОстатки.Субконто2
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НДСсАвансовОстатки.СчетФактура,
		|	НДСсАвансовОстатки.СтавкаНДС,
		|	НДСсАвансовОстатки.ВидЦенности
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСсАвансовОстатки.СчетФактура КАК ДокументРегистратор,
		|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
		|	НДСсАвансовОстатки.СтавкаНДС,
		|	ВЫБОР
		|		КОГДА НДСсАвансовОстатки.СуммаБезНДСОстаток - ЕСТЬNULL(НДСНачисленныйОстатки.СуммаБезНДСОстаток, 0) = 0
		|			ТОГДА НДСсАвансовОстатки.СуммаБезНДСОстаток
		|		ИНАЧЕ НДСсАвансовОстатки.СуммаБезНДСОстаток - ЕСТЬNULL(НДСНачисленныйОстатки.СуммаБезНДСОстаток, 0)
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА НДСсАвансовОстатки.НДСОстаток - ЕСТЬNULL(НДСНачисленныйОстатки.НДСОстаток, 0) = 0
		|			ТОГДА НДСсАвансовОстатки.НДСОстаток
		|		ИНАЧЕ НДСсАвансовОстатки.НДСОстаток - ЕСТЬNULL(НДСНачисленныйОстатки.НДСОстаток, 0)
		|	КОНЕЦ КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА НДСсАвансовОстатки.НДСОстаток - ЕСТЬNULL(НДСНачисленныйОстатки.НДСОстаток, 0) = 0
		|			ТОГДА ВЫБОР
		|					КОГДА НДСсАвансовОстатки.НДСОстаток > 0
		|						ТОГДА &ТекстПолученныйАвансНеОтраженВКнигеПродаж
		|					ИНАЧЕ &ТекстКорректировкаКнигиПокупок
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА НДСсАвансовОстатки.СуммаБезНДСОстаток + НДСсАвансовОстатки.НДСОстаток > ЕСТЬNULL(НДСсАвансовОстатки.СуммаОстатокКт, 0)
		|					ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
		|				ИНАЧЕ &ТекстОплаченныеЦенностиНеРеализованы
		|			КОНЕЦ
		|	КОНЕЦ КАК ПризнакНаличияОшибок,
		|	&ТекстНеОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
		|	1 КАК КоличествоДокументов
		|ИЗ
		|	ВТНДСсАвансовПолученныхОстаткиИХозрасчетныйОстатки КАК НДСсАвансовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСНачисленныйСАвансовПолученныхОстатки КАК НДСНачисленныйОстатки
		|		ПО НДСсАвансовОстатки.СчетФактура = НДСНачисленныйОстатки.СчетФактура
		|			И НДСсАвансовОстатки.СтавкаНДС = НДСНачисленныйОстатки.СтавкаНДС
		|			И НДСсАвансовОстатки.ВидЦенности = НДСНачисленныйОстатки.ВидЦенности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО НДСсАвансовОстатки.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование";

		
	КонецЕсли;	
	
	ВычетСАвансовПолученныхНеВключенные = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоставКнигиПродаж.СчетФактура КАК СчетФактура,
	|	СоставКнигиПродаж.СтавкаНДС КАК СтавкаНДС,
	|	СоставКнигиПродаж.СуммаБезНДСОборот,
	|	СоставКнигиПродаж.НДСОборот
	|ПОМЕСТИТЬ ВТСоставКнигиПродажВЧастиАвансовПолученных
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыПолученные)) КАК СоставКнигиПродаж
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСсАвансовОстатки.СчетФактура КАК СчетФактура,
	|	НДСсАвансовОстатки.СтавкаНДС КАК СтавкаНДС,
	|	НДСсАвансовОстатки.СуммаБезНДСОстаток
	|ПОМЕСТИТЬ ВТНДСсАвансовПолученных
	|ИЗ
	|	РегистрНакопления.НДСсАвансов.Остатки(
	|			&НачалоСледующегоПериода,
	|			Организация В (&Организация)
	|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыПолученные)) КАК НДСсАвансовОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставКнигиПродаж.СуммаБезНДСОборот КАК Сумма,
	|	СоставКнигиПродаж.НДСОборот КАК СуммаНДС,
	|	СоставКнигиПродаж.СчетФактура КАК ДокументРегистратор,
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
	|	СоставКнигиПродаж.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА НДСсАвансовОстатки.СуммаБезНДСОстаток ЕСТЬ NULL 
	|			ТОГДА &ТекстНДСПринятКВычетуПолностью
	|		ИНАЧЕ &ТекстНДСПринятКВычетуЧастично
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	&ТекстОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
	|	1 КАК КоличествоДокументов
	|ИЗ
	|	ВТСоставКнигиПродажВЧастиАвансовПолученных КАК СоставКнигиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСсАвансовПолученных КАК НДСсАвансовОстатки
	|		ПО СоставКнигиПродаж.СчетФактура = НДСсАвансовОстатки.СчетФактура
	|			И СоставКнигиПродаж.СтавкаНДС = НДСсАвансовОстатки.СтавкаНДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО СоставКнигиПродаж.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование";
	
	ВычетСАвансовПолученныхВключенные = Запрос.Выполнить().Выгрузить();
	
	ВнешнийНаборДанныхВычетСАвансовПолученных = Новый Структура;
	ВнешнийНаборДанныхВычетСАвансовПолученных.Вставить("ВычетСАвансовПолученныхВключенные",
													   ВычетСАвансовПолученныхВключенные);
	ВнешнийНаборДанныхВычетСАвансовПолученных.Вставить("ВычетСАвансовПолученныхНеВключенные",
													   ВычетСАвансовПолученныхНеВключенные);
	
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхВычетСАвансовПолученных", 
									 ВнешнийНаборДанныхВычетСАвансовПолученных);
	
	ВключенныеВБазу = ВычетСАвансовПолученныхВключенные.Итог("СуммаНДС");
	НеВключенныеВБазу = ВычетСАвансовПолученныхНеВключенные.Итог("СуммаНДС");
	
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	КоличествоЗаписей = ВычетСАвансовПолученныхВключенные.Количество() 
		+ ВычетСАвансовПолученныхНеВключенные.Количество();
	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);
	
	Возврат СтруктураВозвращаемыхПараметров;

КонецФункции // ПолучитьНаборДанныхВычетСАвансовПолученных()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	вычету НДС с авансов выданных
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхВычетСАвансовВыданных(Запрос)
	
	Если ИдентификаторКонфигурации = "БП" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОстаткиИОбороты.Регистратор КАК ДокументРегистратор,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.СуммаОборотДт - ХозрасчетныйОстаткиИОбороты.СуммаОборотДт * 18 / 118 КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.СуммаОборотДт * 18 / 118 КАК ЧИСЛО(15, 2)) КАК СуммаНДС
		|ПОМЕСТИТЬ ВТАвансыВыданныеВременнаяТаблица
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериодаГраница, Регистратор, , Счет В ИЕРАРХИИ (&СписокСчетовАвансовВыданных), , Организация В (&Организация)) КАК ХозрасчетныйОстаткиИОбороты
		|ГДЕ
		|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт > 0
		|	И ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.СписаниеСРасчетногоСчета
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументРегистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТАвансыВыданныеВременнаяТаблица.ДокументРегистратор КАК ДокументРегистратор,
		|	ВТАвансыВыданныеВременнаяТаблица.СтавкаНДС,
		|	ВТАвансыВыданныеВременнаяТаблица.Сумма,
		|	ВТАвансыВыданныеВременнаяТаблица.СуммаНДС,
		|	СчетаФактурыВыданные.Ссылка КАК СчетФактура
		|ПОМЕСТИТЬ ВТАвансыВыданные
		|ИЗ
		|	ВТАвансыВыданныеВременнаяТаблица КАК ВТАвансыВыданныеВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетаФактурыВыданные
		|		ПО (СчетаФактурыВыданные.ДокументОснование = ВТАвансыВыданныеВременнаяТаблица.ДокументРегистратор)
		|ГДЕ
		|	СчетаФактурыВыданные.Ссылка ЕСТЬ NULL 
		|	И ЕСТЬNULL(СчетаФактурыВыданные.Ссылка.ВидСчетаФактуры, ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НалоговыйАгент)) = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НалоговыйАгент)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументРегистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСЗаписиКнигиПокупокОбороты.СчетФактура КАК ДокументРегистратор,
		|	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС КАК СтавкаНДС,
		|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот КАК Сумма,
		|	НДСЗаписиКнигиПокупокОбороты.НДСОборот КАК СуммаНДС
		|ПОМЕСТИТЬ СоставКнигиПокупокВЧастиАвансов
		|ИЗ
		|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
		|			&НачалоПериода,
		|			&КонецПериодаГраница,
		|			,
		|			Организация В (&Организация)
		|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК НДСЗаписиКнигиПокупокОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументРегистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСПредъявленныйОстатки.СчетФактура КАК СчетФактура,
		|	НДСПредъявленныйОстатки.СтавкаНДС,
		|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток,
		|	НДСПредъявленныйОстатки.НДСОстаток
		|ПОМЕСТИТЬ ВТНДСПредъявленныйСАвансовВыданных
		|ИЗ
		|	РегистрНакопления.НДСПредъявленный.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК НДСПредъявленныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.ДокументРегистратор, Авансы.ДокументРегистратор) КАК ДокументРегистратор,
		|	СчетФактураПолученныйДокументыОснования.Ссылка КАК СчетФактура,
		|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)) КАК СтавкаНДС,
		|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.Сумма, Авансы.Сумма) КАК Сумма,
		|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СуммаНДС, Авансы.СуммаНДС) КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА СчетФактураПолученныйДокументыОснования.Ссылка ЕСТЬ NULL 
		|			ТОГДА &ТекстВыданныйАвансБезСФ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
		|					ТОГДА ВЫБОР
		|							КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
		|								ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
		|							ИНАЧЕ ВЫБОР
		|									КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
		|										ТОГДА &ТекстБезОшибок
		|									ИНАЧЕ ВЫБОР
		|											КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор.Проведен
		|												ТОГДА &ТекстБезОшибок
		|											ИНАЧЕ &ТекстСФНаАвансПоНепроведенномуПоручению
		|										КОНЕЦ
		|								КОНЕЦ
		|						КОНЕЦ
		|				ИНАЧЕ &ТекстСФНаВыданныйАвансНеПроведен
		|			КОНЕЦ
		|	КОНЕЦ КАК ПризнакНаличияОшибок,
		|	ВЫБОР
		|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
		|			ТОГДА &ТекстНеОтраженыВКнигеПокупок
		|		ИНАЧЕ &ТекстОтраженыВКнигеПокупок
		|	КОНЕЦ КАК ПризнакОтраженияНДС,
		|	ВЫБОР
		|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
		|			ТОГДА ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СуммаНДС, Авансы.СуммаНДС)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаНеВключеннаяВБазу,
		|	ВЫБОР
		|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СуммаНДС, Авансы.СуммаНДС)
		|	КОНЕЦ КАК СуммаВключеннаяВБазу,
		|	1 КАК КоличествоДокументов,
		|	ВЫБОР
		|		КОГДА СчетФактураПолученныйДокументыОснования.Ссылка ЕСТЬ NULL 
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
		|					ТОГДА ВЫБОР
		|							КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
		|								ТОГДА 0
		|							ИНАЧЕ ВЫБОР
		|									КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
		|										ТОГДА 0
		|									ИНАЧЕ ВЫБОР
		|											КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор.Проведен
		|												ТОГДА 0
		|											ИНАЧЕ 1
		|										КОНЕЦ
		|								КОНЕЦ
		|						КОНЕЦ
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК КоличествоОшибок
		|ИЗ
		|	ВТАвансыВыданные КАК Авансы
		|		ПОЛНОЕ СОЕДИНЕНИЕ СоставКнигиПокупокВЧастиАвансов КАК СоставКнигиПродажВЧастиАвансов
		|		ПО Авансы.ДокументРегистратор = СоставКнигиПродажВЧастиАвансов.ДокументРегистратор
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ПО (Авансы.ДокументРегистратор = СчетФактураПолученныйДокументыОснования.ДокументОснование
		|				ИЛИ СоставКнигиПродажВЧастиАвансов.ДокументРегистратор = СчетФактураПолученныйДокументыОснования.ДокументОснование)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	НДСПредъявленныйОстатки.СчетФактура,
		|	СчетФактураПолученныйДокументыОснования.Ссылка,
		|	НДСПредъявленныйОстатки.СтавкаНДС,
		|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток,
		|	НДСПредъявленныйОстатки.НДСОстаток,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.НДСОстаток > 0
		|			ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
		|		ИНАЧЕ &ТекстКорректировкаКнигиПокупок
		|	КОНЕЦ,
		|	&ТекстНеОтраженыВКнигеПокупок,
		|	НДСПредъявленныйОстатки.НДСОстаток,
		|	0,
		|	1,
		|	0
		|ИЗ
		|	ВТНДСПредъявленныйСАвансовВыданных КАК НДСПредъявленныйОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ПО НДСПредъявленныйОстатки.СчетФактура = СчетФактураПолученныйДокументыОснования.ДокументОснование";
		
	Иначе
		
		Если РедакцияКонфигурации = "1.2" ИЛИ РедакцияКонфигурации = "1.0" Тогда
			
			Запрос.Текст = "ВЫБРАТЬ
			|	ХозрасчетныйОстаткиИОбороты.Регистратор КАК ДокументРегистратор,
			|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
			|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.СуммаОборотДт - ХозрасчетныйОстаткиИОбороты.СуммаОборотДт * 18 / 118 КАК ЧИСЛО(15, 2)) КАК Сумма,
			|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.СуммаОборотДт * 18 / 118 КАК ЧИСЛО(15, 2)) КАК СуммаНДС
			|ПОМЕСТИТЬ ВТАвансыВыданные
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериодаГраница, Регистратор, , Счет В ИЕРАРХИИ (&СписокСчетовАвансовВыданных), , Организация В (&Организация)) КАК ХозрасчетныйОстаткиИОбороты
			|ГДЕ
			|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт > 0
			|	И (ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
			|		ИЛИ ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежныйОрдерСписаниеДенежныхСредств)
			|ИНДЕКСИРОВАТЬ ПО
			|	ДокументРегистратор
            |;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НДСЗаписиКнигиПокупокОбороты.СчетФактура КАК ДокументРегистратор,
			|	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС КАК СтавкаНДС,
			|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот КАК Сумма,
			|	НДСЗаписиКнигиПокупокОбороты.НДСОборот КАК СуммаНДС
			|ПОМЕСТИТЬ СоставКнигиПокупокВЧастиАвансов
			|ИЗ
			|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
			|			&НачалоПериода,
			|			&КонецПериодаГраница,
			|			,
			|			Организация В (&Организация)
			|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК НДСЗаписиКнигиПокупокОбороты
			|ИНДЕКСИРОВАТЬ ПО
			|	ДокументРегистратор
            |;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НДСПредъявленныйОстатки.СчетФактура КАК СчетФактура,
			|	НДСПредъявленныйОстатки.СтавкаНДС,
			|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток,
			|	НДСПредъявленныйОстатки.НДСОстаток
			|ПОМЕСТИТЬ ВТНДСПредъявленныйСАвансовВыданных
			|ИЗ
			|	РегистрНакопления.НДСПредъявленный.Остатки(
			|			&НачалоСледующегоПериода,
			|			Организация В (&Организация)
			|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК НДСПредъявленныйОстатки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	СчетФактура
			|;
			|////////////////////////////////////////////////////////////////////////////////
            |ВЫБРАТЬ
			|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.ДокументРегистратор, Авансы.ДокументРегистратор) КАК ДокументРегистратор,
			|	СчетФактураПолученныйДокументыОснования.Ссылка КАК СчетФактура,
			|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)) КАК СтавкаНДС,
			|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.Сумма, Авансы.Сумма) КАК Сумма,
			|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СуммаНДС, Авансы.СуммаНДС) КАК СуммаНДС,
			|	ВЫБОР
			|		КОГДА СчетФактураПолученныйДокументыОснования.Ссылка ЕСТЬ NULL 
			|			ТОГДА &ТекстВыданныйАвансБезСФ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
			|					ТОГДА ВЫБОР
			|							КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
			|								ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
			|							ИНАЧЕ ВЫБОР
			|									КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
			|										ТОГДА &ТекстБезОшибок
			|									ИНАЧЕ ВЫБОР
			|											КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор.Проведен
			|												ТОГДА &ТекстБезОшибок
			|											ИНАЧЕ &ТекстСФНаАвансПоНепроведенномуПоручению
			|										КОНЕЦ
			|								КОНЕЦ
			|						КОНЕЦ
			|				ИНАЧЕ &ТекстСФНаВыданныйАвансНеПроведен
			|			КОНЕЦ
			|	КОНЕЦ КАК ПризнакНаличияОшибок,
            |	ВЫБОР
			|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
			|			ТОГДА &ТекстНеОтраженыВКнигеПокупок
			|		ИНАЧЕ &ТекстОтраженыВКнигеПокупок
			|	КОНЕЦ КАК ПризнакОтраженияНДС,
			|	ВЫБОР
			|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
			|			ТОГДА ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СуммаНДС, Авансы.СуммаНДС)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаНеВключеннаяВБазу,
			|	ВЫБОР
			|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
			|			ТОГДА 0
			|		ИНАЧЕ ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СуммаНДС, Авансы.СуммаНДС)
			|	КОНЕЦ КАК СуммаВключеннаяВБазу,
			|	1 КАК КоличествоДокументов,
			|	ВЫБОР
			|		КОГДА СчетФактураПолученныйДокументыОснования.Ссылка ЕСТЬ NULL 
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
			|					ТОГДА ВЫБОР
			|							КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
			|								ТОГДА 0
			|							ИНАЧЕ ВЫБОР
			|									КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
			|										ТОГДА 0
			|									ИНАЧЕ ВЫБОР
			|											КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор.Проведен
			|												ТОГДА 0
			|											ИНАЧЕ 1
			|										КОНЕЦ
			|								КОНЕЦ
			|						КОНЕЦ
			|				ИНАЧЕ 0
			|			КОНЕЦ
			|	КОНЕЦ КАК КоличествоОшибок
            |ИЗ
			|	ВТАвансыВыданные КАК Авансы
			|		ПОЛНОЕ СОЕДИНЕНИЕ СоставКнигиПокупокВЧастиАвансов КАК СоставКнигиПродажВЧастиАвансов
			|		ПО Авансы.ДокументРегистратор = СоставКнигиПродажВЧастиАвансов.ДокументРегистратор
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
			|		ПО (Авансы.ДокументРегистратор = СчетФактураПолученныйДокументыОснования.ДокументОснование
			|				ИЛИ СоставКнигиПродажВЧастиАвансов.ДокументРегистратор = СчетФактураПолученныйДокументыОснования.ДокументОснование)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	НДСПредъявленныйОстатки.СчетФактура,
			|	СчетФактураПолученныйДокументыОснования.Ссылка,
			|	НДСПредъявленныйОстатки.СтавкаНДС,
			|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток,
			|	НДСПредъявленныйОстатки.НДСОстаток,
			|	ВЫБОР
			|		КОГДА НДСПредъявленныйОстатки.НДСОстаток > 0
			|			ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
			|		ИНАЧЕ &ТекстКорректировкаКнигиПокупок
			|	КОНЕЦ,
			|	&ТекстНеОтраженыВКнигеПокупок,
			|	НДСПредъявленныйОстатки.НДСОстаток,
			|	0,
			|	1,
			|	0
			|ИЗ
			|	ВТНДСПредъявленныйСАвансовВыданных КАК НДСПредъявленныйОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
			|		ПО НДСПредъявленныйОстатки.СчетФактура = СчетФактураПолученныйДокументыОснования.ДокументОснование";
		
					
		Иначе
	
		
			Запрос.Текст = "ВЫБРАТЬ
			|	ХозрасчетныйОстаткиИОбороты.Регистратор КАК ДокументРегистратор,
			|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
			|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.СуммаОборотДт - ХозрасчетныйОстаткиИОбороты.СуммаОборотДт * 18 / 118 КАК ЧИСЛО(15, 2)) КАК Сумма,
			|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.СуммаОборотДт * 18 / 118 КАК ЧИСЛО(15, 2)) КАК СуммаНДС
			|ПОМЕСТИТЬ ВТАвансыВыданныеВременнаяТаблица
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериодаГраница, Регистратор, , Счет В ИЕРАРХИИ (&СписокСчетовАвансовВыданных), , Организация В (&Организация)) КАК ХозрасчетныйОстаткиИОбороты
			|ГДЕ
			|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт > 0
			|	И (ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее
			|		ИЛИ ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПлатежныйОрдерСписаниеДенежныхСредств)
			|ИНДЕКСИРОВАТЬ ПО
			|	ДокументРегистратор
            |;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТАвансыВыданныеВременнаяТаблица.ДокументРегистратор,
			|	ВТАвансыВыданныеВременнаяТаблица.СтавкаНДС,
			|	ВТАвансыВыданныеВременнаяТаблица.Сумма,
			|	ВТАвансыВыданныеВременнаяТаблица.СуммаНДС,
			|	СчетаФактурыВыданные.Ссылка КАК СчетФактура
			|ПОМЕСТИТЬ ВТАвансыВыданные
			|ИЗ
			|	ВТАвансыВыданныеВременнаяТаблица КАК ВТАвансыВыданныеВременнаяТаблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетаФактурыВыданные
			|		ПО (СчетаФактурыВыданные.ДокументОснование = ВТАвансыВыданныеВременнаяТаблица.ДокументРегистратор)
			|ГДЕ
			|	СчетаФактурыВыданные.Ссылка ЕСТЬ NULL 
			|	И ЕСТЬNULL(СчетаФактурыВыданные.Ссылка.ВидСчетаФактуры, ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НалоговыйАгент)) = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НалоговыйАгент)
			|ИНДЕКСИРОВАТЬ ПО
			|	ДокументРегистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НДСЗаписиКнигиПокупокОбороты.СчетФактура КАК ДокументРегистратор,
			|	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС КАК СтавкаНДС,
			|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот КАК Сумма,
			|	НДСЗаписиКнигиПокупокОбороты.НДСОборот КАК СуммаНДС
			|ПОМЕСТИТЬ СоставКнигиПокупокВЧастиАвансов
			|ИЗ
			|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
			|			&НачалоПериода,
			|			&КонецПериодаГраница,
			|			,
			|			Организация В (&Организация)
			|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК НДСЗаписиКнигиПокупокОбороты
			|ИНДЕКСИРОВАТЬ ПО
			|	ДокументРегистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НДСПредъявленныйОстатки.СчетФактура КАК СчетФактура,
			|	НДСПредъявленныйОстатки.СтавкаНДС,
			|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток,
			|	НДСПредъявленныйОстатки.НДСОстаток
			|ПОМЕСТИТЬ ВТНДСПредъявленныйСАвансовВыданных
			|ИЗ
			|	РегистрНакопления.НДСПредъявленный.Остатки(
			|			&НачалоСледующегоПериода,
			|			Организация В (&Организация)
			|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК НДСПредъявленныйОстатки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	СчетФактура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.ДокументРегистратор, Авансы.ДокументРегистратор) КАК ДокументРегистратор,
			|	СчетФактураПолученныйДокументыОснования.Ссылка КАК СчетФактура,
			|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)) КАК СтавкаНДС,
			|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.Сумма, Авансы.Сумма) КАК Сумма,
			|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СуммаНДС, Авансы.СуммаНДС) КАК СуммаНДС,
			|	ВЫБОР
			|		КОГДА СчетФактураПолученныйДокументыОснования.Ссылка ЕСТЬ NULL 
			|			ТОГДА &ТекстВыданныйАвансБезСФ
			|		ИНАЧЕ ВЫБОР
			|				КОГДА СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
			|					ТОГДА ВЫБОР
			|							КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
			|								ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
			|							ИНАЧЕ ВЫБОР
			|									КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
			|										ТОГДА &ТекстБезОшибок
			|									ИНАЧЕ ВЫБОР
			|											КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор.Проведен
			|												ТОГДА &ТекстБезОшибок
			|											ИНАЧЕ &ТекстСФНаАвансПоНепроведенномуПоручению
			|										КОНЕЦ
			|								КОНЕЦ
			|						КОНЕЦ
			|				ИНАЧЕ &ТекстСФНаВыданныйАвансНеПроведен
			|			КОНЕЦ
			|	КОНЕЦ КАК ПризнакНаличияОшибок,
			|	ВЫБОР
			|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
			|			ТОГДА &ТекстНеОтраженыВКнигеПокупок
			|		ИНАЧЕ &ТекстОтраженыВКнигеПокупок
			|	КОНЕЦ КАК ПризнакОтраженияНДС,
			|	ВЫБОР
			|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
			|			ТОГДА ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СуммаНДС, Авансы.СуммаНДС)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК СуммаНеВключеннаяВБазу,
			|	ВЫБОР
			|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
			|			ТОГДА 0
			|		ИНАЧЕ ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СуммаНДС, Авансы.СуммаНДС)
			|	КОНЕЦ КАК СуммаВключеннаяВБазу,
			|	1 КАК КоличествоДокументов,
			|	ВЫБОР
			|		КОГДА СчетФактураПолученныйДокументыОснования.Ссылка ЕСТЬ NULL 
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|				КОГДА СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
			|					ТОГДА ВЫБОР
			|							КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
			|								ТОГДА 0
			|							ИНАЧЕ ВЫБОР
			|									КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
			|										ТОГДА 0
			|									ИНАЧЕ ВЫБОР
			|											КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор.Проведен
			|												ТОГДА 0
			|											ИНАЧЕ 1
			|										КОНЕЦ
			|								КОНЕЦ
			|						КОНЕЦ
			|				ИНАЧЕ 0
			|			КОНЕЦ
			|	КОНЕЦ КАК КоличествоОшибок
			|ИЗ
			|	ВТАвансыВыданные КАК Авансы
			|		ПОЛНОЕ СОЕДИНЕНИЕ СоставКнигиПокупокВЧастиАвансов КАК СоставКнигиПродажВЧастиАвансов
			|		ПО Авансы.ДокументРегистратор = СоставКнигиПродажВЧастиАвансов.ДокументРегистратор
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
			|		ПО (Авансы.ДокументРегистратор = СчетФактураПолученныйДокументыОснования.ДокументОснование
			|				ИЛИ СоставКнигиПродажВЧастиАвансов.ДокументРегистратор = СчетФактураПолученныйДокументыОснования.ДокументОснование)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	НДСПредъявленныйОстатки.СчетФактура,
			|	СчетФактураПолученныйДокументыОснования.Ссылка,
			|	НДСПредъявленныйОстатки.СтавкаНДС,
			|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток,
			|	НДСПредъявленныйОстатки.НДСОстаток,
			|	ВЫБОР
			|		КОГДА НДСПредъявленныйОстатки.НДСОстаток > 0
			|			ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
			|		ИНАЧЕ &ТекстКорректировкаКнигиПокупок
			|	КОНЕЦ,
			|	&ТекстНеОтраженыВКнигеПокупок,
			|	НДСПредъявленныйОстатки.НДСОстаток,
			|	0,
			|	1,
			|	0
			|ИЗ
			|	ВТНДСПредъявленныйСАвансовВыданных КАК НДСПредъявленныйОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
			|		ПО НДСПредъявленныйОстатки.СчетФактура = СчетФактураПолученныйДокументыОснования.ДокументОснование";
			
		КонецЕсли;	
		
	КонецЕсли;	
		
	ВычетСАвансовВыданных = Запрос.Выполнить().Выгрузить();
	
	ВнешнийНаборДанныхВычетСАвансовВыданных = Новый Структура;
	ВнешнийНаборДанныхВычетСАвансовВыданных.Вставить("ВычетСАвансовВыданных", ВычетСАвансовВыданных);
	
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхВычетСАвансовВыданных", ВнешнийНаборДанныхВычетСАвансовВыданных);
	
	ВключенныеВБазу = ВычетСАвансовВыданных.Итог("СуммаВключеннаяВБазу");
	НеВключенныеВБазу = ВычетСАвансовВыданных.Итог("СуммаНеВключеннаяВБазу");
		
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	Если ВычетСАвансовВыданных.Итог("КоличествоОшибок") > 0 Тогда
		СтруктураВозвращаемыхПараметров.Вставить("НаличиеОшибок", Истина);
	КонецЕсли;	
	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", ВычетСАвансовВыданных.Количество() > 0);

	Возврат СтруктураВозвращаемыхПараметров;

КонецФункции // ПолучитьНаборДанныхВычетСАвансовВыданных()

//	Наборы при упрощенном учете НДС

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	начисленному НДС при реализации в случае ведения упрощенного учета НДС
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхНачислениеРеализацияУпрощенныйУчетНДС(Запрос)
        	    
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КнигаПродаж.СчетФактура КАК СчетФактура,
	|	КнигаПродаж.СтавкаНДС КАК СтавкаНДС,
	|	КнигаПродаж.СуммаБезНДСОборот КАК Сумма,
	|	КнигаПродаж.НДСОборот КАК СуммаНДС
	|ПОМЕСТИТЬ ВТСоставКнигиПродаж
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе))) КАК КнигаПродаж
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслугТовары.Номенклатура) КАК НоменклатураКоличество
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.СтавкаНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) КАК НоменклатураКоличество
	|ПОМЕСТИТЬ СписокТоваров
	|ИЗ
	|	ТаблицаТоваров КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) > 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслугУслуги.Номенклатура) КАК НоменклатураКоличество
	|ПОМЕСТИТЬ ТаблицаУслуг
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугУслуги.Номенклатура,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) КАК НоменклатураКоличество
	|ПОМЕСТИТЬ СписокУслуг
	|ИЗ
	|	ТаблицаУслуг КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) > 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ НеверныеСтавки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокТоваров КАК СписокНоменклатуры)
	|	И РеализацияТоваровУслугТовары.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугУслуги.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокУслуг КАК СписокНоменклатуры)
	|	И РеализацияТоваровУслугУслуги.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НеверныеСтавкиНДС.Ссылка КАК ДокументРегистратор,
	|	НеверныеСтавкиНДС.СтавкаНДС,
	|	0 КАК РангОшибки
	|ПОМЕСТИТЬ ВТОперацииСОшибками
	|ИЗ
	|	НеверныеСтавки КАК НеверныеСтавкиНДС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КнигаПродаж.СчетФактура,
	|	КнигаПродаж.СтавкаНДС,
	|	3
	|ИЗ
	|	ВТСоставКнигиПродаж КАК КнигаПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданный
	|		ПО (СчетФактураВыданный.ДокументОснование = КнигаПродаж.СчетФактура)
	|ГДЕ
	|	СчетФактураВыданный.Ссылка ЕСТЬ NULL 
	|	И (НЕ КнигаПродаж.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах)
	|	И (НЕ КнигаПродаж.СчетФактура ССЫЛКА Документ.ПриходныйКассовыйОрдер)
	|	И (НЕ КнигаПродаж.СчетФактура ССЫЛКА Документ.СчетФактураВыданный)
	|	И (НЕ КнигаПродаж.СчетФактура ССЫЛКА Документ.КорректировочныйСчетФактураВыданный)
	|	И (НЕ КнигаПродаж.СчетФактура ССЫЛКА Документ.КорректировочныйСчетФактураПолученный)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КнигаПродаж.СчетФактура,
	|	КнигаПродаж.СтавкаНДС,
	|	2
	|ИЗ
	|	ВТСоставКнигиПродаж КАК КнигаПродаж
	|ГДЕ
	|	ВЫБОР
	|			КОГДА (НЕ ВЫРАЗИТЬ(КнигаПродаж.СчетФактура.ДоговорКонтрагента КАК Справочник.ДоговорыКонтрагентов) ЕСТЬ NULL )
	|				ТОГДА ВЫРАЗИТЬ(КнигаПродаж.СчетФактура.ДоговорКонтрагента КАК Справочник.ДоговорыКонтрагентов).РеализацияНаЭкспорт
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И КнигаПродаж.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСоставКнигиПродаж.СчетФактура КАК СчетФактура,
	|	ВТСоставКнигиПродаж.СтавкаНДС,
	|	ВТОперацииСОшибками.ДокументРегистратор,
	|	МИНИМУМ(ВТСоставКнигиПродаж.Сумма) КАК Сумма,
	|	МИНИМУМ(ВТСоставКнигиПродаж.СуммаНДС) КАК СуммаНДС,
	|	МИНИМУМ(ВТОперацииСОшибками.РангОшибки) КАК РангОшибки
	|ПОМЕСТИТЬ ВТПроведеноРанжированиеОшибок
	|ИЗ
	|	ВТСоставКнигиПродаж КАК ВТСоставКнигиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОперацииСОшибками КАК ВТОперацииСОшибками
	|		ПО ВТСоставКнигиПродаж.СчетФактура = ВТОперацииСОшибками.ДокументРегистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСоставКнигиПродаж.СчетФактура,
	|	ВТСоставКнигиПродаж.СтавкаНДС,
	|	ВТОперацииСОшибками.ДокументРегистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаРеализацию)
	|			ТОГДА NULL
	|		ИНАЧЕ СчетФактураВыданныйДокументыОснования.Ссылка.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДССчетаФактуры
	|ПОМЕСТИТЬ ВТСчетФактураВыданныйДокументыОснования
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Организация В(&Организация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
	|	ВТПроведеноРанжированиеОшибок.СтавкаНДС,
	|	ВТПроведеноРанжированиеОшибок.СчетФактура КАК ДокументРегистратор,
	|	ВТПроведеноРанжированиеОшибок.Сумма,
	|	ВТПроведеноРанжированиеОшибок.СуммаНДС,
	|	1 КАК КоличествоДокументов,
	|	ВЫБОР
	|		КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки ЕСТЬ NULL 
	|			ТОГДА &ТекстБезОшибок
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки = 0
	|					ТОГДА &ТекстОшибкаРеализацияПоРазнымСтавкам
	|				КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки = 1
	|					ТОГДА &ТекстОшибкаРеализацияЕНВДСНДС
	|				КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки = 2
	|					ТОГДА &ТекстОшибкаРеализацияЭкспортСНДС
	|				КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки = 3
	|					ТОГДА &ТекстОшибкаРеализацияБезСФ
	|			КОНЕЦ
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	ВЫБОР
	|		КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки = 0
	|			ТОГДА &ТекстСноска
	|		ИНАЧЕ &ТекстНетСноски
	|	КОНЕЦ КАК СимволСноски,
	|	&ТекстОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС,
	|	ВЫБОР
	|		КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоОшибок
	|ИЗ
	|	ВТПроведеноРанжированиеОшибок КАК ВТПроведеноРанжированиеОшибок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСчетФактураВыданныйДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ВТПроведеноРанжированиеОшибок.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|			И (ВТПроведеноРанжированиеОшибок.СтавкаНДС = ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.СтавкаНДССчетаФактуры, ВТПроведеноРанжированиеОшибок.СтавкаНДС))";
	
	НачислениеРеализацияУпрощенныйУчетНДСВключенные = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктОбОказанииПроизводственныхУслуг.Ссылка КАК ДокументРегистратор,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(АктОбОказанииПроизводственныхУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(АктОбОказанииПроизводственныхУслуг.СуммаДокумента - АктОбОказанииПроизводственныхУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	&ПустаяСсылкаНаСчетФактуруВыданный КАК СчетФактура,
	|	1 КАК КоличествоДокументов,
	|	&ТекстНДСНеУчитывается КАК ПризнакНаличияОшибок,
	|	&ТекстНеОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС
	|ИЗ
	|	Документ.АктОбОказанииПроизводственныхУслуг КАК АктОбОказанииПроизводственныхУслуг
	|ГДЕ
	|	(НЕ АктОбОказанииПроизводственныхУслуг.УчитыватьНДС)
	|	И АктОбОказанииПроизводственныхУслуг.Проведен
	|	И АктОбОказанииПроизводственныхУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И АктОбОказанииПроизводственныхУслуг.Организация В(&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровПоставщику.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
	|	ВЫРАЗИТЬ(ВозвратТоваровПоставщику.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ВозвратТоваровПоставщику.СуммаДокумента - ВозвратТоваровПоставщику.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	&ПустаяСсылкаНаСчетФактуруВыданный,
	|	1,
	|	&ТекстНДСНеУчитывается,
	|	&ТекстНеОтраженыВКнигеПродаж
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	|ГДЕ
	|	(НЕ ВозвратТоваровПоставщику.УчитыватьНДС)
	|	И ВозвратТоваровПоставщику.Проведен
	|	И ВозвратТоваровПоставщику.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВозвратТоваровПоставщику.Организация В(&Организация)
	|	И ВозвратТоваровПоставщику.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВозвратТоваровПоставщику.ИзПереработки)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетКомиссионераОПродажах.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
	|	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажах.СуммаДокумента - ОтчетКомиссионераОПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	&ПустаяСсылкаНаСчетФактуруВыданный,
	|	1,
	|	&ТекстНДСНеУчитывается,
	|	&ТекстНеОтраженыВКнигеПродаж
	|ИЗ
	|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
	|ГДЕ
	|	(НЕ ОтчетКомиссионераОПродажах.УчитыватьНДС)
	|	И ОтчетКомиссионераОПродажах.Проведен
	|	И ОтчетКомиссионераОПродажах.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ОтчетКомиссионераОПродажах.Организация В(&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетКомитентуОПродажах.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
	|	ВЫРАЗИТЬ(ОтчетКомитентуОПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ОтчетКомитентуОПродажах.СуммаДокумента - ОтчетКомитентуОПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	&ПустаяСсылкаНаСчетФактуруВыданный,
	|	1,
	|	&ТекстНДСНеУчитывается,
	|	&ТекстНеОтраженыВКнигеПродаж
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
	|ГДЕ
	|	(НЕ ОтчетКомитентуОПродажах.УчитыватьНДС)
	|	И ОтчетКомитентуОПродажах.Проведен
	|	И ОтчетКомитентуОПродажах.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ОтчетКомитентуОПродажах.Организация В(&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетОРозничныхПродажах.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
	|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажах.СуммаДокумента - ОтчетОРозничныхПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	&ПустаяСсылкаНаСчетФактуруВыданный,
	|	1,
	|	&ТекстНДСНеУчитывается,
	|	&ТекстНеОтраженыВКнигеПродаж
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|ГДЕ
	|	(НЕ ОтчетОРозничныхПродажах.УчитыватьНДС)
	|	И ОтчетОРозничныхПродажах.Проведен
	|	И ОтчетОРозничныхПродажах.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ОтчетОРозничныхПродажах.Организация В(&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПередачаНМА.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
	|	ВЫРАЗИТЬ(ПередачаНМА.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ПередачаНМА.СуммаДокумента - ПередачаНМА.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	&ПустаяСсылкаНаСчетФактуруВыданный,
	|	1,
	|	&ТекстНДСНеУчитывается,
	|	&ТекстНеОтраженыВКнигеПродаж
	|ИЗ
	|	Документ.ПередачаНМА КАК ПередачаНМА
	|ГДЕ
	|	(НЕ ПередачаНМА.УчитыватьНДС)
	|	И ПередачаНМА.Проведен
	|	И ПередачаНМА.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПередачаНМА.Организация В(&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПередачаОС.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
	|	ВЫРАЗИТЬ(ПередачаОС.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ПередачаОС.СуммаДокумента - ПередачаОС.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	&ПустаяСсылкаНаСчетФактуруВыданный,
	|	1,
	|	&ТекстНДСНеУчитывается,
	|	&ТекстНеОтраженыВКнигеПродаж
	|ИЗ
	|	Документ.ПередачаОС КАК ПередачаОС
	|ГДЕ
	|	(НЕ ПередачаОС.УчитыватьНДС)
	|	И ПередачаОС.Проведен
	|	И ПередачаОС.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПередачаОС.Организация В(&Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
	|	ВЫРАЗИТЬ(РеализацияТоваровУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(РеализацияТоваровУслуг.СуммаДокумента - РеализацияТоваровУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	&ПустаяСсылкаНаСчетФактуруВыданный,
	|	1,
	|	&ТекстНДСНеУчитывается,
	|	&ТекстНеОтраженыВКнигеПродаж
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (НЕ РеализацияТоваровУслуг.УчитыватьНДС)
	|	И РеализацияТоваровУслуг.Организация В(&Организация)";
		
	НачислениеРеализацияУпрощенныйУчетНДСНеВключенные = Запрос.Выполнить().Выгрузить();
	
	//	Расшифровка ошибки "Реализация одной номенклатуры по разным ставкам"
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугТовары.Ссылка КАК ОшДокументРегистратор,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК ОшСтавкаНДС,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК ОшНоменклатура,
	|	1 КАК ОшКоличествоДокументов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокТоваров КАК СписокНоменклатуры)
	|	И РеализацияТоваровУслугТовары.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС,
	|	РеализацияТоваровУслугУслуги.Номенклатура,
	|	1
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугУслуги.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокУслуг КАК СписокНоменклатуры)
	|	И РеализацияТоваровУслугУслуги.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)";
			
	НачисленияПоРеализацииОшибки = Запрос.Выполнить().Выгрузить();

		
	ВключенныеВБазу = НачислениеРеализацияУпрощенныйУчетНДСВключенные.Итог("СуммаНДС");
	НеВключенныеВБазу = НачислениеРеализацияУпрощенныйУчетНДСНеВключенные.Итог("СуммаНДС");
	
	ВнешнийНаборДанныхНачислениеРеализацияУпрощенныйУчетНДС = Новый Структура;
	ВнешнийНаборДанныхНачислениеРеализацияУпрощенныйУчетНДС.Вставить("НачислениеРеализацияУпрощенныйУчетНДСВключенные",
																	 НачислениеРеализацияУпрощенныйУчетНДСВключенные);
	ВнешнийНаборДанныхНачислениеРеализацияУпрощенныйУчетНДС.Вставить("НачислениеРеализацияУпрощенныйУчетНДСНеВключенные",
																	 НачислениеРеализацияУпрощенныйУчетНДСНеВключенные);
	ВнешнийНаборДанныхНачислениеРеализацияУпрощенныйУчетНДС.Вставить("Ошибка", НачисленияПоРеализацииОшибки);
																		
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхНачислениеРеализацияУпрощенныйУчетНДС",
									 ВнешнийНаборДанныхНачислениеРеализацияУпрощенныйУчетНДС);
		
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	Если НачислениеРеализацияУпрощенныйУчетНДСВключенные.Итог("КоличествоОшибок") > 0 Тогда
		СтруктураВозвращаемыхПараметров.Вставить("НаличиеОшибок", Истина);	
	КонецЕсли;	
	
	КоличествоЗаписей = НачислениеРеализацияУпрощенныйУчетНДСВключенные.Количество()
		+ НачислениеРеализацияУпрощенныйУчетНДСНеВключенные.Количество();
	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);
	
	Возврат СтруктураВозвращаемыхПараметров;	

КонецФункции // ПолучитьНаборДанныхНачислениеРеализацияУпрощенныйУчетНДС()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	начисленному НДС с полученных авансов в случае ведения упрощенного учета НДС
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхНачислениеАвансыПолученныеУпрощенныйУчетНДС(Запрос)

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоставКнигиПродаж.СчетФактура КАК СчетФактура,
	|	СоставКнигиПродаж.СтавкаНДС,
	|	СоставКнигиПродаж.СуммаБезНДСОборот,
	|	СоставКнигиПродаж.НДСОборот
	|ПОМЕСТИТЬ ВТСоставКнигиПродаж
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И ВидЦенности В (&ВидыЦенностейАвансыПолученные)) КАК СоставКнигиПродаж
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.СуммаОстатокКт - ХозрасчетныйОстатки.СуммаОстатокКт * 18 / 118 КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстатки.СуммаОстатокКт * 18 / 118 КАК ЧИСЛО(15, 2)) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТХозрасчетныйОстаткиАвансыПолученныеУпрощенныйУчет
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&КонецПериодаГраница,
	|			Счет В (&СписокСчетовАвансовПолученных),
	|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами),
	|			Организация В (&Организация)
	|				И (НЕ Субконто1 В
	|						(ВЫБРАТЬ
	|							КнигаПродаж.СчетФактура
	|						ИЗ
	|							ВТСоставКнигиПродаж КАК КнигаПродаж))) КАК ХозрасчетныйОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК ДокументРегистратор,
	|	ХозрасчетныйОстатки.Сумма КАК Сумма,
	|	ХозрасчетныйОстатки.СуммаНДС КАК СуммаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
	|	&ТекстНеОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL 
	|			ТОГДА &ТекстПолученныйАвансБезСФ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СчетФактураВыданныйДокументыОснования.Ссылка.Проведен
	|					ТОГДА &ТекстНачислениеНеОтраженоВКнигеПродаж
	|				ИНАЧЕ &ТекстСФНаПолученныйАвансНеПроведен
	|			КОНЕЦ
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	0 КАК СуммаВключенные,
	|	ХозрасчетныйОстатки.СуммаНДС КАК СуммаНеВключенные,
	|	1 КАК КоличествоДокументов
	|ИЗ
	|	ВТХозрасчетныйОстаткиАвансыПолученныеУпрощенныйУчет КАК ХозрасчетныйОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ХозрасчетныйОстатки.Субконто1 = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТСоставКнигиПродаж.СчетФактура,
	|	ВТСоставКнигиПродаж.СуммаБезНДСОборот,
	|	ВТСоставКнигиПродаж.НДСОборот,
	|	ВТСоставКнигиПродаж.СтавкаНДС,
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	&ТекстОтраженыВКнигеПродаж,
	|	&ТекстБезОшибок,
	|	ВТСоставКнигиПродаж.НДСОборот,
	|	0,
	|	1
	|ИЗ
	|	ВТСоставКнигиПродаж КАК ВТСоставКнигиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ВТСоставКнигиПродаж.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления";
	
	НачислениеАвансыПолученныеУпрощенныйУчетНДС = Запрос.Выполнить().Выгрузить();	
		
	ВключенныеВБазу = НачислениеАвансыПолученныеУпрощенныйУчетНДС.Итог("СуммаВключенные");
	НеВключенныеВБазу = НачислениеАвансыПолученныеУпрощенныйУчетНДС.Итог("СуммаНеВключенные");
	
	ВнешнийНаборДанныхНачислениеАвансыПолученныеУпрощенныйУчетНДС = Новый Структура;
	ВнешнийНаборДанныхНачислениеАвансыПолученныеУпрощенныйУчетНДС.Вставить("НачислениеАвансыПолученныеУпрощенныйУчетНДС",
																		   НачислениеАвансыПолученныеУпрощенныйУчетНДС);
																				
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхНачислениеАвансыПолученныеУпрощенныйУчетНДС",
									 ВнешнийНаборДанныхНачислениеАвансыПолученныеУпрощенныйУчетНДС);																				
	
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	 	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", 
											  НачислениеАвансыПолученныеУпрощенныйУчетНДС.Количество() > 0);
		
	Возврат СтруктураВозвращаемыхПараметров;	

КонецФункции // ПолучитьНаборДанныхНачислениеАвансыПолученныеУпрощенныйУчетНДС()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	начисленному НДС с выданных авансов (по факту поступления) в случае ведения упрощенного учета НДС
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхНачислениеВосстановлениеСАвансовВыданныхУпрощенныйУчетНДС(Запрос)

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1
	|ПОМЕСТИТЬ ВТХозрасчетныйОстаткиНДСпоАвансамИПредоплатамВыданным
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоСледующегоПериода, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСпоАвансамИПредоплатамВыданным), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СФПолученные), Организация В (&Организация)) КАК ХозрасчетныйОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	|	ХозрасчетныйОстатки.СуммаОстатокДт
	|ПОМЕСТИТЬ ВТХозрасчетныйОстаткиНДСпоАвансамПоСпискуСчетов
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоСледующегоПериода, Счет В (&СписокСчетовАвансовВыданных), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами), Организация В (&Организация)) КАК ХозрасчетныйОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПокупокОбороты.СчетФактура КАК СчетФактура,
	|	НДСЗаписиКнигиПокупокОбороты.ВидЦенности КАК ВидЦенности,
	|	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС КАК СтавкаНДС,
	|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот,
	|	НДСЗаписиКнигиПокупокОбороты.НДСОборот
	|ПОМЕСТИТЬ ВТЗаписиКнигиПокупокОборотыСАвансовВыданныхУпрощенныйУчет
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
	|			,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И СчетФактура В
	|					(ВЫБРАТЬ
	|						ХозрасчетныйОстатки.Субконто1 КАК СчетФактура
	|					ИЗ
	|						ВТХозрасчетныйОстаткиНДСпоАвансамИПредоплатамВыданным КАК ХозрасчетныйОстатки)
	|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК НДСЗаписиКнигиПокупокОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	ВидЦенности,
	|	СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПродажОбороты.Покупатель,
	|	НДСЗаписиКнигиПродажОбороты.ДоговорКонтрагента,
	|	НДСЗаписиКнигиПродажОбороты.СчетФактура КАК СчетФактура,
	|	НДСЗаписиКнигиПродажОбороты.ВидЦенности КАК ВидЦенности,
	|	НДСЗаписиКнигиПродажОбороты.СтавкаНДС КАК СтавкаНДС,
	|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот,
	|	НДСЗаписиКнигиПродажОбороты.НДСОборот
	|ПОМЕСТИТЬ ВТЗаписиКнигиПродажОборотыСАвансовВыданныхУпрощенныйУчет
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И СчетФактура В
	|					(ВЫБРАТЬ
	|						ХозрасчетныйОстатки.Субконто1 КАК СчетФактура
	|					ИЗ
	|						ВТХозрасчетныйОстаткиНДСпоАвансамИПредоплатамВыданным КАК ХозрасчетныйОстатки)
	|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК НДСЗаписиКнигиПродажОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	ВидЦенности,
	|	СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.СчетФактура, НДСЗаписиКнигиПродажОбороты.СчетФактура) КАК ДокументРегистратор,
	|	СУММА(ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот, 0) - ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот, 0)) КАК Сумма,
	|	СУММА(ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.НДСОборот, 0) - ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.НДСОборот, 0)) КАК СуммаНДС,
	|	ХозрасчетныйОстатки.СуммаОстатокДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот, 0) - ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот, 0) + ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.НДСОборот, 0) - ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.НДСОборот, 0) - ХозрасчетныйОстатки.СуммаОстатокДт = 0
	|			ТОГДА &ТекстОплаченныеЦенностиНеПоступили
	|		ИНАЧЕ &ТекстНачислениеНеОтраженоВКнигеПродаж
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	&ТекстНеОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС,
	|	1 КАК КоличествоДокументов,
	|	ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)) КАК СтавкаНДС
	|ИЗ
	|	ВТЗаписиКнигиПокупокОборотыСАвансовВыданныхУпрощенныйУчет КАК НДСЗаписиКнигиПокупокОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗаписиКнигиПродажОборотыСАвансовВыданныхУпрощенныйУчет КАК НДСЗаписиКнигиПродажОбороты
	|		ПО НДСЗаписиКнигиПокупокОбороты.СчетФактура = НДСЗаписиКнигиПродажОбороты.СчетФактура
	|			И НДСЗаписиКнигиПокупокОбороты.ВидЦенности = НДСЗаписиКнигиПродажОбороты.ВидЦенности
	|			И НДСЗаписиКнигиПокупокОбороты.СтавкаНДС = НДСЗаписиКнигиПродажОбороты.СтавкаНДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХозрасчетныйОстаткиНДСпоАвансамПоСпискуСчетов КАК ХозрасчетныйОстатки
	|		ПО НДСЗаписиКнигиПокупокОбороты.СчетФактура = ХозрасчетныйОстатки.Субконто1
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСЗаписиКнигиПродажОбороты.Покупатель,
	|	НДСЗаписиКнигиПродажОбороты.ДоговорКонтрагента,
	|	ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.СчетФактура, НДСЗаписиКнигиПродажОбороты.СчетФактура),
	|	НДСЗаписиКнигиПродажОбороты.ВидЦенности,
	|	ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)),
	|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот,
	|	НДСЗаписиКнигиПокупокОбороты.НДСОборот,
	|	ХозрасчетныйОстатки.СуммаОстатокДт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот, 0) - ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот, 0) + ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.НДСОборот, 0) - ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.НДСОборот, 0) - ХозрасчетныйОстатки.СуммаОстатокДт = 0
	|			ТОГДА &ТекстОплаченныеЦенностиНеПоступили
	|		ИНАЧЕ &ТекстНачислениеНеОтраженоВКнигеПродаж
	|	КОНЕЦ";  
	
	ВосстановлениеСАвансовВыданныхУпрощенныйУчетНДСНеВключенные = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст =
		
	"ВЫБРАТЬ
	|	НДСЗаписиКнигиПродаж.СчетФактура КАК СчетФактура,
	|	НДСЗаписиКнигиПродаж.СтавкаНДС,
	|	НДСЗаписиКнигиПродаж.СуммаБезНДСОборот,
	|	НДСЗаписиКнигиПродаж.НДСОборот
	|ПОМЕСТИТЬ ВТНДСЗаписиКнигиПродажОбороты
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК НДСЗаписиКнигиПродаж
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПродаж.СчетФактура КАК ДокументРегистратор,
	|	НДСЗаписиКнигиПродаж.СуммаБезНДСОборот КАК Сумма,
	|	НДСЗаписиКнигиПродаж.НДСОборот КАК СуммаНДС,
	|	ХозрасчетныйОстатки.СуммаОстатокДт,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.СуммаОстатокДт ЕСТЬ NULL 
	|			ТОГДА &ТекстНДСПолностьюВосстановлен
	|		ИНАЧЕ &ТекстНДСВосстановленЧастично
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	&ТекстОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС,
	|	1 КАК КоличествоДокументов,
	|	НДСЗаписиКнигиПродаж.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	ВТНДСЗаписиКнигиПродажОбороты КАК НДСЗаписиКнигиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХозрасчетныйОстаткиНДСпоАвансамПоСпискуСчетов КАК ХозрасчетныйОстатки
	|		ПО НДСЗаписиКнигиПродаж.СчетФактура = ХозрасчетныйОстатки.Субконто1";	
	
	ВосстановлениеСАвансовВыданныхУпрощенныйУчетНДСВключенные = Запрос.Выполнить().Выгрузить();
		
	ВключенныеВБазу = ВосстановлениеСАвансовВыданныхУпрощенныйУчетНДСВключенные.Итог("СуммаНДС");
	НеВключенныеВБазу = ВосстановлениеСАвансовВыданныхУпрощенныйУчетНДСНеВключенные.Итог("СуммаНДС");
	
	ВнешнийНаборДанныхНачислениеВосстановлениеСАвансовВыданныхУпрощенныйУчетНДС = Новый Структура;
	ВнешнийНаборДанныхНачислениеВосстановлениеСАвансовВыданныхУпрощенныйУчетНДС.Вставить("ВосстановлениеСАвансовВыданныхУпрощенныйУчетНДСНеВключенные",
																					     ВосстановлениеСАвансовВыданныхУпрощенныйУчетНДСНеВключенные);
	ВнешнийНаборДанныхНачислениеВосстановлениеСАвансовВыданныхУпрощенныйУчетНДС.Вставить("ВосстановлениеСАвансовВыданныхУпрощенныйУчетНДСВключенные",
																						 ВосстановлениеСАвансовВыданныхУпрощенныйУчетНДСВключенные);
																					
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхНачислениеВосстановлениеСАвансовВыданныхУпрощенныйУчетНДС",
									 ВнешнийНаборДанныхНачислениеВосстановлениеСАвансовВыданныхУпрощенныйУчетНДС);																					
																					
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	КоличествоЗаписей = ВосстановлениеСАвансовВыданныхУпрощенныйУчетНДСВключенные.Количество()
		+ ВосстановлениеСАвансовВыданныхУпрощенныйУчетНДСНеВключенные.Количество();
	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);
	
	Возврат СтруктураВозвращаемыхПараметров;		

КонецФункции // ПолучитьНаборДанныхНачислениеВосстановлениеСАвансовВыданныхУпрощенныйУчетНДС()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	начисленному НДС по прочим операциям в случае ведения упрощенного учета НДС
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхНачислениеДругиеОперацииУпрощенныйУчетНДС(Запрос)

	//	В данном разделе отражаются начисленные пользователем суммы НДС, кроме любых видов авансов
	
	Запрос.Текст = "ВЫБРАТЬ
	|	НДСЗаписиКнигиПродажОбороты.Регистратор КАК ДокументРегистратор,
	|	НДСЗаписиКнигиПродажОбороты.СтавкаНДС КАК СтавкаНДС,
	|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот КАК Сумма,
	|	НДСЗаписиКнигиПродажОбороты.НДСОборот КАК СуммаНДС
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			Регистратор,
	|			Организация В (&Организация)
	|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе))) КАК НДСЗаписиКнигиПродажОбороты
	|ГДЕ
	|	НДСЗаписиКнигиПродажОбороты.Регистратор ССЫЛКА Документ.ОтражениеНачисленияНДС";
	
	НачислениеДругиеОперацииУпрощенныйУчетНДС = Запрос.Выполнить().Выгрузить();
	
	ВключенныеВБазу = НачислениеДругиеОперацииУпрощенныйУчетНДС.Итог("СуммаНДС");
	НеВключенныеВБазу = 0;
	
	ВнешнийНаборДанныхНачислениеДругиеОперацииУпрощенныйУчетНДС = Новый Структура;
	ВнешнийНаборДанныхНачислениеДругиеОперацииУпрощенныйУчетНДС.Вставить("НачислениеДругиеОперацииУпрощенныйУчетНДС",
																		 НачислениеДругиеОперацииУпрощенныйУчетНДС);
																			
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхНачислениеДругиеОперацииУпрощенныйУчетНДС",
									 ВнешнийНаборДанныхНачислениеДругиеОперацииУпрощенныйУчетНДС);
		
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	КоличествоЗаписей = НачислениеДругиеОперацииУпрощенныйУчетНДС.Количество();
	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);

	
	Возврат СтруктураВозвращаемыхПараметров;		

КонецФункции // ПолучитьНаборДанныхНачислениеДругиеОперацииУпрощенныйУчетНДС()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	вычету НДС по приобретенным ценностям в случае ведения упрощенного учета НДС
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхВычетПоПриобретеннымЦенностямУпрощенныйУчетНДС(Запрос)

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДСЗаписиКнигиПокупокОбороты.СчетФактура КАК ДокументРегистратор,
	|	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС,
	|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот,
	|	НДСЗаписиКнигиПокупокОбороты.НДСОборот,
	|	НДСЗаписиКнигиПокупокОбороты.СчетФактура.НомерВходящегоСчетаФактуры,
	|	НДСЗаписиКнигиПокупокОбороты.СчетФактура.ДатаВходящегоСчетаФактуры
	|ПОМЕСТИТЬ ВТСоставКнигиПокупок
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			Регистратор,
	|			Организация В (&Организация)
	|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе))) КАК НДСЗаписиКнигиПокупокОбороты
	|ГДЕ
	|	(НЕ НДСЗаписиКнигиПокупокОбороты.Регистратор ССЫЛКА Документ.ФормированиеЗаписейКнигиПокупок)
	|	И (НЕ НДСЗаписиКнигиПокупокОбороты.Регистратор ССЫЛКА Документ.ОтражениеНДСКВычету)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслугТовары.Номенклатура) КАК НоменклатураКоличество
	|ПОМЕСТИТЬ ТаблицаПоступившихТоваров
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка.Организация В(&Организация)
	|	И ПоступлениеТоваровУслугТовары.Номенклатура <> &ПустаяНоменклатура
	|	И ПоступлениеТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И ПоступлениеТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И ПоступлениеТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТСоставКнигиПокупок.ДокументРегистратор
	|			ИЗ
	|				ВТСоставКнигиПокупок)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ПоступлениеТоваровУслугТовары.СтавкаНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) КАК НоменклатураКоличество
	|ПОМЕСТИТЬ СписокПоступившихТоваров
	|ИЗ
	|	ТаблицаПоступившихТоваров КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) > 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслугУслуги.Номенклатура) КАК НоменклатураКоличество
	|ПОМЕСТИТЬ ТаблицаПоступившихУслуг
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|ГДЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка.Организация В(&Организация)
	|	И ПоступлениеТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И ПоступлениеТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И ПоступлениеТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТСоставКнигиПокупок.ДокументРегистратор
	|			ИЗ
	|				ВТСоставКнигиПокупок)
	|	И ПоступлениеТоваровУслугУслуги.Номенклатура <> &ПустаяНоменклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугУслуги.Номенклатура,
	|	ПоступлениеТоваровУслугУслуги.СтавкаНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) КАК НоменклатураКоличество
	|ПОМЕСТИТЬ СписокПоступившихУслуг
	|ИЗ
	|	ТаблицаПоступившихУслуг КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) > 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТовары.Ссылка КАК Ссылка,
	|	ПоступлениеТовары.СтавкаНДС
	|ПОМЕСТИТЬ ВТОперацииСОшибками
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТовары
	|ГДЕ
	|	ПоступлениеТовары.Ссылка.Организация В(&Организация)
	|	И ПоступлениеТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И ПоступлениеТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И ПоступлениеТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокПоступившихТоваров КАК СписокНоменклатуры)
	|	И ПоступлениеТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТСоставКнигиПокупок.ДокументРегистратор
	|			ИЗ
	|				ВТСоставКнигиПокупок)
	|	И ПоступлениеТовары.Номенклатура <> &ПустаяНоменклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка,
	|	ПоступлениеТоваровУслугУслуги.СтавкаНДС
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|ГДЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка.Организация В(&Организация)
	|	И ПоступлениеТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И ПоступлениеТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И ПоступлениеТоваровУслугУслуги.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокПоступившихУслуг КАК СписокНоменклатуры)
	|	И ПоступлениеТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТСоставКнигиПокупок.ДокументРегистратор
	|			ИЗ
	|				ВТСоставКнигиПокупок)
	|	И ПоступлениеТоваровУслугУслуги.Номенклатура <> &ПустаяНоменклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСоставКнигиПокупок.ДокументРегистратор,
	|	ВТСоставКнигиПокупок.СтавкаНДС,
	|	ВТСоставКнигиПокупок.СуммаБезНДСОборот КАК Сумма,
	|	ВТСоставКнигиПокупок.НДСОборот КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ВТОперацииСОшибками.Ссылка ЕСТЬ NULL 
	|			ТОГДА &ТекстБезОшибок
	|		ИНАЧЕ &ТекстОшибкаПоступлениеПоРазнымСтавкам
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	ВЫБОР
	|		КОГДА ВТОперацииСОшибками.Ссылка ЕСТЬ NULL 
	|			ТОГДА &ТекстНетСноски
	|		ИНАЧЕ &ТекстСноска
	|	КОНЕЦ КАК СимволСноски,
	|	СчетФактураПолученныйДокументыОснования.Ссылка КАК СчетФактура,
	|	&ТекстОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
	|	1 КАК КоличествоДокументов,
	|	ВТСоставКнигиПокупок.СчетФактураНомерВходящегоСчетаФактуры КАК НомерВходящегоДокумента,
	|	ВТСоставКнигиПокупок.СчетФактураДатаВходящегоСчетаФактуры КАК ДатаВходящегоДокумента,
	|	ВЫБОР
	|		КОГДА ВТОперацииСОшибками.Ссылка ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоОшибок
	|ИЗ
	|	ВТСоставКнигиПокупок КАК ВТСоставКнигиПокупок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОперацииСОшибками КАК ВТОперацииСОшибками
	|		ПО ВТСоставКнигиПокупок.ДокументРегистратор = ВТОперацииСОшибками.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|		ПО ВТСоставКнигиПокупок.ДокументРегистратор = СчетФактураПолученныйДокументыОснования.ДокументОснование";
					  
    ВычетПоПриобретеннымЦенностямУпрощенныйУчетНДСВключенные = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДСПредъявленныйОбороты.СчетФактура КАК СчетФактура
	|ПОМЕСТИТЬ ВТСписанныйНДС
	|ИЗ
	|	РегистрНакопления.НДСПредъявленный.Обороты(&НачалоПериода, &КонецПериодаГраница, , Организация В (&Организация)) КАК НДСПредъявленныйОбороты
	|ГДЕ
	|	НДСПредъявленныйОбороты.НДСОборот < 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателя.Ссылка КАК ДокументРегистратор,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ВозвратТоваровОтПокупателя.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
	|	ВЫРАЗИТЬ(ВозвратТоваровОтПокупателя.СуммаДокумента - ВозвратТоваровОтПокупателя.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)) КАК Сумма
	|ПОМЕСТИТЬ ВТДокументы
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|ГДЕ
	|	(НЕ ВозвратТоваровОтПокупателя.НДСПредъявленКВычету)
	|	И ВозвратТоваровОтПокупателя.Проведен
	|	И ВозвратТоваровОтПокупателя.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВозвратТоваровОтПокупателя.Организация В(&Организация)
	|	И (НЕ ВозвратТоваровОтПокупателя.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТСоставКнигиПокупок.ДокументРегистратор
	|				ИЗ
	|					ВТСоставКнигиПокупок))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеДопРасходов.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
	|	ВЫРАЗИТЬ(ПоступлениеДопРасходов.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ПоступлениеДопРасходов.СуммаДокумента - ПоступлениеДопРасходов.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2))
	|ИЗ
	|	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
	|ГДЕ
	|	((НЕ ПоступлениеДопРасходов.НДСПредъявленКВычету)
	|			ИЛИ ПоступлениеДопРасходов.НДСВключенВСтоимость)
	|	И ПоступлениеДопРасходов.Проведен
	|	И ПоступлениеДопРасходов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПоступлениеДопРасходов.Организация В(&Организация)
	|	И (НЕ ПоступлениеДопРасходов.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТСоставКнигиПокупок.ДокументРегистратор
	|				ИЗ
	|					ВТСоставКнигиПокупок))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеИзПереработки.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
	|	ВЫРАЗИТЬ(ПоступлениеИзПереработки.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ПоступлениеИзПереработки.СуммаДокумента - ПоступлениеИзПереработки.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2))
	|ИЗ
	|	Документ.ПоступлениеИзПереработки КАК ПоступлениеИзПереработки
	|ГДЕ
	|	((НЕ ПоступлениеИзПереработки.НДСПредъявленКВычету)
	|			ИЛИ ПоступлениеИзПереработки.НДСВключенВСтоимость)
	|	И ПоступлениеИзПереработки.Проведен
	|	И ПоступлениеИзПереработки.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПоступлениеИзПереработки.Организация В(&Организация)
	|	И (НЕ ПоступлениеИзПереработки.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТСоставКнигиПокупок.ДокументРегистратор
	|				ИЗ
	|					ВТСоставКнигиПокупок))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеНМА.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
	|	ВЫРАЗИТЬ(ПоступлениеНМА.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ПоступлениеНМА.СуммаДокумента - ПоступлениеНМА.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2))
	|ИЗ
	|	Документ.ПоступлениеНМА КАК ПоступлениеНМА
	|ГДЕ
	|	((НЕ ПоступлениеНМА.НДСПредъявленКВычету)
	|			ИЛИ ПоступлениеНМА.НДСВключенВСтоимость)
	|	И ПоступлениеНМА.Проведен
	|	И ПоступлениеНМА.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПоступлениеНМА.Организация В(&Организация)
	|	И (НЕ ПоступлениеНМА.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТСоставКнигиПокупок.ДокументРегистратор
	|				ИЗ
	|					ВТСоставКнигиПокупок))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
	|	ВЫРАЗИТЬ(ПоступлениеТоваровУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ПоступлениеТоваровУслуг.СуммаДокумента - ПоступлениеТоваровУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2))
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	((НЕ ПоступлениеТоваровУслуг.НДСПредъявленКВычету)
	|			ИЛИ ПоступлениеТоваровУслуг.НДСВключенВСтоимость)
	|	И ПоступлениеТоваровУслуг.Проведен
	|	И ПоступлениеТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПоступлениеТоваровУслуг.Организация В(&Организация)
	|	И ПоступлениеТоваровУслуг.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ВПереработку)
	|	И (НЕ ПоступлениеТоваровУслуг.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТСоставКнигиПокупок.ДокументРегистратор
	|				ИЗ
	|					ВТСоставКнигиПокупок))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДокументы.ДокументРегистратор,
	|	ВТДокументы.СтавкаНДС,
	|	ВТДокументы.СуммаНДС,
	|	ВТДокументы.Сумма,
	|	1 КАК КоличествоДокументов,
	|	ВЫБОР
	|		КОГДА ВТСписанныйНДС.СчетФактура ЕСТЬ NULL 
	|			ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
	|		ИНАЧЕ &ТекстНДССписанНаРасходы
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	&ТекстНеОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
	|	СчетФактураПолученный.Ссылка КАК СчетФактура,
	|	СчетФактураПолученный.Ссылка.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	СчетФактураПолученный.Ссылка.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента
	|ИЗ
	|	ВТДокументы КАК ВТДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСписанныйНДС КАК ВТСписанныйНДС
	|		ПО (ВТСписанныйНДС.СчетФактура = ВТДокументы.ДокументРегистратор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученный
	|		ПО (СчетФактураПолученный.ДокументОснование = ВТДокументы.ДокументРегистратор)";

	ВычетПоПриобретеннымЦенностямУпрощенныйУчетНДСНеВключенные = Запрос.Выполнить().Выгрузить();
	
	//	Расшифровка ошибки "Поступление одной номенклатуры по разным ставкам"
		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТовары.Ссылка КАК ОшДокументРегистратор,
	|	ПоступлениеТовары.СтавкаНДС КАК ОшСтавкаНДС,
	|	ПоступлениеТовары.Номенклатура КАК ОшНоменклатура,
	|	1 КАК ОшКоличествоДокументов
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТовары
	|ГДЕ
	|	ПоступлениеТовары.Ссылка.Организация В(&Организация)
	|	И ПоступлениеТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И ПоступлениеТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И ПоступлениеТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокПоступившихТоваров КАК СписокНоменклатуры)
	|	И ПоступлениеТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТСоставКнигиПокупок.ДокументРегистратор
	|			ИЗ
	|				ВТСоставКнигиПокупок)
	|	И ПоступлениеТовары.Номенклатура <> &ПустаяНоменклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка,
	|	ПоступлениеТоваровУслугУслуги.СтавкаНДС,
	|	ПоступлениеТоваровУслугУслуги.Номенклатура,
	|	1
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
	|ГДЕ
	|	ПоступлениеТоваровУслугУслуги.Ссылка.Организация В(&Организация)
	|	И ПоступлениеТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И ПоступлениеТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И ПоступлениеТоваровУслугУслуги.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокПоступившихУслуг КАК СписокНоменклатуры)
	|	И ПоступлениеТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТСоставКнигиПокупок.ДокументРегистратор
	|			ИЗ
	|				ВТСоставКнигиПокупок)
	|	И ПоступлениеТоваровУслугУслуги.Номенклатура <> &ПустаяНоменклатура";
	
	ВычетПоПриобретеннымЦенностямОшибка = Запрос.Выполнить().Выгрузить();
				
	ВнешнийНаборДанныхВычетПоПриобретеннымЦенностямУпрощенныйУчетНДС = Новый Структура;
	ВнешнийНаборДанныхВычетПоПриобретеннымЦенностямУпрощенныйУчетНДС.Вставить("ВычетПоПриобретеннымЦенностямУпрощенныйУчетНДСВключенные",
																			  ВычетПоПриобретеннымЦенностямУпрощенныйУчетНДСВключенные);
	ВнешнийНаборДанныхВычетПоПриобретеннымЦенностямУпрощенныйУчетНДС.Вставить("ВычетПоПриобретеннымЦенностямУпрощенныйУчетНДСНеВключенные",
																			  ВычетПоПриобретеннымЦенностямУпрощенныйУчетНДСНеВключенные);
	ВнешнийНаборДанныхВычетПоПриобретеннымЦенностямУпрощенныйУчетНДС.Вставить("Ошибка", ВычетПоПриобретеннымЦенностямОшибка);
			
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхВычетПоПриобретеннымЦенностямУпрощенныйУчетНДС",
									 ВнешнийНаборДанныхВычетПоПриобретеннымЦенностямУпрощенныйУчетНДС);
	
	ВключенныеВБазу 	= ВычетПоПриобретеннымЦенностямУпрощенныйУчетНДСВключенные.Итог("СуммаНДС");
	НеВключенныеВБазу 	= ВычетПоПриобретеннымЦенностямУпрощенныйУчетНДСНеВключенные.Итог("СуммаНДС");
	
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);	
	
	Если ВычетПоПриобретеннымЦенностямУпрощенныйУчетНДСВключенные.Итог("КоличествоОшибок") > 0 Тогда
		СтруктураВозвращаемыхПараметров.Вставить("НаличиеОшибок", Истина);	
	КонецЕсли;	
	
	КоличествоЗаписей = ВычетПоПриобретеннымЦенностямУпрощенныйУчетНДСВключенные.Количество()
		+ ВычетПоПриобретеннымЦенностямУпрощенныйУчетНДСНеВключенные.Количество();
	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);
    		
	Возврат СтруктураВозвращаемыхПараметров;		

КонецФункции // ПолучитьНаборДанныхВычетПоПриобретеннымЦенностямУпрощенныйУчетНДС()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	вычету НДС с выданных авансов в случае ведения упрощенного учета НДС
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхВычетАвансыВыданныеУпрощенныйУчетНДС(Запрос)
    			
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Регистратор КАК ДокументРегистратор,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.СуммаОборотДт - ХозрасчетныйОстаткиИОбороты.СуммаОборотДт * 18 / 118 КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ВЫРАЗИТЬ(ХозрасчетныйОстаткиИОбороты.СуммаОборотДт * 18 / 118 КАК ЧИСЛО(15, 2)) КАК СуммаНДС
	|ПОМЕСТИТЬ ВТАвансыВыданныеВременнаяТаблица
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериодаГраница, Регистратор, , Счет В ИЕРАРХИИ (&СписокСчетовАвансовВыданных), , Организация В (&Организация)) КАК ХозрасчетныйОстаткиИОбороты
	|ГДЕ
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт > 0
	|	И ХозрасчетныйОстаткиИОбороты.Регистратор ССЫЛКА Документ.СписаниеСРасчетногоСчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТАвансыВыданныеВременнаяТаблица.ДокументРегистратор КАК ДокументРегистратор,
	|	ВТАвансыВыданныеВременнаяТаблица.СтавкаНДС,
	|	ВТАвансыВыданныеВременнаяТаблица.Сумма,
	|	ВТАвансыВыданныеВременнаяТаблица.СуммаНДС,
	|	СчетаФактурыВыданные.Ссылка КАК СчетФактура
	|ПОМЕСТИТЬ ВТАвансыВыданные
	|ИЗ
	|	ВТАвансыВыданныеВременнаяТаблица КАК ВТАвансыВыданныеВременнаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетаФактурыВыданные
	|		ПО (СчетаФактурыВыданные.ДокументОснование = ВТАвансыВыданныеВременнаяТаблица.ДокументРегистратор)
	|ГДЕ
	|	СчетаФактурыВыданные.Ссылка ЕСТЬ NULL 
	|	И ЕСТЬNULL(СчетаФактурыВыданные.Ссылка.ВидСчетаФактуры, ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НалоговыйАгент)) = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НалоговыйАгент)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПокупокОбороты.СчетФактура КАК ДокументРегистратор,
	|	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС КАК СтавкаНДС,
	|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот КАК Сумма,
	|	НДСЗаписиКнигиПокупокОбороты.НДСОборот КАК СуммаНДС
	|ПОМЕСТИТЬ СоставКнигиПокупокВЧастиАвансов
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК НДСЗаписиКнигиПокупокОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Авансы.ДокументРегистратор КАК ДокументРегистратор,
	|	СчетФактураПолученныйДокументыОснования.Ссылка КАК СчетФактура,
	|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)) КАК СтавкаНДС,
	|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.Сумма, Авансы.Сумма) КАК Сумма,
	|	ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СуммаНДС, Авансы.СуммаНДС) КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученныйДокументыОснования.Ссылка ЕСТЬ NULL 
	|			ТОГДА &ТекстВыданныйАвансБезСФ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
	|					ТОГДА ВЫБОР
	|							КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
	|								ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
	|							ИНАЧЕ &ТекстБезОшибок
	|						КОНЕЦ
	|				ИНАЧЕ &ТекстСФНаВыданныйАвансНеПроведен
	|			КОНЕЦ
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	ВЫБОР
	|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
	|			ТОГДА &ТекстНеОтраженыВКнигеПокупок
	|		ИНАЧЕ &ТекстОтраженыВКнигеПокупок
	|	КОНЕЦ КАК ПризнакОтраженияНДС,
	|	ВЫБОР
	|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
	|			ТОГДА ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СуммаНДС, Авансы.СуммаНДС)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНеВключеннаяВБазу,
	|	ВЫБОР
	|		КОГДА СоставКнигиПродажВЧастиАвансов.ДокументРегистратор ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(СоставКнигиПродажВЧастиАвансов.СуммаНДС, Авансы.СуммаНДС)
	|	КОНЕЦ КАК СуммаВключеннаяВБазу,
	|	1 КАК КоличествоДокументов
	|ИЗ
	|	ВТАвансыВыданные КАК Авансы
	|		ЛЕВОЕ СОЕДИНЕНИЕ СоставКнигиПокупокВЧастиАвансов КАК СоставКнигиПродажВЧастиАвансов
	|		ПО Авансы.ДокументРегистратор = СоставКнигиПродажВЧастиАвансов.ДокументРегистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|		ПО Авансы.ДокументРегистратор = СчетФактураПолученныйДокументыОснования.ДокументОснование";
	
	ВычетАвансыВыданныеУпрощенныйУчетНДС = Запрос.Выполнить().Выгрузить();
	
	ВнешнийНаборДанныхВычетАвансыВыданныеУпрощенныйУчетНДС = Новый Структура;
	ВнешнийНаборДанныхВычетАвансыВыданныеУпрощенныйУчетНДС.Вставить("ВычетАвансыВыданныеУпрощенныйУчетНДС",
																	ВычетАвансыВыданныеУпрощенныйУчетНДС);
	
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхВычетАвансыВыданныеУпрощенныйУчетНДС",
									 ВнешнийНаборДанныхВычетАвансыВыданныеУпрощенныйУчетНДС);
	
	ВключенныеВБазу = ВычетАвансыВыданныеУпрощенныйУчетНДС.Итог("СуммаВключеннаяВБазу");
	НеВключенныеВБазу = ВычетАвансыВыданныеУпрощенныйУчетНДС.Итог("СуммаНеВключеннаяВБазу");
		
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	КоличествоЗаписей = ВычетАвансыВыданныеУпрощенныйУчетНДС.Количество();
	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);
   	
	Возврат СтруктураВозвращаемыхПараметров;	

КонецФункции // ПолучитьНаборДанныхВычетАвансыВыданныеУпрощенныйУчетНДС()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	вычету НДС с полученных авансов (по факту реализации) в случае ведения упрощенного учета НДС
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхВычетСАвансовПолученныхУпрощенныйУчетНДС(Запрос)

	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1
	|ПОМЕСТИТЬ ВТХозрасчетныйОстаткиСАвансовПолученныхУпрощенныйУчет
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоСледующегоПериода, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСПоАвансамИПредоплатам), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.СФВыданные), Организация В (&Организация)) КАК ХозрасчетныйОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПродажОбороты.СчетФактура КАК СчетФактура,
	|	НДСЗаписиКнигиПродажОбороты.ВидЦенности КАК ВидЦенности,
	|	НДСЗаписиКнигиПродажОбороты.СтавкаНДС КАК СтавкаНДС,
	|	НДСЗаписиКнигиПродажОбороты.Покупатель,
	|	НДСЗаписиКнигиПродажОбороты.ДоговорКонтрагента,
	|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот,
	|	НДСЗаписиКнигиПродажОбороты.НДСОборот
	|ПОМЕСТИТЬ ВТНДСЗаписиКнигиПродажОборотыСАвансовПолученныхУпрощенныйУчет
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И СчетФактура В
	|					(ВЫБРАТЬ
	|						ХозрасчетныйОстатки.Субконто1 КАК СчетФактура
	|					ИЗ
	|						ВТХозрасчетныйОстаткиСАвансовПолученныхУпрощенныйУчет КАК ХозрасчетныйОстатки)
	|				И ВидЦенности В (&ВидыЦенностейАвансыПолученные)) КАК НДСЗаписиКнигиПродажОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	ВидЦенности,
	|	СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПокупокОбороты.СчетФактура КАК СчетФактура,
	|	НДСЗаписиКнигиПокупокОбороты.ВидЦенности КАК ВидЦенности,
	|	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС КАК СтавкаНДС,
	|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот,
	|	НДСЗаписиКнигиПокупокОбороты.НДСОборот
	|ПОМЕСТИТЬ ВТНДСЗаписиКнигиПокупокОборотыСАвансовПолученныхУпрощенныйУчет
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
	|			,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И СчетФактура В
	|					(ВЫБРАТЬ
	|						ХозрасчетныйОстатки.Субконто1 КАК СчетФактура
	|					ИЗ
	|						ВТХозрасчетныйОстаткиСАвансовПолученныхУпрощенныйУчет КАК ХозрасчетныйОстатки)
	|				И ВидЦенности В (&ВидыЦенностейАвансыПолученные)) КАК НДСЗаписиКнигиПокупокОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура,
	|	ВидЦенности,
	|	СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК Субконто1,
	|	ХозрасчетныйОстатки.СуммаОстатокКт
	|ПОМЕСТИТЬ ХозрасчетныйОстаткиСАвансовПолученныхУпрощенныйУчет
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&НачалоСледующегоПериода, Счет В (&СписокСчетовАвансовПолученных), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами), Организация В (&Организация)) КАК ХозрасчетныйОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Субконто1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПродажОбороты.СтавкаНДС КАК СтавкаНДС,
	|	НДСЗаписиКнигиПродажОбороты.СчетФактура КАК ДокументРегистратор,
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
	|	СУММА(ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот, 0) - ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот, 0)) КАК Сумма,
	|	СУММА(ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.НДСОборот, 0) - ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.НДСОборот, 0)) КАК СуммаНДС,
	|	ХозрасчетныйОстатки.СуммаОстатокКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот, 0) - ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот, 0) + ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.НДСОборот, 0) - ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.НДСОборот, 0) - ХозрасчетныйОстатки.СуммаОстатокКт = 0
	|			ТОГДА &ТекстОплаченныеЦенностиНеРеализованы
	|		ИНАЧЕ &ТекстВычетНеОтраженВКнигеПокупок
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	&ТекстНеОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
	|	1 КАК КоличествоДокументов
	|ИЗ
	|	ВТНДСЗаписиКнигиПродажОборотыСАвансовПолученныхУпрощенныйУчет КАК НДСЗаписиКнигиПродажОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСЗаписиКнигиПокупокОборотыСАвансовПолученныхУпрощенныйУчет КАК НДСЗаписиКнигиПокупокОбороты
	|		ПО (НДСЗаписиКнигиПокупокОбороты.СчетФактура = НДСЗаписиКнигиПродажОбороты.СчетФактура)
	|			И (НДСЗаписиКнигиПокупокОбороты.ВидЦенности = НДСЗаписиКнигиПродажОбороты.ВидЦенности)
	|			И (НДСЗаписиКнигиПокупокОбороты.СтавкаНДС = НДСЗаписиКнигиПродажОбороты.СтавкаНДС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйОстаткиСАвансовПолученныхУпрощенныйУчет КАК ХозрасчетныйОстатки
	|		ПО НДСЗаписиКнигиПродажОбороты.СчетФактура = ХозрасчетныйОстатки.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО НДСЗаписиКнигиПродажОбороты.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот, 0) - ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот, 0) > 0
	|	И ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.НДСОборот, 0) - ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.НДСОборот, 0) > 0
	|	И НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСЗаписиКнигиПродажОбороты.Покупатель,
	|	НДСЗаписиКнигиПродажОбороты.ДоговорКонтрагента,
	|	НДСЗаписиКнигиПродажОбороты.СчетФактура,
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	НДСЗаписиКнигиПродажОбороты.ВидЦенности,
	|	НДСЗаписиКнигиПродажОбороты.СтавкаНДС,
	|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот,
	|	НДСЗаписиКнигиПокупокОбороты.НДСОборот,
	|	ХозрасчетныйОстатки.СуммаОстатокКт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот, 0) - ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот, 0) + ЕСТЬNULL(НДСЗаписиКнигиПродажОбороты.НДСОборот, 0) - ЕСТЬNULL(НДСЗаписиКнигиПокупокОбороты.НДСОборот, 0) - ХозрасчетныйОстатки.СуммаОстатокКт = 0
	|			ТОГДА &ТекстОплаченныеЦенностиНеРеализованы
	|		ИНАЧЕ &ТекстВычетНеОтраженВКнигеПокупок
	|	КОНЕЦ";
	
	ВычетСАвансовПолученныхУпрощенныйУчетНДСНеВключенные = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	НДСЗаписиКнигиПокупок.СчетФактура КАК СчетФактура,
	|	НДСЗаписиКнигиПокупок.СтавкаНДС,
	|	НДСЗаписиКнигиПокупок.СуммаБезНДСОборот,
	|	НДСЗаписиКнигиПокупок.НДСОборот
	|ПОМЕСТИТЬ ВТНДСЗаписиКнигиПокупокВЧастиАвансовПолученных
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И ВидЦенности В (&ВидыЦенностейАвансыПолученные)) КАК НДСЗаписиКнигиПокупок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПокупок.СтавкаНДС КАК СтавкаНДС,
	|	НДСЗаписиКнигиПокупок.СчетФактура КАК ДокументРегистратор,
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
	|	НДСЗаписиКнигиПокупок.СуммаБезНДСОборот КАК Сумма,
	|	НДСЗаписиКнигиПокупок.НДСОборот КАК СуммаНДС,
	|	ХозрасчетныйОстатки.СуммаОстатокКт,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.СуммаОстатокКт ЕСТЬ NULL 
	|			ТОГДА &ТекстНДСПринятКВычетуПолностью
	|		ИНАЧЕ &ТекстНДСПринятКВычетуЧастично
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	&ТекстОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
	|	1 КАК КоличествоДокументов
	|ИЗ
	|	ВТНДСЗаписиКнигиПокупокВЧастиАвансовПолученных КАК НДСЗаписиКнигиПокупок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХозрасчетныйОстаткиСАвансовПолученныхУпрощенныйУчет КАК ХозрасчетныйОстатки
	|		ПО НДСЗаписиКнигиПокупок.СчетФактура = ХозрасчетныйОстатки.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО НДСЗаписиКнигиПокупок.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления";
	
	ВычетСАвансовПолученныхУпрощенныйУчетНДСВключенные = Запрос.Выполнить().Выгрузить();
		
	ВключенныеВБазу = ВычетСАвансовПолученныхУпрощенныйУчетНДСВключенные.Итог("СуммаНДС");
	НеВключенныеВБазу = ВычетСАвансовПолученныхУпрощенныйУчетНДСНеВключенные.Итог("СуммаНДС");
	
	ВнешнийНаборДанныхВычетСАвансовПолученныхУпрощенныйУчетНДС = Новый Структура;
	ВнешнийНаборДанныхВычетСАвансовПолученныхУпрощенныйУчетНДС.Вставить("ВычетСАвансовПолученныхУпрощенныйУчетНДСВключенные",
																		ВычетСАвансовПолученныхУпрощенныйУчетНДСВключенные);
	ВнешнийНаборДанныхВычетСАвансовПолученныхУпрощенныйУчетНДС.Вставить("ВычетСАвансовПолученныхУпрощенныйУчетНДСНеВключенные",
																		ВычетСАвансовПолученныхУпрощенныйУчетНДСНеВключенные);
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхВычетСАвансовПолученныхУпрощенныйУчетНДС",
									 ВнешнийНаборДанныхВычетСАвансовПолученныхУпрощенныйУчетНДС);
	
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	КоличествоЗаписей = ВычетСАвансовПолученныхУпрощенныйУчетНДСВключенные.Количество()
		+ ВычетСАвансовПолученныхУпрощенныйУчетНДСНеВключенные.Количество();
	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);
	
	Возврат СтруктураВозвращаемыхПараметров;	
	
КонецФункции // ПолучитьНаборДанныхВычетСАвансовПолученныхУпрощенныйУчетНДС()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	вычету НДС по прочим операциям в случае ведения упрощенного учета НДС
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхВычетДругиеОперацииУпрощенныйУчетНДС(Запрос)

	//	В данном разделе отражаются вычеты НДС введенные пользователем, кроме любых видов авансов
    	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДСЗаписиКнигиПокупокОбороты.Регистратор КАК ДокументРегистратор,
	|	НДСЗаписиКнигиПокупокОбороты.СтавкаНДС,
	|	НДСЗаписиКнигиПокупокОбороты.СуммаБезНДСОборот КАК Сумма,
	|	НДСЗаписиКнигиПокупокОбороты.НДСОборот КАК СуммаНДС
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			Регистратор,
	|			Организация В (&Организация)
	|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыПолученные, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)))) КАК НДСЗаписиКнигиПокупокОбороты
	|ГДЕ
	|	НДСЗаписиКнигиПокупокОбороты.Регистратор ССЫЛКА Документ.ОтражениеНДСКВычету";
	
	ВычетДругиеОперацииУпрощенныйУчетНДС = Запрос.Выполнить().Выгрузить();
	
	ВключенныеВБазу = ВычетДругиеОперацииУпрощенныйУчетНДС.Итог("СуммаНДС");
	НеВключенныеВБазу = 0;
	
	ВнешнийНаборДанныхВычетДругиеОперацииУпрощенныйУчетНДС = Новый Структура;
	ВнешнийНаборДанныхВычетДругиеОперацииУпрощенныйУчетНДС.Вставить("ВычетДругиеОперацииУпрощенныйУчетНДС",
																	ВычетДругиеОперацииУпрощенныйУчетНДС);
	
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхВычетДругиеОперацииУпрощенныйУчетНДС",
									 ВнешнийНаборДанныхВычетДругиеОперацииУпрощенныйУчетНДС);
	
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	КоличествоЗаписей = ВычетДругиеОперацииУпрощенныйУчетНДС.Количество();
	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);
	
	Возврат СтруктураВозвращаемыхПараметров;		

КонецФункции // ПолучитьНаборДанныхВычетДругиеОперацииУпрощенныйУчетНДС()

//	Наборы при сложном учете НДС

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	начислению НДС в случае реализации по ставке НДС 0%
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхНачислениеРеализация0(Запрос)

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДСРеализация0Остатки.СчетФактура КАК ДокументРегистратор,
	|	НДСРеализация0Остатки.СтавкаНДС,
	|	ЕСТЬNULL(НДСРеализация0Остатки.СуммаБезНДСОстаток, 0) КАК Сумма,
	|	ЕСТЬNULL(НДСРеализация0Остатки.НДСОстаток, 0) КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА НДСРеализация0Остатки.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение)
	|			ТОГДА &ТекстВычетНеОтраженДоПодтвержденияСтавки0
	|		ИНАЧЕ &ТекстНачислениеНеОтраженоВКнигеПродаж
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	&ТекстНеОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС,
	|	1 КАК КоличествоДокументов,
	|	0 КАК СуммаВключенные,
	|	ЕСТЬNULL(НДСРеализация0Остатки.НДСОстаток, 0) КАК СуммаНеВключенные
	|ИЗ
	|	РегистрНакопления.НДСРеализация0.Остатки(&НачалоСледующегоПериода, Организация В (&Организация)) КАК НДСРеализация0Остатки
	|ГДЕ
	|	(НДСРеализация0Остатки.СуммаБезНДСОстаток > 0
	|			ИЛИ НДСРеализация0Остатки.НДСОстаток > 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КнигаПродаж.СчетФактура,
	|	КнигаПродаж.СтавкаНДС,
	|	КнигаПродаж.СуммаБезНДСОборот,
	|	КнигаПродаж.НДСОборот,
	|	&ТекстБезОшибок,
	|	&ТекстОтраженыВКнигеПродаж,
	|	1,
	|	КнигаПродаж.НДСОборот,
	|	0
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе, &ВидыЦенностейНалоговыйАгент))
	|				И Событие В (ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПодтвержденаСтавка0), ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.НеПодтвержденаСтавка0))) КАК КнигаПродаж";
	
	НачислениеРеализация0 = Запрос.Выполнить().Выгрузить();
		
	ВключенныеВБазу = НачислениеРеализация0.Итог("СуммаВключенные");
	НеВключенныеВБазу = НачислениеРеализация0.Итог("СуммаНеВключенные");
	
	ВнешнийНаборДанныхНачислениеРеализация0 = Новый Структура;
	ВнешнийНаборДанныхНачислениеРеализация0.Вставить("НачислениеРеализация0",НачислениеРеализация0);
	
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхНачислениеРеализация0", ВнешнийНаборДанныхНачислениеРеализация0);
	
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	КоличествоЗаписей = НачислениеРеализация0.Количество();
	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);
	
	Возврат СтруктураВозвращаемыхПараметров;		

КонецФункции // ПолучитьНаборДанныхНачислениеРеализация0()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	начисленному НДС по реализации в случае сложного учета НДС
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхНачислениеРеализацияСложныйУчетНДС(Запрос)
	
	//	Документы включенные в книгу продаж (НДС по реализации)
    Запрос.Текст = 
	"ВЫБРАТЬ
	|	КнигаПродаж.СчетФактура КАК СчетФактура,
	|	КнигаПродаж.СтавкаНДС КАК СтавкаНДС,
	|	КнигаПродаж.СуммаБезНДСОборот КАК Сумма,
	|	КнигаПродаж.НДСОборот КАК СуммаНДС
	|ПОМЕСТИТЬ ВТСоставКнигиПродаж
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе, &ВидыЦенностейНалоговыйАгент, ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.СМРСобственнымиСилами)))
	|				И (НЕ Событие В (ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ПодтвержденаСтавка0), ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.НеПодтвержденаСтавка0), ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ВосстановлениеНДС)))) КАК КнигаПродаж
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслугТовары.Номенклатура) КАК НоменклатураКоличество
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|	И РеализацияТоваровУслугТовары.Номенклатура <> &ПустаяНоменклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.СтавкаНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) КАК НоменклатураКоличество
	|ПОМЕСТИТЬ СписокТоваров
	|ИЗ
	|	ТаблицаТоваров КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) > 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугУслуги.Номенклатура КАК Номенклатура,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС КАК СтавкаНДС,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РеализацияТоваровУслугУслуги.Номенклатура) КАК НоменклатураКоличество
	|ПОМЕСТИТЬ ТаблицаУслуг
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|	И РеализацияТоваровУслугУслуги.Номенклатура <> &ПустаяНоменклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугУслуги.Номенклатура,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) КАК НоменклатураКоличество
	|ПОМЕСТИТЬ СписокУслуг
	|ИЗ
	|	ТаблицаУслуг КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.НоменклатураКоличество) > 1
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС
	|ПОМЕСТИТЬ НеверныеСтавки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокТоваров КАК СписокНоменклатуры)
	|	И РеализацияТоваровУслугТовары.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|	И РеализацияТоваровУслугТовары.Номенклатура <> &ПустаяНоменклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугУслуги.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокУслуг КАК СписокНоменклатуры)
	|	И РеализацияТоваровУслугУслуги.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|	И РеализацияТоваровУслугУслуги.Номенклатура <> &ПустаяНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСНачисленныйОбороты.СчетФактура КАК СчетФактура,
	|	НДСНачисленныйОбороты.СтавкаНДС
	|ПОМЕСТИТЬ ВТНДСНачисленныйОбороты
	|ИЗ
	|	РегистрНакопления.НДСНачисленный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И (НЕ СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах)
	|				И СчетФактура В
	|					(ВЫБРАТЬ
	|						КнигаПродаж.СчетФактура КАК СчетФактура
	|					ИЗ
	|						ВТСоставКнигиПродаж КАК КнигаПродаж)) КАК НДСНачисленныйОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСНачисленныйОбороты.СчетФактура КАК СчетФактура,
	|	НДСНачисленныйОбороты.СтавкаНДС
	|ПОМЕСТИТЬ ВТНДСНачисленныйОборотыЭкспорт
	|ИЗ
	|	РегистрНакопления.НДСНачисленный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			,
	|			СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|				И Организация В (&Организация)
	|				И ВЫБОР
	|					КОГДА (НЕ ВЫРАЗИТЬ(СчетФактура.ДоговорКонтрагента КАК Справочник.ДоговорыКонтрагентов) ЕСТЬ NULL )
	|						ТОГДА ВЫРАЗИТЬ(СчетФактура.ДоговорКонтрагента КАК Справочник.ДоговорыКонтрагентов).РеализацияНаЭкспорт
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|				И СчетФактура В
	|					(ВЫБРАТЬ
	|						КнигаПродаж.СчетФактура КАК СчетФактура
	|					ИЗ
	|						ВТСоставКнигиПродаж КАК КнигаПродаж)) КАК НДСНачисленныйОбороты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НеверныеСтавкиНДС.Ссылка КАК ДокументРегистратор,
	|	НеверныеСтавкиНДС.СтавкаНДС,
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
	|	0 КАК РангОшибки
	|ПОМЕСТИТЬ ВТОперацииСОшибками
	|ИЗ
	|	НеверныеСтавки КАК НеверныеСтавкиНДС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО НеверныеСтавкиНДС.Ссылка = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДСНачисленныйОбороты.СчетФактура,
	|	НДСНачисленныйОбороты.СтавкаНДС,
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	3
	|ИЗ
	|	ВТНДСНачисленныйОбороты КАК НДСНачисленныйОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО НДСНачисленныйОбороты.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДСНачисленныйОбороты.СчетФактура,
	|	НДСНачисленныйОбороты.СтавкаНДС,
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	2
	|ИЗ
	|	ВТНДСНачисленныйОборотыЭкспорт КАК НДСНачисленныйОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО НДСНачисленныйОбороты.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДСНачисленный.СчетФактура,
	|	НДСНачисленный.СтавкаНДС,
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	1
	|ИЗ
	|	РегистрНакопления.НДСНачисленный КАК НДСНачисленный
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО НДСНачисленный.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|ГДЕ
	|	НДСНачисленный.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И НДСНачисленный.СчетДоходовБУ = &ВыручкаЕНВД
	|	И НДСНачисленный.СчетФактура В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|	И НДСНачисленный.Организация В(&Организация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументРегистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСоставКнигиПродаж.СчетФактура КАК СчетФактура,
	|	ВТСоставКнигиПродаж.СтавкаНДС,
	|	ВТОперацииСОшибками.ДокументРегистратор,
	|	МИНИМУМ(ВТСоставКнигиПродаж.Сумма) КАК Сумма,
	|	МИНИМУМ(ВТСоставКнигиПродаж.СуммаНДС) КАК СуммаНДС,
	|	МИНИМУМ(ВТОперацииСОшибками.РангОшибки) КАК РангОшибки
	|ПОМЕСТИТЬ ВТПроведеноРанжированиеОшибок
	|ИЗ
	|	ВТСоставКнигиПродаж КАК ВТСоставКнигиПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОперацииСОшибками КАК ВТОперацииСОшибками
	|		ПО ВТСоставКнигиПродаж.СчетФактура = ВТОперацииСОшибками.ДокументРегистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСоставКнигиПродаж.СчетФактура,
	|	ВТСоставКнигиПродаж.СтавкаНДС,
	|	ВТОперацииСОшибками.ДокументРегистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	ВЫБОР
	|		КОГДА СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаРеализацию)
	|			ТОГДА NULL
	|		ИНАЧЕ СчетФактураВыданныйДокументыОснования.Ссылка.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДССчетаФактуры
	|ПОМЕСТИТЬ ВТСчетФактураВыданныйДокументыОснования
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Организация В(&Организация)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
	|	ВТПроведеноРанжированиеОшибок.СтавкаНДС,
	|	ВТПроведеноРанжированиеОшибок.СчетФактура КАК ДокументРегистратор,
	|	ВТПроведеноРанжированиеОшибок.Сумма,
	|	ВТПроведеноРанжированиеОшибок.СуммаНДС,
	|	1 КАК КоличествоДокументов,
	|	ВЫБОР
	|		КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки ЕСТЬ NULL 
	|			ТОГДА &ТекстБезОшибок
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки = 0
	|					ТОГДА &ТекстОшибкаРеализацияПоРазнымСтавкам
	|				КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки = 1
	|					ТОГДА &ТекстОшибкаРеализацияЕНВДСНДС
	|				КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки = 2
	|					ТОГДА &ТекстОшибкаРеализацияЭкспортСНДС
	|				КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки = 3
	|					ТОГДА &ТекстОшибкаРеализацияБезСФ
	|			КОНЕЦ
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	ВЫБОР
	|		КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки = 0
	|			ТОГДА &ТекстСноска
	|		ИНАЧЕ &ТекстНетСноски
	|	КОНЕЦ КАК СимволСноски,
	|	&ТекстОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС,
	|	ВЫБОР
	|		КОГДА ВТПроведеноРанжированиеОшибок.РангОшибки ЕСТЬ NULL 
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК КоличествоОшибок
	|ИЗ
	|	ВТПроведеноРанжированиеОшибок КАК ВТПроведеноРанжированиеОшибок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСчетФактураВыданныйДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ВТПроведеноРанжированиеОшибок.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|			И (ВТПроведеноРанжированиеОшибок.СтавкаНДС = ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.СтавкаНДССчетаФактуры, ВТПроведеноРанжированиеОшибок.СтавкаНДС))";
	
	НачисленияПоРеализацииВключенные = Запрос.Выполнить().Выгрузить();
	
	//	Документы не включенные в книгу продаж (НДС по реализации),	так как НДС в документах не учитывается
	Если ИдентификаторКонфигурации = "УПП" Тогда
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктОбОказанииПроизводственныхУслуг.Ссылка КАК ДокументРегистратор,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
		|	ВЫРАЗИТЬ(АктОбОказанииПроизводственныхУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
		|	ВЫРАЗИТЬ(АктОбОказанииПроизводственныхУслуг.СуммаДокумента - АктОбОказанииПроизводственныхУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	&ПустаяСсылкаНаСчетФактуруВыданный КАК СчетФактура,
		|	1 КАК КоличествоДокументов,
		|	&ТекстНДСНеУчитывается КАК ПризнакНаличияОшибок,
		|	&ТекстНеОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС
		|ИЗ
		|	Документ.АктОбОказанииПроизводственныхУслуг КАК АктОбОказанииПроизводственныхУслуг
		|ГДЕ
		|	(НЕ АктОбОказанииПроизводственныхУслуг.УчитыватьНДС)
		|	И АктОбОказанииПроизводственныхУслуг.Проведен
		|	И АктОбОказанииПроизводственныхУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И АктОбОказанииПроизводственныхУслуг.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровПоставщику.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ВозвратТоваровПоставщику.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ВозвратТоваровПоставщику.СуммаДокумента - ВозвратТоваровПоставщику.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		|ГДЕ
		|	(НЕ ВозвратТоваровПоставщику.УчитыватьНДС)
		|	И ВозвратТоваровПоставщику.Проведен
		|	И ВозвратТоваровПоставщику.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВозвратТоваровПоставщику.Организация В(&Организация)
		|	И ВозвратТоваровПоставщику.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВозвратТоваровПоставщику.ИзПереработки)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтчетКомиссионераОПродажах.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажах.СуммаДокумента - ОтчетКомиссионераОПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
		|ГДЕ
		|	(НЕ ОтчетКомиссионераОПродажах.УчитыватьНДС)
		|	И ОтчетКомиссионераОПродажах.Проведен
		|	И ОтчетКомиссионераОПродажах.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОтчетКомиссионераОПродажах.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтчетОРозничныхПродажах.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажах.СуммаДокумента - ОтчетОРозничныхПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
		|ГДЕ
		|	(НЕ ОтчетОРозничныхПродажах.УчитыватьНДС)
		|	И ОтчетОРозничныхПродажах.Проведен
		|	И ОтчетОРозничныхПродажах.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОтчетОРозничныхПродажах.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаНМА.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ПередачаНМА.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПередачаНМА.СуммаДокумента - ПередачаНМА.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ПередачаНМА КАК ПередачаНМА
		|ГДЕ
		|	(НЕ ПередачаНМА.УчитыватьНДС)
		|	И ПередачаНМА.Проведен
		|	И ПередачаНМА.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПередачаНМА.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаОС.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ПередачаОС.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПередачаОС.СуммаДокумента - ПередачаОС.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ПередачаОС КАК ПередачаОС
		|ГДЕ
		|	(НЕ ПередачаОС.УчитыватьНДС)
		|	И ПередачаОС.Проведен
		|	И ПередачаОС.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПередачаОС.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(РеализацияТоваровУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(РеализацияТоваровУслуг.СуммаДокумента - РеализацияТоваровУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Проведен
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (НЕ РеализацияТоваровУслуг.УчитыватьНДС)
		|	И РеализацияТоваровУслуг.Организация В(&Организация)";
    	
	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктОбОказанииПроизводственныхУслуг.Ссылка КАК ДокументРегистратор,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118) КАК СтавкаНДС,
		|	ВЫРАЗИТЬ(АктОбОказанииПроизводственныхУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)) КАК СуммаНДС,
		|	ВЫРАЗИТЬ(АктОбОказанииПроизводственныхУслуг.СуммаДокумента - АктОбОказанииПроизводственныхУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)) КАК Сумма,
		|	&ПустаяСсылкаНаСчетФактуруВыданный КАК СчетФактура,
		|	1 КАК КоличествоДокументов,
		|	&ТекстНДСНеУчитывается КАК ПризнакНаличияОшибок,
		|	&ТекстНеОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС
		|ИЗ
		|	Документ.АктОбОказанииПроизводственныхУслуг КАК АктОбОказанииПроизводственныхУслуг
		|ГДЕ
		|	(НЕ АктОбОказанииПроизводственныхУслуг.УчитыватьНДС)
		|	И АктОбОказанииПроизводственныхУслуг.Проведен
		|	И АктОбОказанииПроизводственныхУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И АктОбОказанииПроизводственныхУслуг.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВозвратТоваровПоставщику.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ВозвратТоваровПоставщику.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ВозвратТоваровПоставщику.СуммаДокумента - ВозвратТоваровПоставщику.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		|ГДЕ
		|	(НЕ ВозвратТоваровПоставщику.УчитыватьНДС)
		|	И ВозвратТоваровПоставщику.Проведен
		|	И ВозвратТоваровПоставщику.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВозвратТоваровПоставщику.Организация В(&Организация)
		|	И ВозвратТоваровПоставщику.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВозвратТоваровПоставщику.ИзПереработки)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтчетКомиссионераОПродажах.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ОтчетКомиссионераОПродажах.СуммаДокумента - ОтчетКомиссионераОПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ОтчетКомиссионераОПродажах КАК ОтчетКомиссионераОПродажах
		|ГДЕ
		|	(НЕ ОтчетКомиссионераОПродажах.УчитыватьНДС)
		|	И ОтчетКомиссионераОПродажах.Проведен
		|	И ОтчетКомиссионераОПродажах.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОтчетКомиссионераОПродажах.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтчетОРозничныхПродажах.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ОтчетОРозничныхПродажах.СуммаДокумента - ОтчетОРозничныхПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
		|ГДЕ
		|	(НЕ ОтчетОРозничныхПродажах.УчитыватьНДС)
		|	И ОтчетОРозничныхПродажах.Проведен
		|	И ОтчетОРозничныхПродажах.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОтчетОРозничныхПродажах.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаНМА.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ПередачаНМА.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПередачаНМА.СуммаДокумента - ПередачаНМА.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ПередачаНМА КАК ПередачаНМА
		|ГДЕ
		|	(НЕ ПередачаНМА.УчитыватьНДС)
		|	И ПередачаНМА.Проведен
		|	И ПередачаНМА.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПередачаНМА.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПередачаОС.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ПередачаОС.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПередачаОС.СуммаДокумента - ПередачаОС.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ПередачаОС КАК ПередачаОС
		|ГДЕ
		|	(НЕ ПередачаОС.УчитыватьНДС)
		|	И ПередачаОС.Проведен
		|	И ПередачаОС.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ПередачаОС.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(РеализацияТоваровУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(РеализацияТоваровУслуг.СуммаДокумента - РеализацияТоваровУслуг.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Проведен
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (НЕ РеализацияТоваровУслуг.УчитыватьНДС)
		|	И РеализацияТоваровУслуг.Организация В(&Организация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтчетКомитентуОПродажах.Ссылка,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118),
		|	ВЫРАЗИТЬ(ОтчетКомитентуОПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ОтчетКомитентуОПродажах.СуммаДокумента - ОтчетКомитентуОПродажах.СуммаДокумента * 18 / 118 КАК ЧИСЛО(15, 2)),
		|	&ПустаяСсылкаНаСчетФактуруВыданный,
		|	1,
		|	&ТекстНДСНеУчитывается,
		|	&ТекстНеОтраженыВКнигеПродаж
		|ИЗ
		|	Документ.ОтчетКомитентуОПродажах КАК ОтчетКомитентуОПродажах
		|ГДЕ
		|	(НЕ ОтчетКомитентуОПродажах.УчитыватьНДС)
		|	И ОтчетКомитентуОПродажах.Проведен
		|	И ОтчетКомитентуОПродажах.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОтчетКомитентуОПродажах.Организация В(&Организация)";
			
	КонецЕсли;	
		
	НачисленияПоРеализацииНеВключенныеНДСНеУчитывается = Запрос.Выполнить().Выгрузить();
	
	
	//	Документы не включенные в книгу продаж
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДСНачисленныйОстатки.СчетФактура КАК СчетФактура,
	|	НДСНачисленныйОстатки.СтавкаНДС,
	|	НДСНачисленныйОстатки.СуммаБезНДСОстаток,
	|	НДСНачисленныйОстатки.НДСОстаток
	|ПОМЕСТИТЬ ВТНДСНачисленныйОстатки
	|ИЗ
	|	РегистрНакопления.НДСНачисленный.Остатки(
	|			&НачалоСледующегоПериода,
	|			Организация В (&Организация)
	|				И ((НЕ ВидНачисления В (&НеОтражаютсяВРазделеНачислениеПоРеализацииСложныйУчет))
	|					И (НЕ ВидЦенности В (&ВидыЦенностейНалоговыйАгент))
	|					И (НЕ ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.СМРСобственнымиСилами)))) КАК НДСНачисленныйОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НДСНачисленныйОстатки.СчетФактура КАК ДокументРегистратор,
	|	НДСНачисленныйОстатки.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(НДСНачисленныйОстатки.СуммаБезНДСОстаток) КАК Сумма,
	|	СУММА(НДСНачисленныйОстатки.НДСОстаток) КАК СуммаНДС,
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
	|	1 КАК КоличествоДокументов,
	|	ВЫБОР
	|		КОГДА СУММА(НДСНачисленныйОстатки.НДСОстаток) > 0
	|			ТОГДА &ТекстНачислениеНеОтраженоВКнигеПродаж
	|		ИНАЧЕ &ТекстКорректировкаКнигиПродаж
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	&ТекстНеОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС
	|ИЗ
	|	ВТНДСНачисленныйОстатки КАК НДСНачисленныйОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО (НДСНачисленныйОстатки.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|				ИЛИ НДСНачисленныйОстатки.СчетФактура = СчетФактураВыданныйДокументыОснования.Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	НДСНачисленныйОстатки.СчетФактура,
	|	НДСНачисленныйОстатки.СтавкаНДС,
	|	СчетФактураВыданныйДокументыОснования.Ссылка";

	
	НачисленияПоРеализацииНеВключенныеНДСНеОтражен = Запрос.Выполнить().Выгрузить();
	
	//	Расшифровка ошибки "Реализация одной номенклатуры по разным ставкам"
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугТовары.Ссылка КАК ОшДокументРегистратор,
	|	РеализацияТоваровУслугТовары.СтавкаНДС КАК ОшСтавкаНДС,
	|	РеализацияТоваровУслугТовары.Номенклатура КАК ОшНоменклатура,
	|	1 КАК ОшКоличествоДокументов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугТовары.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокТоваров КАК СписокНоменклатуры)
	|	И РеализацияТоваровУслугТовары.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|	И РеализацияТоваровУслугТовары.Номенклатура <> &ПустаяНоменклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугУслуги.Ссылка,
	|	РеализацияТоваровУслугУслуги.СтавкаНДС,
	|	РеализацияТоваровУслугУслуги.Номенклатура,
	|	1
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	|ГДЕ
	|	РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС0)
	|	И РеализацияТоваровУслугУслуги.СтавкаНДС <> ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|	И РеализацияТоваровУслугУслуги.Номенклатура В
	|			(ВЫБРАТЬ
	|				СписокНоменклатуры.Номенклатура
	|			ИЗ
	|				СписокУслуг КАК СписокНоменклатуры)
	|	И РеализацияТоваровУслугУслуги.Ссылка.Организация В(&Организация)
	|	И РеализацияТоваровУслугУслуги.Ссылка В
	|			(ВЫБРАТЬ
	|				КнигаПродаж.СчетФактура КАК СчетФактура
	|			ИЗ
	|				ВТСоставКнигиПродаж КАК КнигаПродаж)
	|	И РеализацияТоваровУслугУслуги.Номенклатура <> &ПустаяНоменклатура";
			
	НачисленияПоРеализацииОшибки = Запрос.Выполнить().Выгрузить();
			
	ВнешнийНаборДанныхНачислениеРеализация = Новый Структура;
	ВнешнийНаборДанныхНачислениеРеализация.Вставить("НачисленияПоРеализацииВключенные",	
													НачисленияПоРеализацииВключенные);
	ВнешнийНаборДанныхНачислениеРеализация.Вставить("НачисленияПоРеализацииНеВключенныеНДСНеУчитывается", 
													НачисленияПоРеализацииНеВключенныеНДСНеУчитывается);
	ВнешнийНаборДанныхНачислениеРеализация.Вставить("НачисленияПоРеализацииНеВключенныеНДСНеОтражен",	
													НачисленияПоРеализацииНеВключенныеНДСНеОтражен);
	ВнешнийНаборДанныхНачислениеРеализация.Вставить("Ошибка", НачисленияПоРеализацииОшибки);
					
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхНачислениеРеализация", ВнешнийНаборДанныхНачислениеРеализация);
	
	ВключенныеВБазу = НачисленияПоРеализацииВключенные.Итог("СуммаНДС"); 
	НеВключенныеВБазу = НачисленияПоРеализацииНеВключенныеНДСНеУчитывается.Итог("СуммаНДС") 
		+ НачисленияПоРеализацииНеВключенныеНДСНеОтражен.Итог("СуммаНДС");
		
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	Если НачисленияПоРеализацииВключенные.Итог("КоличествоОшибок") > 0 Тогда
		СтруктураВозвращаемыхПараметров.Вставить("НаличиеОшибок", Истина);
	КонецЕсли;		
	
	КоличествоЗаписей = НачисленияПоРеализацииВключенные.Количество() 
		+ НачисленияПоРеализацииНеВключенныеНДСНеУчитывается.Количество()
		+ НачисленияПоРеализацииНеВключенныеНДСНеОтражен.Количество();
		 
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);
		 
	Возврат СтруктураВозвращаемыхПараметров;
	
КонецФункции // ПолучитьНаборДанныхНачислениеРеализацияСложныйУчетНДС()
			
			
// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	начислению НДС по прочим операциям в случае ведения сложного учета НДС
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхНачислениеВосстановлениеДругиеОперации(Запрос)

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НДСНачисленныйОстатки.СчетФактура КАК ДокументРегистратор,
	|	НДСНачисленныйОстатки.СтавкаНДС,
	|	НДСНачисленныйОстатки.СуммаБезНДСОстаток КАК Сумма,
	|	НДСНачисленныйОстатки.НДСОстаток КАК СуммаНДС,
	|	&ТекстНеОтраженыВКнигеПродаж КАК ПризнакОтраженияНДС,
	|	ВЫБОР
	|		КОГДА НДСНачисленныйОстатки.НДСОстаток > 0
	|			ТОГДА &ТекстНачислениеНеОтраженоВКнигеПродаж
	|		ИНАЧЕ &ТекстКорректировкаКнигиПродаж
	|	КОНЕЦ КАК ПризнакНаличияОшибок,
	|	1 КАК КоличествоДокументов,
	|	0 КАК СуммаВключенные,
	|	НДСНачисленныйОстатки.НДСОстаток КАК СуммаНеВключенные
	|ИЗ
	|	РегистрНакопления.НДСНачисленный.Остатки(
	|			&НачалоСледующегоПериода,
	|			Организация В (&Организация)
	|				И ВидНачисления = ЗНАЧЕНИЕ(Перечисление.НДСВидНачисления.НДСВосстановлен)) КАК НДСНачисленныйОстатки
	|ГДЕ
	|	(НЕ(НДСНачисленныйОстатки.СуммаБезНДСОстаток = 0
	|				И НДСНачисленныйОстатки.НДСОстаток = 0))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НДСЗаписиКнигиПродажОбороты.СчетФактура,
	|	НДСЗаписиКнигиПродажОбороты.СтавкаНДС,
	|	НДСЗаписиКнигиПродажОбороты.СуммаБезНДСОборот,
	|	НДСЗаписиКнигиПродажОбороты.НДСОборот,
	|	&ТекстОтраженыВКнигеПродаж,
	|	&ТекстБезОшибок,
	|	1,
	|	НДСЗаписиКнигиПродажОбороты.НДСОборот,
	|	0
	|ИЗ
	|	РегистрНакопления.НДСЗаписиКнигиПродаж.Обороты(
	|			&НачалоПериода,
	|			&КонецПериодаГраница,
	|			,
	|			Организация В (&Организация)
	|				И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПродажи.ВосстановлениеНДС)
	|				И ВидЦенности <> ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.АвансыВыданные)) КАК НДСЗаписиКнигиПродажОбороты";
	
	НачислениеВосстановлениеДругиеОперации = Запрос.Выполнить().Выгрузить();
	
	ВключенныеВБазу 	= НачислениеВосстановлениеДругиеОперации.Итог("СуммаВключенные");
	НеВключенныеВБазу 	= НачислениеВосстановлениеДругиеОперации.Итог("СуммаНеВключенные");
	
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	ВнешнийНаборДанныхНачислениеВосстановлениеДругиеОперации = Новый Структура;
	ВнешнийНаборДанныхНачислениеВосстановлениеДругиеОперации.Вставить("НачислениеВосстановлениеДругиеОперации", 
																	  НачислениеВосстановлениеДругиеОперации);
	
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхНачислениеВосстановлениеДругиеОперации",
									 ВнешнийНаборДанныхНачислениеВосстановлениеДругиеОперации);
	
	КоличествоЗаписей = НачислениеВосстановлениеДругиеОперации.Количество();
	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);
		
	Возврат СтруктураВозвращаемыхПараметров;		

КонецФункции // ПолучитьНаборДанныхНачислениеВосстановлениеДругиеОперации()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	операциям, начисление НДС с которых не отражается в книге продаж
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхНачислениеНеОтражаетсяВКнигеПродаж(Запрос)

	Запрос.Текст = "ВЫБРАТЬ
	               |	ФормированиеЗаписейКнигиПродажНеОтражаетсяВКниге.СчетФактура КАК ДокументРегистратор,
	               |	ФормированиеЗаписейКнигиПродажНеОтражаетсяВКниге.СтавкаНДС КАК СтавкаНДС,
	               |	ФормированиеЗаписейКнигиПродажНеОтражаетсяВКниге.СуммаБезНДС КАК Сумма,
	               |	ФормированиеЗаписейКнигиПродажНеОтражаетсяВКниге.НДС КАК СуммаНДС
	               |ИЗ
	               |	Документ.ФормированиеЗаписейКнигиПродаж.НеОтражаетсяВКниге КАК ФормированиеЗаписейКнигиПродажНеОтражаетсяВКниге
	               |ГДЕ
	               |	ФормированиеЗаписейКнигиПродажНеОтражаетсяВКниге.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И ФормированиеЗаписейКнигиПродажНеОтражаетсяВКниге.Ссылка.Проведен
	               |	И ФормированиеЗаписейКнигиПродажНеОтражаетсяВКниге.Ссылка.Организация В(&Организация)";
		
	НачислениеНеОтражаетсяВКнигеПродаж = Запрос.Выполнить().Выгрузить();
	
	
	ВнешнийНаборДанныхНачислениеНеОтражаетсяВКнигеПродаж = Новый Структура;
	ВнешнийНаборДанныхНачислениеНеОтражаетсяВКнигеПродаж.Вставить("НачислениеНеОтражаетсяВКнигеПродаж",
																  НачислениеНеОтражаетсяВКнигеПродаж);
	
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхНачислениеНеОтражаетсяВКнигеПродаж",
									 ВнешнийНаборДанныхНачислениеНеОтражаетсяВКнигеПродаж);
	
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", НачислениеНеОтражаетсяВКнигеПродаж.Итог("СуммаНДС"));
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", НачислениеНеОтражаетсяВКнигеПродаж.Количество() > 0);
		
	Возврат СтруктураВозвращаемыхПараметров;		

КонецФункции // ПолучитьНаборДанныхНачислениеНеОтражаетсяВКнигеПродаж()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	вычету НДС по приобретенным ценностям, реализованным по ставке НДС 0%
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхВычетПоПриобретеннымЦенностям0(Запрос)

	Если ИдентификаторКонфигурации = "БП" Тогда	
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставКнигиПокупок.СчетФактура КАК СчетФактура,
		|	СоставКнигиПокупок.СтавкаНДС,
		|	СоставКнигиПокупок.СуммаБезНДСОборот,
		|	СоставКнигиПокупок.НДСОборот
		|ПОМЕСТИТЬ ВТСоставКнигиПокупокПоПриобретеннымЦенностям0
		|ИЗ
		|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
		|			&НачалоПериода,
		|			&КонецПериодаГраница,
		|			,
		|			Организация В (&Организация)
		|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе))
		|				И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСКВычету0)) КАК СоставКнигиПокупок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСПредъявленныйРеализация0Остатки.СчетФактура КАК СчетФактура,
		|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки,
		|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток,
		|	НДСПредъявленныйРеализация0Остатки.НДСОстаток,
		|	НДСПредъявленныйРеализация0Остатки.Состояние,
		|	НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСПредъявленныйРеализация0Остатки.ВидЦенности КАК ВидЦенности
		|ПОМЕСТИТЬ ВТНДСПредъявленныйРеализация0Остатки
		|ИЗ
		|	РегистрНакопления.НДСПредъявленныйРеализация0.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И (НЕ ВидЦенности В (&ВидыЦенностейНалоговыйАгент))) КАК НДСПредъявленныйРеализация0Остатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	ВидЦенности,
		|	СтавкаНДС,
		|	СчетУчетаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСПредъявленныйОстатки.СчетФактура КАК СчетФактура,
		|	НДСПредъявленныйОстатки.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСПредъявленныйОстатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСПредъявленныйОстатки.ВидЦенности КАК ВидЦенности,
		|	НДСПредъявленныйОстатки.НДСОстаток
		|ПОМЕСТИТЬ ВТНДСПредъявленныйПоПриобретеннымЦенностям0
		|ИЗ
		|	РегистрНакопления.НДСПредъявленный.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе))) КАК НДСПредъявленныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	ВидЦенности,
		|	СтавкаНДС,
		|	СчетУчетаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоставКнигиПокупок.СчетФактура КАК ДокументРегистратор,
		|	NULL КАК ДокументОтгрузки,
		|	СоставКнигиПокупок.СтавкаНДС КАК СтавкаНДС,
		|	СоставКнигиПокупок.СуммаБезНДСОборот КАК Сумма,
		|	СоставКнигиПокупок.НДСОборот КАК СуммаНДС,
		|	&ТекстБезОшибок КАК ПризнакНаличияОшибок,
		|	&ТекстОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
		|	1 КАК КоличествоДокументов,
		|	СоставКнигиПокупок.НДСОборот КАК СуммаВключенные,
		|	0 КАК СуммаНеВключенные,
		|	ВЫБОР
		|		КОГДА СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|				ИЛИ СоставКнигиПокупок.СчетФактура.ПредъявленСчетФактура
		|			ТОГДА СоставКнигиПокупок.СчетФактура.Номер
		|		КОГДА СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Номер)
		|	КОНЕЦ КАК НомерВходящегоДокумента,
		|	ВЫБОР
		|		КОГДА СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|				ИЛИ СоставКнигиПокупок.СчетФактура.ПредъявленСчетФактура
		|			ТОГДА СоставКнигиПокупок.СчетФактура.Дата
		|		КОГДА СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Дата)
		|	КОНЕЦ КАК ДатаВходящегоДокумента,
		|	ВЫБОР
		|		КОГДА СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|				ИЛИ СоставКнигиПокупок.СчетФактура.ПредъявленСчетФактура
		|			ТОГДА СоставКнигиПокупок.СчетФактура
		|		КОГДА СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка, СчетФактураВыданныйДокументыОснования.Ссылка)
		|	КОНЕЦ КАК СчетФактура
		|ИЗ
		|	ВТСоставКнигиПокупокПоПриобретеннымЦенностям0 КАК СоставКнигиПокупок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ПО (СоставКнигиПокупок.СчетФактура = СчетФактураПолученныйДокументыОснования.ДокументОснование
		|				ИЛИ СоставКнигиПокупок.СчетФактура = СчетФактураПолученныйДокументыОснования.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО (СоставКнигиПокупок.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
		|				ИЛИ СоставКнигиПокупок.СчетФактура = СчетФактураВыданныйДокументыОснования.Ссылка)
		|			И (СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаРеализацию))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НДСПредъявленныйРеализация0Остатки.СчетФактура,
		|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки,
		|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС,
		|	НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток,
		|	НДСПредъявленныйРеализация0Остатки.НДСОстаток,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйРеализация0Остатки.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ПодтвержденаРеализация0)
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫБОР
		|								КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|										ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|										ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|										ИЛИ НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|									ТОГДА НДСПредъявленныйОстатки.СчетФактура
		|								КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|									ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка
		|								ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка, СчетФактураВыданныйДокументыОснования.Ссылка)
		|							КОНЕЦ ЕСТЬ NULL 
		|							ИЛИ ВЫБОР
		|								КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|										ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|										ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|										ИЛИ НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|									ТОГДА ЛОЖЬ
		|								КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|									ТОГДА ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, &НачалоСледующегоПериода) > &КонецПериода
		|								ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Дата), &НачалоСледующегоПериода) > &КонецПериода
		|							КОНЕЦ
		|						ТОГДА &ТекстОтсутствуетСФПолученный
		|					КОГДА (НЕ ВЫБОР
		|								КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|										ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|										ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|										ИЛИ НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|									ТОГДА НДСПредъявленныйОстатки.СчетФактура.Проведен
		|								КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|									ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
		|								ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.Проведен, СчетФактураВыданныйДокументыОснования.Ссылка.Проведен)
		|							КОНЕЦ)
		|						ТОГДА &ТекстСФПолученныйНеПроведен
		|					ИНАЧЕ ВЫБОР
		|							КОГДА НДСПредъявленныйРеализация0Остатки.НДСОстаток > 0
		|								ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
		|							ИНАЧЕ &ТекстКорректировкаКнигиПокупок
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОГДА НДСПредъявленныйРеализация0Остатки.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение)
		|			ТОГДА &ТекстВычетНеОтраженДоПодтвержденияСтавки0
		|		ИНАЧЕ &ТекстНеПодтвержденаСтавка
		|	КОНЕЦ,
		|	&ТекстНеОтраженыВКнигеПокупок,
		|	1,
		|	0,
		|	НДСПредъявленныйРеализация0Остатки.НДСОстаток,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура.Номер
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Номер)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура.Дата
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Дата)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура.ПредъявленСчетФактура
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка, СчетФактураВыданныйДокументыОснования.Ссылка)
		|	КОНЕЦ
		|ИЗ
		|	ВТНДСПредъявленныйРеализация0Остатки КАК НДСПредъявленныйРеализация0Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСПредъявленныйПоПриобретеннымЦенностям0 КАК НДСПредъявленныйОстатки
		|		ПО НДСПредъявленныйРеализация0Остатки.СчетФактура = НДСПредъявленныйОстатки.СчетФактура
		|			И НДСПредъявленныйРеализация0Остатки.СтавкаНДС = НДСПредъявленныйОстатки.СтавкаНДС
		|			И НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС = НДСПредъявленныйОстатки.СчетУчетаНДС
		|			И НДСПредъявленныйРеализация0Остатки.ВидЦенности = НДСПредъявленныйОстатки.ВидЦенности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ПО (НДСПредъявленныйОстатки.СчетФактура = СчетФактураПолученныйДокументыОснования.ДокументОснование
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура = СчетФактураПолученныйДокументыОснования.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО (НДСПредъявленныйОстатки.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура = СчетФактураВыданныйДокументыОснования.Ссылка)
		|			И (СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаРеализацию))
		|ГДЕ
		|	(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток > 0
		|			ИЛИ НДСПредъявленныйРеализация0Остатки.НДСОстаток > 0)
		|	И НДСПредъявленныйРеализация0Остатки.НДСОстаток <= НДСПредъявленныйОстатки.НДСОстаток";
		
		
	Иначе
		
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	СоставКнигиПокупок.СчетФактура КАК СчетФактура,
		|	СоставКнигиПокупок.СтавкаНДС,
		|	СоставКнигиПокупок.СуммаБезНДСОборот,
		|	СоставКнигиПокупок.НДСОборот
		|ПОМЕСТИТЬ ВТСоставКнигиПокупокПоПриобретеннымЦенностям0
		|ИЗ
		|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
		|			&НачалоПериода,
		|			&КонецПериодаГраница,
		|			,
		|			Организация В (&Организация)
		|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе))
		|				И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСКВычету0)) КАК СоставКнигиПокупок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСПредъявленныйРеализация0Остатки.СчетФактура КАК СчетФактура,
		|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки,
		|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток,
		|	НДСПредъявленныйРеализация0Остатки.НДСОстаток,
		|	НДСПредъявленныйРеализация0Остатки.Состояние,
		|	НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСПредъявленныйРеализация0Остатки.ВидЦенности КАК ВидЦенности
		|ПОМЕСТИТЬ ВТНДСПредъявленныйРеализация0Остатки
		|ИЗ
		|	РегистрНакопления.НДСПредъявленныйРеализация0.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И (НЕ ВидЦенности В (&ВидыЦенностейНалоговыйАгент))) КАК НДСПредъявленныйРеализация0Остатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	ВидЦенности,
		|	СтавкаНДС,
		|	СчетУчетаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСПредъявленныйОстатки.СчетФактура КАК СчетФактура,
		|	НДСПредъявленныйОстатки.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСПредъявленныйОстатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСПредъявленныйОстатки.ВидЦенности КАК ВидЦенности,
		|	НДСПредъявленныйОстатки.НДСОстаток
		|ПОМЕСТИТЬ ВТНДСПредъявленныйПоПриобретеннымЦенностям0
		|ИЗ
		|	РегистрНакопления.НДСПредъявленный.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И (НЕ ВидЦенности В (&ВидыЦенностейАвансыВсе))) КАК НДСПредъявленныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	ВидЦенности,
		|	СтавкаНДС,
		|	СчетУчетаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоставКнигиПокупок.СчетФактура КАК ДокументРегистратор,
		|	NULL КАК ДокументОтгрузки,
		|	СоставКнигиПокупок.СтавкаНДС КАК СтавкаНДС,
		|	СоставКнигиПокупок.СуммаБезНДСОборот КАК Сумма,
		|	СоставКнигиПокупок.НДСОборот КАК СуммаНДС,
		|	&ТекстБезОшибок КАК ПризнакНаличияОшибок,
		|	&ТекстОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
		|	1 КАК КоличествоДокументов,
		|	СоставКнигиПокупок.НДСОборот КАК СуммаВключенные,
		|	0 КАК СуммаНеВключенные,
		|	ВЫБОР
		|		КОГДА СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА СоставКнигиПокупок.СчетФактура.Номер
		|		КОГДА СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Номер)
		|	КОНЕЦ КАК НомерВходящегоДокумента,
		|	ВЫБОР
		|		КОГДА СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА СоставКнигиПокупок.СчетФактура.Дата
		|		КОГДА СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Дата)
		|	КОНЕЦ КАК ДатаВходящегоДокумента,
		|	ВЫБОР
		|		КОГДА СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА СоставКнигиПокупок.СчетФактура
		|		КОГДА СоставКнигиПокупок.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка, СчетФактураВыданныйДокументыОснования.Ссылка)
		|	КОНЕЦ КАК СчетФактура
		|ИЗ
		|	ВТСоставКнигиПокупокПоПриобретеннымЦенностям0 КАК СоставКнигиПокупок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ПО (СоставКнигиПокупок.СчетФактура = СчетФактураПолученныйДокументыОснования.ДокументОснование
		|				ИЛИ СоставКнигиПокупок.СчетФактура = СчетФактураПолученныйДокументыОснования.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО (СоставКнигиПокупок.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
		|				ИЛИ СоставКнигиПокупок.СчетФактура = СчетФактураВыданныйДокументыОснования.Ссылка)
		|			И (СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаРеализацию))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НДСПредъявленныйРеализация0Остатки.СчетФактура,
		|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки,
		|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС,
		|	НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток,
		|	НДСПредъявленныйРеализация0Остатки.НДСОстаток,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйРеализация0Остатки.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ПодтвержденаРеализация0)
		|			ТОГДА ВЫБОР
		|					КОГДА ВЫБОР
		|								КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|										ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|										ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|									ТОГДА НДСПредъявленныйОстатки.СчетФактура
		|								КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|									ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка
		|								ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка, СчетФактураВыданныйДокументыОснования.Ссылка)
		|							КОНЕЦ ЕСТЬ NULL 
		|							ИЛИ ВЫБОР
		|								КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|										ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|										ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|									ТОГДА ЛОЖЬ
		|								КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|									ТОГДА ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, &НачалоСледующегоПериода) > &КонецПериода
		|								ИНАЧЕ ЕСТЬNULL(ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Дата), &НачалоСледующегоПериода) > &КонецПериода
		|							КОНЕЦ
		|						ТОГДА &ТекстОтсутствуетСФПолученный
		|					КОГДА (НЕ ВЫБОР
		|								КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|										ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|										ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|									ТОГДА НДСПредъявленныйОстатки.СчетФактура.Проведен
		|								КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|									ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.Проведен
		|								ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.Проведен, СчетФактураВыданныйДокументыОснования.Ссылка.Проведен)
		|							КОНЕЦ)
		|						ТОГДА &ТекстСФПолученныйНеПроведен
		|					ИНАЧЕ ВЫБОР
		|							КОГДА НДСПредъявленныйРеализация0Остатки.НДСОстаток > 0
		|								ТОГДА &ТекстВычетНеОтраженВКнигеПокупок
		|							ИНАЧЕ &ТекстКорректировкаКнигиПокупок
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОГДА НДСПредъявленныйРеализация0Остатки.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение)
		|			ТОГДА &ТекстВычетНеОтраженДоПодтвержденияСтавки0
		|		ИНАЧЕ &ТекстНеПодтвержденаСтавка
		|	КОНЕЦ,
		|	&ТекстНеОтраженыВКнигеПокупок,
		|	1,
		|	0,
		|	НДСПредъявленныйРеализация0Остатки.НДСОстаток,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура.Номер
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.НомерВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Номер)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура.Дата
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка.ДатаВходящегоДокумента, СчетФактураВыданныйДокументыОснования.Ссылка.Дата)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.СчетФактураВыданный
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ГТДИмпорт
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетОРозничныхПродажах
		|			ТОГДА НДСПредъявленныйОстатки.СчетФактура
		|		КОГДА НДСПредъявленныйОстатки.СчетФактура ССЫЛКА Документ.ОтчетКомиссионераОПродажах
		|			ТОГДА СчетФактураПолученныйДокументыОснования.Ссылка
		|		ИНАЧЕ ЕСТЬNULL(СчетФактураПолученныйДокументыОснования.Ссылка, СчетФактураВыданныйДокументыОснования.Ссылка)
		|	КОНЕЦ
		|ИЗ
		|	ВТНДСПредъявленныйРеализация0Остатки КАК НДСПредъявленныйРеализация0Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНДСПредъявленныйПоПриобретеннымЦенностям0 КАК НДСПредъявленныйОстатки
		|		ПО НДСПредъявленныйРеализация0Остатки.СчетФактура = НДСПредъявленныйОстатки.СчетФактура
		|			И НДСПредъявленныйРеализация0Остатки.СтавкаНДС = НДСПредъявленныйОстатки.СтавкаНДС
		|			И НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС = НДСПредъявленныйОстатки.СчетУчетаНДС
		|			И НДСПредъявленныйРеализация0Остатки.ВидЦенности = НДСПредъявленныйОстатки.ВидЦенности
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|		ПО (НДСПредъявленныйОстатки.СчетФактура = СчетФактураПолученныйДокументыОснования.ДокументОснование
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура = СчетФактураПолученныйДокументыОснования.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО (НДСПредъявленныйОстатки.СчетФактура = СчетФактураВыданныйДокументыОснования.ДокументОснование
		|				ИЛИ НДСПредъявленныйОстатки.СчетФактура = СчетФактураВыданныйДокументыОснования.Ссылка)
		|			И (СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.НДСВидСчетаФактуры.НаРеализацию))
		|ГДЕ
		|	(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток > 0
		|			ИЛИ НДСПредъявленныйРеализация0Остатки.НДСОстаток > 0)
		|	И НДСПредъявленныйРеализация0Остатки.НДСОстаток <= НДСПредъявленныйОстатки.НДСОстаток";
		
	КонецЕсли; 

	ВычетПоПриобретеннымЦенностям0 = Запрос.Выполнить().Выгрузить();

    ВключенныеВБазу = ВычетПоПриобретеннымЦенностям0.Итог("СуммаВключенные");
	НеВключенныеВБазу = ВычетПоПриобретеннымЦенностям0.Итог("СуммаНеВключенные");
			
	ВнешнийНаборДанныхВычетПоПриобретеннымЦенностям0 = Новый Структура;
	ВнешнийНаборДанныхВычетПоПриобретеннымЦенностям0.Вставить("ВычетПоПриобретеннымЦенностям0", 
															  ВычетПоПриобретеннымЦенностям0);
	
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхВычетПоПриобретеннымЦенностям0", 
									 ВнешнийНаборДанныхВычетПоПриобретеннымЦенностям0);
	
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	КоличествоЗаписей = ВычетПоПриобретеннымЦенностям0.Количество();
	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);
		
	Возврат СтруктураВозвращаемыхПараметров;
	
КонецФункции // ПолучитьНаборДанныхВычетПоПриобретеннымЦенностям0()

// Выполняет запрос к базе данных для получения набора данных, необходимого для формирования расшифровки по
//	вычету НДС при исполнении обязанностей налогового агента при реализации ценностей по ставке НДС 0%
//
// Параметры
//  Запрос  - Запрос - запрос к базе данных
//
// Возвращаемое значение:
//   Структура   - структура параметров для формирования карты отчета
//
Функция ПолучитьНаборДанныхВычетНалоговыйАгент0(Запрос)
	
	Если ИдентификаторКонфигурации = "БП" Тогда
	
		Запрос.Текст =
		
		"ВЫБРАТЬ
		|	НДСПредъявленныйРеализация0Остатки.СчетФактура КАК СчетФактура,
		|	НДСПредъявленныйРеализация0Остатки.ВидЦенности КАК ВидЦенности,
		|	НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки,
		|	НДСПредъявленныйРеализация0Остатки.Состояние,
		|	НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток,
		|	НДСПредъявленныйРеализация0Остатки.НДСОстаток
		|ПОМЕСТИТЬ ВТНДСПредъявленныйРеализация0НалоговыйАгент0
		|ИЗ
		|	РегистрНакопления.НДСПредъявленныйРеализация0.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И ВидЦенности В (&ВидыЦенностейНалоговыйАгент)) КАК НДСПредъявленныйРеализация0Остатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	ВидЦенности,
		|	СтавкаНДС,
		|	СчетУчетаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСПредъявленныйОстатки.СчетФактура КАК СчетФактура,
		|	НДСПредъявленныйОстатки.ВидЦенности КАК ВидЦенности,
		|	НДСПредъявленныйОстатки.СтавкаНДС КАК СтавкаНДС,
		|	НДСПредъявленныйОстатки.СчетУчетаНДС КАК СчетУчетаНДС,
		|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток,
		|	НДСПредъявленныйОстатки.НДСОстаток
		|ПОМЕСТИТЬ ВТНДСПредъявленныйОстаткиНалоговыйАгент0
		|ИЗ
		|	РегистрНакопления.НДСПредъявленный.Остатки(
		|			&НачалоСледующегоПериода,
		|			Организация В (&Организация)
		|				И ВидЦенности В (&ВидыЦенностейНалоговыйАгент)
		|				И ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК НДСПредъявленныйОстатки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетФактура,
		|	ВидЦенности,
		|	СтавкаНДС,
		|	СчетУчетаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОбороты.Субконто1 КАК Субконто1,
		|	ХозрасчетныйОбороты.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТХозрасчетныйОборотыНалоговыйАгент0
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			&НачалоПериода,
		|			&КонецПериодаГраница,
		|			Регистратор,
		|			,
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами),
		|			Организация В (&Организация)
		|				И Субконто1 В
		|					(ВЫБРАТЬ
		|						НДСПредъявленный.СчетФактура
		|					ИЗ
		|						ВТНДСПредъявленныйОстаткиНалоговыйАгент0 КАК НДСПредъявленный),
		|			КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)),
		|			) КАК ХозрасчетныйОбороты
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХозрасчетныйОборотыБюджет.Субконто1 КАК Субконто1,
		|	ХозрасчетныйОборотыБюджет.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВТХозрасчетныйОборотыБюджетНалоговыйАгент0
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(, &КонецПериодаГраница, Регистратор, Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНалоговогоАгента), ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами), Организация В (&Организация), КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета)), ) КАК ХозрасчетныйОборотыБюджет
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТХозрасчетныйОборотыНалоговыйАгент0.Субконто1 КАК Субконто1,
		|	ВТХозрасчетныйОборотыНалоговыйАгент0.Регистратор,
		|	ВТХозрасчетныйОборотыБюджетНалоговыйАгент0.Регистратор КАК РегистраторОплатыВБюджет
		|ПОМЕСТИТЬ ВТХозрасчетныйОборотыРезультирующая
		|ИЗ
		|	ВТХозрасчетныйОборотыНалоговыйАгент0 КАК ВТХозрасчетныйОборотыНалоговыйАгент0
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХозрасчетныйОборотыБюджетНалоговыйАгент0 КАК ВТХозрасчетныйОборотыБюджетНалоговыйАгент0
		|		ПО ВТХозрасчетныйОборотыНалоговыйАгент0.Регистратор = ВТХозрасчетныйОборотыБюджетНалоговыйАгент0.Субконто1
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Субконто1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СоставКнигиПокупок.СчетФактура КАК СчетФактура,
		|	СоставКнигиПокупок.СтавкаНДС,
		|	СоставКнигиПокупок.ДокументОплаты КАК ДокументОплаты,
		|	СоставКнигиПокупок.СуммаБезНДСОборот,
		|	СоставКнигиПокупок.НДСОборот
		|ПОМЕСТИТЬ ВТСоставКнигиПокупокНалоговыйАгент0
		|ИЗ
		|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
		|			&НачалоПериода,
		|			&КонецПериодаГраница,
		|			,
		|			Организация В (&Организация)
		|				И ВидЦенности В (&ВидыЦенностейНалоговыйАгент)
		|				И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСКВычету0)) КАК СоставКнигиПокупок
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументОплаты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НДСПредъявленныйРеализация0Остатки.СчетФактура КАК ДокументРегистратор,
		|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС,
		|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйРеализация0Остатки.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение)
		|			ТОГДА &ТекстВычетНеОтраженДоПодтвержденияСтавки0
		|		ИНАЧЕ &ТекстВычетНеОтраженВКнигеПокупок
		|	КОНЕЦ КАК ПризнакНаличияОшибок,
		|	&ТекстНеОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
		|	СУММА(ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0)) КАК Сумма,
		|	СУММА(ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0)) КАК СуммаНДС,
		|	1 КАК КоличествоДокументов,
		|	СчетФактураВыданныйДокументыОснования.Ссылка КАК СчетФактура,
		|	ХозрасчетныйОбороты.Регистратор КАК ДокументОплатыПоставщику,
		|	ХозрасчетныйОбороты.РегистраторОплатыВБюджет КАК ДокументОплатыВБюджет,
		|	0 КАК СуммаВключенные,
		|	СУММА(ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0)) КАК СуммаНеВключенные
		|ИЗ
		|	ВТНДСПредъявленныйРеализация0НалоговыйАгент0 КАК НДСПредъявленныйРеализация0Остатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНДСПредъявленныйОстаткиНалоговыйАгент0 КАК НДСПредъявленныйОстатки
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТХозрасчетныйОборотыРезультирующая КАК ХозрасчетныйОбороты
		|			ПО НДСПредъявленныйОстатки.СчетФактура = ХозрасчетныйОбороты.Субконто1
		|		ПО НДСПредъявленныйРеализация0Остатки.СчетФактура = НДСПредъявленныйОстатки.СчетФактура
		|			И НДСПредъявленныйРеализация0Остатки.ВидЦенности = НДСПредъявленныйОстатки.ВидЦенности
		|			И НДСПредъявленныйРеализация0Остатки.СтавкаНДС = НДСПредъявленныйОстатки.СтавкаНДС
		|			И НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС = НДСПредъявленныйОстатки.СчетУчетаНДС
		|			И (НДСПредъявленныйОстатки.СуммаБезНДСОстаток + НДСПредъявленныйОстатки.НДСОстаток > 0)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО (ХозрасчетныйОбороты.Регистратор = СчетФактураВыданныйДокументыОснования.ДокументОснование)
		|ГДЕ
		|	(НДСПредъявленныйОстатки.СуммаБезНДСОстаток > 0
		|			ИЛИ НДСПредъявленныйОстатки.НДСОстаток > 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ХозрасчетныйОбороты.РегистраторОплатыВБюджет,
		|	СчетФактураВыданныйДокументыОснования.Ссылка,
		|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки,
		|	НДСПредъявленныйРеализация0Остатки.СчетФактура,
		|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС,
		|	ВЫБОР
		|		КОГДА НДСПредъявленныйРеализация0Остатки.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение)
		|			ТОГДА &ТекстВычетНеОтраженДоПодтвержденияСтавки0
		|		ИНАЧЕ &ТекстВычетНеОтраженВКнигеПокупок
		|	КОНЕЦ,
		|	ХозрасчетныйОбороты.Регистратор
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СоставКнигиПокупок.СчетФактура,
		|	СоставКнигиПокупок.СтавкаНДС,
		|	NULL,
		|	&ТекстБезОшибок,
		|	&ТекстОтраженыВКнигеПокупок,
		|	СоставКнигиПокупок.СуммаБезНДСОборот,
		|	СоставКнигиПокупок.НДСОборот,
		|	1,
		|	СчетФактураВыданныйДокументыОснования.Ссылка,
		|	ХозрасчетныйОборотыОплата.Регистратор,
		|	ХозрасчетныйОборотыОплата.РегистраторОплатыВБюджет,
		|	СоставКнигиПокупок.НДСОборот,
		|	0
		|ИЗ
		|	ВТСоставКнигиПокупокНалоговыйАгент0 КАК СоставКнигиПокупок
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
		|		ПО СоставКнигиПокупок.ДокументОплаты = СчетФактураВыданныйДокументыОснования.ДокументОснование
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХозрасчетныйОборотыРезультирующая КАК ХозрасчетныйОборотыОплата
		|		ПО СоставКнигиПокупок.СчетФактура = ХозрасчетныйОборотыОплата.Субконто1";
		
	Иначе
		
		Если РедакцияКонфигурации = "1.2" ИЛИ РедакцияКонфигурации = "1.0" Тогда
			
			ВычетИсполнениеОНА0 = Новый ТаблицаЗначений;
								
			СтруктураВозвращаемыхПараметров = Новый Структура();
			СтруктураВозвращаемыхПараметров.Вставить("Включенные", 0);
			СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", 0);
			
			ВнешнийНаборДанныхВычетИсполнениеОНА0 = Новый Структура;
			ВнешнийНаборДанныхВычетИсполнениеОНА0.Вставить("ВычетИсполнениеОНА0",ВычетИсполнениеОНА0);
			
			СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхВычетИсполнениеОНА0", ВнешнийНаборДанныхВычетИсполнениеОНА0);
					
			СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", Ложь);
				
			Возврат СтруктураВозвращаемыхПараметров;

		Иначе	
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	НДСПредъявленныйРеализация0Остатки.СчетФактура,
			|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС,
			|	НДСПредъявленныйРеализация0Остатки.ВидЦенности,
			|	НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС,
			|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки,
			|	НДСПредъявленныйРеализация0Остатки.Состояние,
			|	НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток,
			|	НДСПредъявленныйРеализация0Остатки.НДСОстаток
			|ПОМЕСТИТЬ ВТНДСПредъявленныйРеализация0ВычетНалоговыйАгент0
			|ИЗ
			|	РегистрНакопления.НДСПредъявленныйРеализация0.Остатки(
			|			&НачалоСледующегоПериода,
			|			Организация В (&Организация)
			|				И ВидЦенности В (&ВидыЦенностейНалоговыйАгент)) КАК НДСПредъявленныйРеализация0Остатки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	НДСПредъявленныйРеализация0Остатки.СчетФактура,
			|	НДСПредъявленныйРеализация0Остатки.ВидЦенности,
			|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС,
			|	НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НДСПредъявленныйОстатки.СчетФактура,
			|	НДСПредъявленныйОстатки.ВидЦенности,
			|	НДСПредъявленныйОстатки.СтавкаНДС,
			|	НДСПредъявленныйОстатки.СчетУчетаНДС,
			|	НДСПредъявленныйОстатки.СуммаБезНДСОстаток,
			|	НДСПредъявленныйОстатки.НДСОстаток
			|ПОМЕСТИТЬ ВТНДСПредъявленныйОстаткиВычетНалоговыйАгент0
			|ИЗ
			|	РегистрНакопления.НДСПредъявленный.Остатки(
			|			&НачалоСледующегоПериода,
			|			Организация В (&Организация)
			|				И ВидЦенности В (&ВидыЦенностейНалоговыйАгент)
			|				И ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК НДСПредъявленныйОстатки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	НДСПредъявленныйОстатки.СчетФактура,
			|	НДСПредъявленныйОстатки.ВидЦенности,
			|	НДСПредъявленныйОстатки.СтавкаНДС,
			|	НДСПредъявленныйОстатки.СчетУчетаНДС
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасчетыПоПриобретению.Регистратор,
			|	РасчетыПоПриобретению.Документ,
			|	РасчетыПоПриобретению.Контрагент,
			|	РасчетыПоПриобретению.ДоговорКонтрагента
			|ПОМЕСТИТЬ ВТРасчетыПоПриобретениюВычетНалоговыйАгент0
			|ИЗ
			|	РегистрНакопления.РасчетыПоПриобретениюВУсловныхЕдиницахОрганизации.Обороты(
			|			&НачалоПериода,
			|			&КонецПериодаГраница,
			|			Регистратор,
			|			ДоговорКонтрагента.УчетАгентскогоНДС
			|				И ДоговорКонтрагента.НалоговыйАгентПоОплате
			|				И Организация В (&Организация)) КАК РасчетыПоПриобретению
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	РасчетыПоПриобретению.Контрагент,
			|	РасчетыПоПриобретению.ДоговорКонтрагента
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ХозрасчетныйОборотыПогашенияВБюджет.Регистратор,
			|	ХозрасчетныйОборотыПогашенияВБюджет.Субконто1,
			|	ХозрасчетныйОборотыПогашенияВБюджет.Субконто2
			|ПОМЕСТИТЬ ВТХозрасчетныйОборотыПогашенияВБюджетВычетНалоговыйАгент0
			|ИЗ
			|	РегистрБухгалтерии.Хозрасчетный.Обороты(
			|			,
			|			&КонецПериодаГраница,
			|			Регистратор,
			|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСНалоговогоАгента),
			|			,
			|			Организация В (&Организация),
			|			КорСчет В (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетныеСчета), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВалютныеСчета))
			|				ИЛИ КорСчет.Родитель = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СпециальныеСчета),
			|			) КАК ХозрасчетныйОборотыПогашенияВБюджет
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ХозрасчетныйОборотыПогашенияВБюджет.Субконто1,
			|	ХозрасчетныйОборотыПогашенияВБюджет.Субконто2
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасчетыПоПриобретению.Регистратор,
			|	РасчетыПоПриобретению.Документ,
			|	РасчетыПоПриобретению.Контрагент,
			|	РасчетыПоПриобретению.ДоговорКонтрагента,
			|	ХозрасчетныйОборотыПогашенияВБюджет.Регистратор КАК ДокументОплатыВБюджет,
			|	ХозрасчетныйОборотыПогашенияВБюджет.Субконто1,
			|	ХозрасчетныйОборотыПогашенияВБюджет.Субконто2,
			|	СчетФактураВыданныйДокументыОснования.Ссылка КАК ДокументСчетФактура
			|ПОМЕСТИТЬ ВТРасчетыПоПриобретениюВычетНалоговыйАгент0ИХозрасчетныйОборотыПогашенияВБюджет
			|ИЗ
			|	ВТРасчетыПоПриобретениюВычетНалоговыйАгент0 КАК РасчетыПоПриобретению
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХозрасчетныйОборотыПогашенияВБюджетВычетНалоговыйАгент0 КАК ХозрасчетныйОборотыПогашенияВБюджет
			|		ПО (ХозрасчетныйОборотыПогашенияВБюджет.Субконто1 = РасчетыПоПриобретению.Контрагент)
			|			И (ХозрасчетныйОборотыПогашенияВБюджет.Субконто2 = РасчетыПоПриобретению.ДоговорКонтрагента)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
			|		ПО РасчетыПоПриобретению.Регистратор = СчетФактураВыданныйДокументыОснования.ДокументОснование
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	РасчетыПоПриобретению.Документ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СоставКнигиПокупок.СчетФактура,
			|	СоставКнигиПокупок.СтавкаНДС,
			|	СоставКнигиПокупок.ДокументОплаты,
			|	СоставКнигиПокупок.СуммаБезНДСОборот,
			|	СоставКнигиПокупок.НДСОборот,
			|	СоставКнигиПокупок.Поставщик,
			|	СоставКнигиПокупок.ДоговорКонтрагента
			|ПОМЕСТИТЬ ВТСоставКнигиПокупокВычетНалоговыйАгент0
			|ИЗ
			|	РегистрНакопления.НДСЗаписиКнигиПокупок.Обороты(
			|			&НачалоПериода,
			|			&КонецПериодаГраница,
			|			,
			|			ВидЦенности В (&ВидыЦенностейНалоговыйАгент)
			|				И Организация В (&Организация)
			|				И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.ПредъявленНДСКВычету0)) КАК СоставКнигиПокупок
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	СоставКнигиПокупок.ДокументОплаты
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СоставКнигиПокупок.СчетФактура,
			|	СоставКнигиПокупок.СтавкаНДС,
			|	СоставКнигиПокупок.ДокументОплаты,
			|	СоставКнигиПокупок.СуммаБезНДСОборот,
			|	СоставКнигиПокупок.НДСОборот,
			|	СоставКнигиПокупок.Поставщик,
			|	СоставКнигиПокупок.ДоговорКонтрагента,
			|	СчетФактураВыданныйДокументыОснования.Ссылка КАК ДокументСчетФактура
			|ПОМЕСТИТЬ ВТСоставКнигиПокупокВычетНалоговыйАгент0СчетаФактуры
			|ИЗ
			|	ВТСоставКнигиПокупокВычетНалоговыйАгент0 КАК СоставКнигиПокупок
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
			|		ПО СоставКнигиПокупок.ДокументОплаты = СчетФактураВыданныйДокументыОснования.ДокументОснование
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	СоставКнигиПокупок.Поставщик,
			|	СоставКнигиПокупок.ДоговорКонтрагента
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НДСПредъявленныйРеализация0Остатки.СчетФактура КАК ДокументРегистратор,
			|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС,
			|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки КАК ДокументОтгрузки,
			|	ВЫБОР
			|		КОГДА НДСПредъявленныйРеализация0Остатки.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение)
			|			ТОГДА &ТекстВычетНеОтраженДоПодтвержденияСтавки0
			|		ИНАЧЕ &ТекстВычетНеОтраженВКнигеПокупок
			|	КОНЕЦ КАК ПризнакНаличияОшибок,
			|	&ТекстНеОтраженыВКнигеПокупок КАК ПризнакОтраженияНДС,
			|	СУММА(ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.СуммаБезНДСОстаток, 0)) КАК Сумма,
			|	СУММА(ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0)) КАК СуммаНДС,
			|	1 КАК КоличествоДокументов,
			|	РасчетыПоПриобретению.ДокументСчетФактура КАК СчетФактура,
			|	РасчетыПоПриобретению.Регистратор КАК ДокументОплатыПоставщику,
			|	РасчетыПоПриобретению.ДокументОплатыВБюджет КАК ДокументОплатыВБюджет,
			|	0 КАК СуммаВключенные,
			|	СУММА(ЕСТЬNULL(НДСПредъявленныйРеализация0Остатки.НДСОстаток, 0)) КАК СуммаНеВключенные
			|ИЗ
			|	ВТНДСПредъявленныйРеализация0ВычетНалоговыйАгент0 КАК НДСПредъявленныйРеализация0Остатки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТНДСПредъявленныйОстаткиВычетНалоговыйАгент0 КАК НДСПредъявленныйОстатки
			|			ЛЕВОЕ СОЕДИНЕНИЕ ВТРасчетыПоПриобретениюВычетНалоговыйАгент0ИХозрасчетныйОборотыПогашенияВБюджет КАК РасчетыПоПриобретению
			|			ПО (РасчетыПоПриобретению.Документ = НДСПредъявленныйОстатки.СчетФактура)
			|		ПО НДСПредъявленныйРеализация0Остатки.СчетФактура = НДСПредъявленныйОстатки.СчетФактура
			|			И НДСПредъявленныйРеализация0Остатки.ВидЦенности = НДСПредъявленныйОстатки.ВидЦенности
			|			И НДСПредъявленныйРеализация0Остатки.СтавкаНДС = НДСПредъявленныйОстатки.СтавкаНДС
			|			И НДСПредъявленныйРеализация0Остатки.СчетУчетаНДС = НДСПредъявленныйОстатки.СчетУчетаНДС
			|			И (НДСПредъявленныйОстатки.СуммаБезНДСОстаток + НДСПредъявленныйОстатки.НДСОстаток > 0)
			|ГДЕ
			|	(НДСПредъявленныйОстатки.СуммаБезНДСОстаток > 0
			|			ИЛИ НДСПредъявленныйОстатки.НДСОстаток > 0)
			|
			|СГРУППИРОВАТЬ ПО
			|	НДСПредъявленныйРеализация0Остатки.СчетФактура,
			|	НДСПредъявленныйРеализация0Остатки.СтавкаНДС,
			|	НДСПредъявленныйРеализация0Остатки.ДокументОтгрузки,
			|	ВЫБОР
			|		КОГДА НДСПредъявленныйРеализация0Остатки.Состояние = ЗНАЧЕНИЕ(Перечисление.НДССостоянияРеализация0.ОжидаетсяПодтверждение)
			|			ТОГДА &ТекстВычетНеОтраженДоПодтвержденияСтавки0
			|		ИНАЧЕ &ТекстВычетНеОтраженВКнигеПокупок
			|	КОНЕЦ,
			|	РасчетыПоПриобретению.ДокументСчетФактура,
			|	РасчетыПоПриобретению.Регистратор,
			|	РасчетыПоПриобретению.ДокументОплатыВБюджет
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СоставКнигиПокупок.СчетФактура,
			|	СоставКнигиПокупок.СтавкаНДС,
			|	NULL,
			|	&ТекстБезОшибок,
			|	&ТекстОтраженыВКнигеПокупок,
			|	СоставКнигиПокупок.СуммаБезНДСОборот,
			|	СоставКнигиПокупок.НДСОборот,
			|	1,
			|	СоставКнигиПокупок.ДокументСчетФактура,
			|	СоставКнигиПокупок.ДокументОплаты,
			|	ХозрасчетныйОборотыОплата.Регистратор,
			|	СоставКнигиПокупок.НДСОборот,
			|	0
			|ИЗ
			|	ВТСоставКнигиПокупокВычетНалоговыйАгент0СчетаФактуры КАК СоставКнигиПокупок
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТХозрасчетныйОборотыПогашенияВБюджетВычетНалоговыйАгент0 КАК ХозрасчетныйОборотыОплата
			|		ПО СоставКнигиПокупок.Поставщик = ХозрасчетныйОборотыОплата.Субконто1
			|			И СоставКнигиПокупок.ДоговорКонтрагента = ХозрасчетныйОборотыОплата.Субконто2";

			
		КонецЕсли;	
		
	КонецЕсли;		
		
	ВычетИсполнениеОНА0 = Запрос.Выполнить().Выгрузить();
	
	ВключенныеВБазу = ВычетИсполнениеОНА0.Итог("СуммаВключенные");
	НеВключенныеВБазу = ВычетИсполнениеОНА0.Итог("СуммаНеВключенные");
	
	СтруктураВозвращаемыхПараметров = Новый Структура();
	СтруктураВозвращаемыхПараметров.Вставить("Включенные", ВключенныеВБазу);
	СтруктураВозвращаемыхПараметров.Вставить("НеВключенные", НеВключенныеВБазу);
	
	ВнешнийНаборДанныхВычетИсполнениеОНА0 = Новый Структура;
	ВнешнийНаборДанныхВычетИсполнениеОНА0.Вставить("ВычетИсполнениеОНА0",ВычетИсполнениеОНА0);
	
	СтруктураВнешнихНаборов.Вставить("ВнешнийНаборДанныхВычетИсполнениеОНА0", ВнешнийНаборДанныхВычетИсполнениеОНА0);
	
	КоличествоЗаписей = ВычетИсполнениеОНА0.Количество();
	
	СтруктураВозвращаемыхПараметров.Вставить("ИмеютсяЗаписи", КоличествоЗаписей > 0);
		
	Возврат СтруктураВозвращаемыхПараметров;		

КонецФункции // ПолучитьНаборДанныхВычетИсполнениеОНА0()

#КонецЕсли

КоллекцияНастроек 					= Новый Структура;
СтруктураВнешнихНаборов 			= Новый Структура;
//	Получаем идентификатор конфигурации
ИДКонфигурации						= РегламентированнаяОтчетность.ИДКонфигурации();
//	Определяем наличие учета обособленных подразделений
УчетОбособленныхПодразделений		= (ИДКонфигурации = "БПКОРП" ИЛИ ИДКонфигурации = "БАУКОРП");
//	Для функционирования отчета необходимо разделение конфигураций на два типа: 1.УПП(КА) 2.Все остальные
ИдентификаторКонфигурации 			= ?(ИДКонфигурации = "УПП" ИЛИ ИДКонфигурации = "КА", "УПП", "БП");
РедакцияКонфигурации				= РегламентированнаяОтчетность.РедакцияКонфигурации();

СписокРасшифровокСДетализацией = Новый Массив;
СписокРасшифровокСДетализацией.Добавить("РасшифровкаНачислениеРеализация");
СписокРасшифровокСДетализацией.Добавить("РасшифровкаНачислениеРеализацияУпрощенныйУчетНДС");
СписокРасшифровокСДетализацией.Добавить("РасшифровкаВычетПриобретенныеЦенности");
СписокРасшифровокСДетализацией.Добавить("РасшифровкаВычетПоПриобретеннымЦенностямУпрощенныйУчетНДС");
