
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЭтоГруппа Тогда

		СтрокаОшибки = "Элемент справочника ""Банки"" " + Наименование + " не записан!";
        
		Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(СокрЛП(КоррСчет)) Тогда

			ОбщегоНазначения.СообщитьОбОшибке("В составе Корр.счета банка должны быть только цифры.",, СтрокаОшибки);
			Отказ = Истина;

		КонецЕсли;

		Если НЕ ОбщегоНазначения.ТолькоЦифрыВСтроке(СокрЛП(Код)) Тогда

			ОбщегоНазначения.СообщитьОбОшибке("В составе БИК банка должны быть только цифры.",, СтрокаОшибки);
			Отказ = Истина;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

