Перем глОбщиеЗначения Экспорт;

Перем глТекущийПользователь Экспорт;

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАВЕРШЕНИЯ РАБОТЫ ПОЛЬЗОВАТЕЛЕЙ И ОБРАБОТКИ ПАРАМЕТРОВ

// Процедура выполняется при старте системы во внешнем соединении
//
Процедура ПриНачалеРаботыСистемы()
    	
	ПользовательОпределен = Ложь;
	ОписаниеОшибкиОпределенияПользователя = "";
	Если Не ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь) Тогда
		Если УправлениеПользователями.ОпределитьТекущегоПользователя(ОписаниеОшибкиОпределенияПользователя) Тогда
			ПользовательОпределен = ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь);
		КонецЕсли;
	Иначе
		ПользовательОпределен = Истина;
	КонецЕсли;
	
	Если Не ПользовательОпределен Тогда
		Если ПустаяСтрока(ОписаниеОшибкиОпределенияПользователя) Тогда
			ОписаниеОшибкиОпределенияПользователя = "Ошибка идентификации пользователя. Обратитесь к администратору";
		КонецЕсли;
		ВызватьИсключение ОписаниеОшибкиОпределенияПользователя;
	КонецЕсли;
	
	глТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;

КонецПроцедуры //ПриНачалеРаботыСистемы()

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ПАРАМЕТРОВ СЕАНСА

Функция глЗначениеПеременной(Имя) Экспорт
	
	Возврат ОбщегоНазначения.ПолучитьЗначениеПеременной(Имя, глОбщиеЗначения);

КонецФункции

// Процедура установки значения экспортных переменных модуля приложения
//
// Параметры
//  Имя - строка, содержит имя переменной целиком
// 	Значение - значение переменной
//
Процедура глЗначениеПеременнойУстановить(Имя, Значение, ОбновлятьВоВсехКэшах = Ложь) Экспорт
	
	ОбщегоНазначения.УстановитьЗначениеПеременной(Имя, глОбщиеЗначения, Значение, ОбновлятьВоВсехКэшах);
	
КонецПроцедуры


