// Обработчик события УстановкаПараметровСеанса()
//
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	Если ТребуемыеПараметры = Неопределено Тогда
		// Раздел установки параметров сеанса при начале сеанса (ИменаПараметровСеанса = Неопределено)
		// Выполняется установка параметров сеанса, которые можно инициализировать 
		// при начале работы системы
		
		// инициализация параметра сеанса "ТекущийПользователь"
		ПолныеПрава.УстановитьПараметрСеансаТекущийПользователь();	
		ПолныеПрава.УстановитьИзменяемыеПараметрыСеансаПользователя();
		
	Иначе
		// Установка параметров сеанса "по требованию"
		
		// Параметры сеанса, инициализация которых требует обращения к одним и тем же данным
		// следует инициализировать сразу группой. Для того, чтобы избежать их повторной инициализации,
		// имена уже установленных параметров сеанса сохраняются в массиве УстановленныеПараметры
		УстановленныеПараметры = Новый Массив;
		Для каждого ИмяПараметра Из ТребуемыеПараметры Цикл
			УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // УстановкаПараметровСеанса

// Установить значения параметров сеанса и возвратить имена установленных параметров сеанса
// в параметре УстановленныеПараметры.
//
// Параметры
//  ИмяПараметра  - Строка - имя параметра сеанса, который требуется установить (проинициализировать).
//  УстановленныеПараметры  - Массив - массив, в который добавляются имена
//                                     установленных (проинициализированных) параметров.
//
Процедура УстановитьЗначениеПараметраСеанса(Знач ИмяПараметра, УстановленныеПараметры)
	
	// {ОбменДаннымиБСП
	ОбменДаннымиСервер.УстановитьПараметрыСеанса(ИмяПараметра, УстановленныеПараметры);
	// }ОбменДаннымиБСП
	
КонецПроцедуры
