Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЭтоГруппа Тогда
		
		Если ВидДеятельностиДляНалоговогоУчетаЗатрат.Пустая() Тогда
			Сообщить("Укажите вид отнесения расходов к деятельности, облагаемой ЕНВД!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
		Если ВидДеятельностиДляНалоговогоУчетаЗатрат = Перечисления.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ПредпринимательскаяДеятельностьОблагаемаяЕНВД Тогда
			ПринятиеКналоговомуУчету = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
