
Процедура ПриЗаписи(Отказ, Замещение)
	
	Перем ОбновлятьЗначениеГлПеременной;
	
	СвойствоОсновнаяОрганизация = ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяОрганизация;
	
	Для Каждого Запись ИЗ ЭтотОбъект Цикл
		Если Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь Тогда
			Если Запись.Настройка = СвойствоОсновнаяОрганизация Тогда
				глЗначениеПеременнойУстановить("ОсновнаяОрганизация", Запись.Значение, Истина);
			КонецЕсли;		
		КонецЕсли;
	КонецЦикла;
		
	КэшНастроекПользователей = глЗначениеПеременной("ЗначенияНастроекПользователей");
	УправлениеПользователями.ИнформироватьОИзмененииНастроекПравАктивныхПользователей(ЭтотОбъект, 
																					  КэшНастроекПользователей, 
																					  "Настройка",
																					  глЗначениеПеременной("глТекущийПользователь"), 
																					  "значения настроек",
																					  ОбновлятьЗначениеГлПеременной);
																					  
	Если ОбновлятьЗначениеГлПеременной Тогда
		глЗначениеПеременнойУстановить("ЗначенияНастроекПользователей", КэшНастроекПользователей, Истина);
	КонецЕсли;	
	
КонецПроцедуры
